{
    "yfXqZkU5iXE07GSHzdsQBA": {
        "kw": [
            "flatmates",
            "food",
            "while",
            "menu",
            "door"
        ],
        "candidate": [
            "8PmbCVEjWGPouD1Tst6FsQ",
            "z-3ZDmVbHZjDrYZE42yKZA",
            "EKEPtNKJdZxRhYoFhuG8ew",
            "V0tRCjf95FTqVJvmxdeqbQ"
        ],
        "explanation": {
            "8PmbCVEjWGPouD1Tst6FsQ": "This restaurant offers a diverse menu with shared platters ideal for groups, making it perfect for flatmates.",
            "z-3ZDmVbHZjDrYZE42yKZA": "Known for its tasty dishes and comfortable atmosphere, it's a great place for casual dining with friends.",
            "EKEPtNKJdZxRhYoFhuG8ew": "Offers a good variety but may not be as conducive to sharing as the top two options.",
            "V0tRCjf95FTqVJvmxdeqbQ": "While it has good food, the menu lacks options for group sharing, making it less ideal for dining with flatmates."
        }
    },
    "hutJzKEYHuVq6CP-XSARgg": {
        "kw": [
            "flatmates",
            "food",
            "while",
            "menu",
            "fried rice"
        ],
        "candidate": [
            "hJNjKc4sKgWG__KitlJ1ag",
            "sxuEde0_sVFY-Uk9gpHy_g",
            "QMySP-qHdwQNZY0gDba0ng",
            "adI5BlJCtvWq2uAwmyndXA"
        ],
        "explanation": {
            "hJNjKc4sKgWG__KitlJ1ag": "Features a diverse menu with a popular fried rice dish ideal for sharing with flatmates.",
            "sxuEde0_sVFY-Uk9gpHy_g": "Offers a casual dining atmosphere with multiple rice options, making it great for a group.",
            "QMySP-qHdwQNZY0gDba0ng": "Has a solid fried rice offering but is less conducive for a flatmates gathering compared to the top two.",
            "adI5BlJCtvWq2uAwmyndXA": "While it may serve good food, its menu lacks the fried rice focus and group-friendly environment."
        }
    },
    "2UkZKQBZVuroUBKYs9WzeQ": {
        "kw": [
            "food",
            "menu",
            "minutes",
            "wait",
            "restaurant"
        ],
        "candidate": [
            "J_KI8rJa_dSwTglUbwFcdw",
            "I1j1kEbQ5BliKsjzl5etVA",
            "Q0fcX_1wvdmffqEPa246rg",
            "xWuzWH8qYaa75REqVd9Isw"
        ],
        "explanation": {
            "J_KI8rJa_dSwTglUbwFcdw": "This restaurant offers a highly praised menu with diverse food options and typically has shorter wait times.",
            "I1j1kEbQ5BliKsjzl5etVA": "Known for its quality food, this restaurant has a good menu and reasonable wait times, making it a solid choice.",
            "Q0fcX_1wvdmffqEPa246rg": "While popular for its food, the longer wait times place it lower in this ranking compared to higher-rated options.",
            "xWuzWH8qYaa75REqVd9Isw": "Although it has its merits, its limited menu and longer waits contribute to its lower position in the preferences."
        }
    },
    "hihNuqYNKDwAwHeGNURE_g": {
        "kw": [
            "food",
            "spicy sauce",
            "meal",
            "more time",
            "queen"
        ],
        "candidate": [
            "DlnMwCDIxQ-o5kNMAfOs1g",
            "6MR9GZjWjLAS3s39YdDXKw",
            "Q0fcX_1wvdmffqEPa246rg",
            "ZOyBVpeSQ7sYDeZa_v0MFw",
            "lWRbdK9YABr0auLG19FHhQ."
        ],
        "explanation": {
            "DlnMwCDIxQ-o5kNMAfOs1g": "This restaurant is known for its excellent food quality and unique spicy sauces, making it a top choice for the user's preferences.",
            "6MR9GZjWjLAS3s39YdDXKw": "It offers a diverse menu and allows for a more leisurely meal, perfect for enjoying complex flavors.",
            "Q0fcX_1wvdmffqEPa246rg": "This restaurant serves flavorful dishes, but its selection of spicy sauces isn't as robust, placing it slightly lower.",
            "ZOyBVpeSQ7sYDeZa_v0MFw": "Although it has decent food, it lacks the spicy edge and cozy atmosphere that the user seeks.",
            "lWRbdK9YABr0auLG19FHhQ": "While the food is good, it doesn't align with the preferences for spicy sauce and is less suited for a regal dining experience."
        }
    },
    "fmpcYRlirLlHuH_R7U-mew": {
        "kw": [
            "food",
            "part",
            "dishes",
            "table",
            "chicken"
        ],
        "candidate": [
            "aHYIubjRbTLB3o_eXkrMXA",
            "Vtahv3Af90H3fUuEEhPhdQ",
            "LUhVj-r2TtmFx6cyF9ilJg",
            "pM4mWLjeaZJlcdUxut2lMg"
        ],
        "explanation": {
            "aHYIubjRbTLB3o_eXkrMXA": "This restaurant specializes in a variety of chicken dishes and has received high praise for its flavor and presentation.",
            "Vtahv3Af90H3fUuEEhPhdQ": "Known for its flavorful poultry plates, this eatery offers a comfortable dining atmosphere, making it a great choice for part of the user's dining experience.",
            "LUhVj-r2TtmFx6cyF9ilJg": "Though it provides decent food, it focuses less on chicken dishes compared to the top two, leading to a lower ranking based on specific preferences.",
            "pM4mWLjeaZJlcdUxut2lMg": "This restaurant offers a wide range of dishes but is noted for its less distinctive chicken options, resulting in the lowest placement."
        }
    },
    "B3DNjsZ3gRRsWYro4auztg": {
        "kw": [
            "food",
            "price",
            "restaurant",
            "part",
            "hotel"
        ],
        "candidate": [
            "Q0fcX_1wvdmffqEPa246rg",
            "z57omnqRcAODGwbwMHEIyw",
            "FMoKoSHgitwnt_iMWm31nQ",
            "563C7-HcjhZwZSl4fK-mfQ",
            "xOZ7bkrttSIGS4NZm49w5Q"
        ],
        "explanation": {
            "Q0fcX_1wvdmffqEPa246rg": "This restaurant offers excellent food quality at a reasonable price and is conveniently located near a hotel.",
            "z57omnqRcAODGwbwMHEIyw": "Known for its vibrant ambiance and good food, it also provides good value for money given its location near popular hotel areas.",
            "FMoKoSHgitwnt_iMWm31nQ": "While it has decent food, its price point is higher than preferred for the quality offered.",
            "563C7-HcjhZwZSl4fK-mfQ": "This spot offers good food but is not as highly rated in terms of price and accessibility related to hotel stays.",
            "xOZ7bkrttSIGS4NZm49w5Q": "Although it has some unique offerings, it is more expensive with limited options compared to the others in this ranking."
        }
    },
    "fuCGYSGs4gfeSJ9hc3xiug": {
        "kw": [
            "food",
            "quality",
            "restaurant",
            "size",
            "service"
        ],
        "candidate": [
            "R79Hir871EF-kRLIBPy9qg",
            "nbJXmGpdCxiBnovBkBtWcA",
            "Q0fcX_1wvdmffqEPa246rg",
            "hJNjKc4sKgWG__KitlJ1ag"
        ],
        "explanation": {
            "R79Hir871EF-kRLIBPy9qg": "This restaurant excels in food quality and offers excellent service, making it the top choice.",
            "nbJXmGpdCxiBnovBkBtWcA": "Known for its high-quality dishes and a comfortable size, it ranks just behind the top pick.",
            "Q0fcX_1wvdmffqEPa246rg": "While the food is good, the service can be a bit inconsistent, placing it lower.",
            "hJNjKc4sKgWG__KitlJ1ag": "Despite having decent food, the restaurant struggles with quality and service, which puts it at the bottom."
        }
    },
    "eFqg1qaOBHq_Od6fRlMcWA": {
        "kw": [
            "food",
            "while",
            "menu",
            "door",
            "minutes"
        ],
        "candidate": [
            "se9MhDAQjACYMO3LCIfT1Q",
            "8axxI33rUyswfRk_v3vS0A",
            "S1eha-aT5c7WMk7lDLsW0A",
            "563C7-HcjhZwZSl4fK-mfQ",
            "xjBvbDmbsA0VX-vA55SbAA"
        ],
        "explanation": {
            "se9MhDAQjACYMO3LCIfT1Q": "This restaurant offers a diverse menu with quick service, matching user preferences for food and time.",
            "8axxI33rUyswfRk_v3vS0A": "Known for its wide-ranging menu options and efficient service, making it a strong contender for the user.",
            "S1eha-aT5c7WMk7lDLsW0A": "This restaurant has a good variety of food options but may have slightly longer wait times than preferred.",
            "563C7-HcjhZwZSl4fK-mfQ": "While it has decent food options, it lacks the variety found in the top selections.",
            "xjBvbDmbsA0VX-vA55SbAA": "This restaurant offers limited menu choices and longer wait times, making it the least favorable."
        }
    },
    "KvFQ5iAir60bO-ZyaXwb-w": {
        "kw": [
            "food",
            "menu",
            "door",
            "minutes",
            "bit"
        ],
        "candidate": [
            "vy5dhJyQ_VC1NUpPMmRUlw",
            "se9MhDAQjACYMO3LCIfT1Q",
            "WUAe0FGaLRCremEDXqNV4A",
            "l_tk3iLmyKfBUCK-6nBbHg",
            "qmcIsZjLpxd0V4RekSozmA"
        ],
        "explanation": {
            "vy5dhJyQ_VC1NUpPMmRUlw": "This restaurant offers a diverse menu with highly rated dishes, aligning well with food quality preferences.",
            "se9MhDAQjACYMO3LCIfT1Q": "Known for its quick service and delightful offerings, this establishment provides a great balance of quality and convenience.",
            "WUAe0FGaLRCremEDXqNV4A": "A solid option with a reasonable menu variety and good food, though slightly less favored than the top two.",
            "l_tk3iLmyKfBUCK-6nBbHg": "Offers decent food but lacks in menu options compared to the higher-ranked choices, leading to a lower placement.",
            "qmcIsZjLpxd0V4RekSozmA": "Although it has good food, its limited menu variety makes it the least preferable option for the user's interests."
        }
    },
    "1-UXAFmZILDj_orrac7GPA": {
        "kw": [
            "food",
            "quality",
            "way",
            "edinburgh",
            "place"
        ],
        "candidate": [
            "563C7-HcjhZwZSl4fK-mfQ",
            "ZMcd7w-yDhFRLSwvJBV1VQ",
            "voaZjLwStQEq9-wj7hFYBQ",
            "mVZoin0a8uTZgLsgJ9iNDQ",
            "366NwqHwhOic5pBN1DjmDQ"
        ],
        "explanation": {
            "563C7-HcjhZwZSl4fK-mfQ": "Known for outstanding food quality and a strong reputation in Edinburgh.",
            "ZMcd7w-yDhFRLSwvJBV1VQ": "Offers excellent dishes, highly rated for its overall dining experience.",
            "voaZjLwStQEq9-wj7hFYBQ": "Good quality food with a great local atmosphere, making it a solid choice.",
            "mVZoin0a8uTZgLsgJ9iNDQ": "A popular spot with decent food, but less renowned than the top three.",
            "366NwqHwhOic5pBN1DjmDQ": "While it has its merits, it ranks lower in terms of food quality compared to others listed."
        }
    },
    "SG9gzOvhFXjTnmZD6IEV1w": {
        "kw": [
            "food",
            "meal",
            "restaurant",
            "way",
            "edinburgh"
        ],
        "candidate": [
            "563C7-HcjhZwZSl4fK-mfQ",
            "2HMvoTz_hw0noLzBWmyxcA",
            "mVZoin0a8uTZgLsgJ9iNDQ",
            "se9MhDAQjACYMO3LCIfT1Q",
            "nJdNzQ5Z278gTCFJ4HQBLA."
        ],
        "explanation": {
            "563C7-HcjhZwZSl4fK-mfQ": "Known for its innovative dishes and locally sourced ingredients, making it a top choice for food lovers in Edinburgh.",
            "2HMvoTz_hw0noLzBWmyxcA": "Offers a unique dining experience with a focus on quality and presentation, perfect for memorable meals.",
            "mVZoin0a8uTZgLsgJ9iNDQ": "A great place for casual dining with reliable food quality that appeals to a wide audience.",
            "se9MhDAQjACYMO3LCIfT1Q": "Features a cozy atmosphere and decent menu options, though not as highly rated for culinary innovation.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "This restaurant has good offerings but lacks the standout features the others possess in terms of food quality."
        }
    },
    "bcxcQhp0sKYd9eUnEVUzPA": {
        "kw": [
            "food",
            "while",
            "menu",
            "door",
            "bag"
        ],
        "candidate": [
            "V0tRCjf95FTqVJvmxdeqbQ",
            "5Iin0tl6QJT_TyL1BldtyA",
            "3hjLxqqEfnBhwL6ecave_g",
            "47Uu-2MceSRFmohdzCOvGQ",
            "xbCNlp2vWixy2W1WsfGv8g."
        ],
        "explanation": {
            "V0tRCjf95FTqVJvmxdeqbQ": "Known for its diverse menu and high-quality food, making it top-ranked for food enthusiasts.",
            "5Iin0tl6QJT_TyL1BldtyA": "Offers a solid variety of dishes that cater to different tastes while maintaining quality, securing the second spot.",
            "3hjLxqqEfnBhwL6ecave_g": "Provides good food but less menu variety compared to the first two, placing it third.",
            "47Uu-2MceSRFmohdzCOvGQ": "While decent, its menu is limited, making it less appealing for the user's preference for variety.",
            "xbCNlp2vWixy2W1WsfGv8g": "Although it has some strong points, overall value and presentation do not quite match the others in this ranking."
        }
    },
    "P8qK9bvWta-kDCT0NUyx4g": {
        "kw": [
            "food",
            "meal",
            "restaurant",
            "edinburgh",
            "lot"
        ],
        "candidate": [
            "Rx85NUdD6MhrgKxHr05NlQ",
            "S1eha-aT5c7WMk7lDLsW0A",
            "gqsU03i-WiyYHcBCdwObuQ",
            "2HMvoTz_hw0noLzBWmyxcA",
            "xOZ7bkrttSIGS4NZm49w5Q"
        ],
        "explanation": {
            "Rx85NUdD6MhrgKxHr05NlQ": "This restaurant is known for its exceptional food quality and innovative meal options, making it a top choice for the user.",
            "S1eha-aT5c7WMk7lDLsW0A": "Highly rated for its cozy ambiance and delicious cuisine, it offers a satisfying dining experience.",
            "gqsU03i-WiyYHcBCdwObuQ": "A favorite for its local dishes and fresh ingredients, appealing to those seeking authentic meals.",
            "2HMvoTz_hw0noLzBWmyxcA": "Recognized for its unique approach and vibrant menu, it is ideal for exploring Edinburgh's culinary scene.",
            "xOZ7bkrttSIGS4NZm49w5Q": "While still a noteworthy option, it offers a less unique meal experience compared to the others listed above."
        }
    },
    "ZpO7BzOM2vmZcUW_m8H2KA": {
        "kw": [
            "food",
            "friend",
            "meal",
            "restaurant",
            "flavor"
        ],
        "candidate": [
            "kYDkMGQEuQIeSOGZHHjIxA",
            "563C7-HcjhZwZSl4fK-mfQ",
            "g_fGPZJlGeKGLgC-j-tj6w",
            "MuVIpRAEkNfRnmhsPTdl3A"
        ],
        "explanation": {
            "kYDkMGQEuQIeSOGZHHjIxA": "This restaurant is known for its vibrant flavors and great ambiance, making it ideal for enjoying a meal with friends.",
            "563C7-HcjhZwZSl4fK-mfQ": "Offers a diverse menu with flavorful dishes that are perfect for sharing in a casual setting.",
            "g_fGPZJlGeKGLgC-j-tj6w": "While it has decent food, it lacks unique flavors and is slightly less inviting for a group meal.",
            "MuVIpRAEkNfRnmhsPTdl3A": "Although it serves good food, the focus on flavor and sharing with friends isn’t as strong as the others."
        }
    },
    "xXQTdJXPGOP-NUYctcQw8g": {
        "kw": [
            "food",
            "while",
            "menu",
            "door",
            "minutes"
        ],
        "candidate": [
            "S1eha-aT5c7WMk7lDLsW0A",
            "se9MhDAQjACYMO3LCIfT1Q",
            "K8D_ltZWGvdXUaSE7bBiDw",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "S1eha-aT5c7WMk7lDLsW0A": "Known for its exceptional food and diverse menu options, making it the top choice.",
            "se9MhDAQjACYMO3LCIfT1Q": "Offers a solid menu and satisfies food quality, although not as strong as the top pick.",
            "K8D_ltZWGvdXUaSE7bBiDw": "Good for quick service, but slightly lower in food quality compared to the top two.",
            "563C7-HcjhZwZSl4fK-mfQ": "While it's a decent option, it lacks in menu variety and overall experience compared to others."
        }
    },
    "CxIsFTy1uWhLJkJaxZQnLg": {
        "kw": [
            "food",
            "price",
            "quality",
            "taste",
            "voucher"
        ],
        "candidate": [
            "BmrVL3Aj5usPfpu5DE1iCg",
            "KL1oif2ocGH2dJ4w-oT_Mg",
            "8PmbCVEjWGPouD1Tst6FsQ",
            "XahLCgicRsLPb0TSMAIQtw",
            "8axxI33rUyswfRk_v3vS0A"
        ],
        "explanation": {
            "BmrVL3Aj5usPfpu5DE1iCg": "Rated highly for exceptional food quality and taste, making it a top choice for discerning diners.",
            "KL1oif2ocGH2dJ4w-oT_Mg": "Offers a great balance of price and quality, appealing to value-conscious customers while maintaining good taste.",
            "8PmbCVEjWGPouD1Tst6FsQ": "Known for decent taste but not as strong in quality compared to the top options, slightly impacting its ranking.",
            "XahLCgicRsLPb0TSMAIQtw": "While it has a decent reputation, its cuisine does not stand out as significantly in terms of taste or quality relative to others.",
            "8axxI33rUyswfRk_v3vS0A": "Generally more expensive and lacking strong taste, leading to a lower ranking despite potential voucher options."
        }
    },
    "SXTh-cBuiwUAaaI4hw-bcA": {
        "kw": [
            "food",
            "menu",
            "bit",
            "chance",
            "restaurant"
        ],
        "candidate": [
            "AUiX65HxQqwk1yvsBcbTdQ",
            "_jNe_vwxiEh0G9JRZByc0w",
            "KWPhAfod__yKvjH-LG4bjg",
            "_TqUO2XaxLQ9i_z3RM8puQ",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "AUiX65HxQqwk1yvsBcbTdQ": "This restaurant has an extensive menu featuring a variety of unique and innovative dishes, making it a top choice for food enthusiasts.",
            "_jNe_vwxiEh0G9JRZByc0w": "Positioned second for its strong focus on creative cuisine and seasonal offerings that offer something new each visit.",
            "KWPhAfod__yKvjH-LG4bjg": "While it has a solid menu, the offerings are more conventional compared to the top two, hence it ranks lower.",
            "_TqUO2XaxLQ9i_z3RM8puQ": "This restaurant is known for a decent menu but lacks the variety that the user seems to prioritize.",
            "563C7-HcjhZwZSl4fK-mfQ": "It is rated lowest due to a limited menu that might not match the user’s preference for diverse food choices."
        }
    },
    "yb8_BHHcO6DBLDYX0LEKnw": {
        "kw": [
            "food",
            "taste",
            "edinburgh",
            "place",
            "service"
        ],
        "candidate": [
            "se9MhDAQjACYMO3LCIfT1Q",
            "BmrVL3Aj5usPfpu5DE1iCg",
            "KMlY-L1oAL3qMQnwQCJPhQ",
            "IYdv6RxSiqz2XMsqkiTmPQ"
        ],
        "explanation": {
            "se9MhDAQjACYMO3LCIfT1Q": "This restaurant offers a delicious menu and is highly rated for both food quality and service.",
            "BmrVL3Aj5usPfpu5DE1iCg": "Known for its excellent taste and local ingredients, it ranks next due to its favorable reviews on service.",
            "KMlY-L1oAL3qMQnwQCJPhQ": "While still good, it doesn't stand out as much for taste and service compared to the top two.",
            "IYdv6RxSiqz2XMsqkiTmPQ": "Although it has a solid reputation, it falls short in ranking due to lower ratings in food quality and service compared to the others."
        }
    },
    "NIwD0clhd0rAgCOOUeLoFQ": {
        "kw": [
            "food",
            "menu",
            "prawn crackers",
            "minutes",
            "meal"
        ],
        "candidate": [
            "8PmbCVEjWGPouD1Tst6FsQ",
            "LUhVj-r2TtmFx6cyF9ilJg",
            "adI5BlJCtvWq2uAwmyndXA",
            "V8vKFvdrvhTrQrt-rxKrPA"
        ],
        "explanation": {
            "8PmbCVEjWGPouD1Tst6FsQ": "This restaurant offers a diverse menu with prawn crackers as a staple appetizer, aligning well with food preferences.",
            "LUhVj-r2TtmFx6cyF9ilJg": "Known for its quick service and popular dishes that include prawn crackers, it meets the user’s requirement for a timely meal.",
            "adI5BlJCtvWq2uAwmyndXA": "While it has a decent menu, it lacks the same range of prawn cracker options, placing it lower on the list.",
            "V8vKFvdrvhTrQrt-rxKrPA": "This restaurant has a limited menu with no notable prawn crackers and longer wait times, making it the least favorable choice."
        }
    },
    "NwVyki35xOcaxhMzHNtHDQ": {
        "kw": [
            "food",
            "menu",
            "door",
            "minutes",
            "beef"
        ],
        "candidate": [
            "563C7-HcjhZwZSl4fK-mfQ",
            "WUAe0FGaLRCremEDXqNV4A",
            "vL44Ky9VxUtOgteyHasRIA",
            "xWuzWH8qYaa75REqVd9Isw",
            "se9MhDAQjACYMO3LCIfT1Q"
        ],
        "explanation": {
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant has a diverse beef menu and quick service, making it the top recommendation.",
            "WUAe0FGaLRCremEDXqNV4A": "Known for its quality beef dishes and excellent menu, it ranks closely behind but may take slightly longer.",
            "vL44Ky9VxUtOgteyHasRIA": "Offers solid beef options, with a decent menu variety and good location accessibility.",
            "xWuzWH8qYaa75REqVd9Isw": "Provides a fair selection of beef dishes but lacks some of the menu variety others offer, placing it lower.",
            "se9MhDAQjACYMO3LCIfT1Q": "It has less focus on beef, leading to it being ranked lowest based on user preferences."
        }
    },
    "SlSpryqL91enzQTEnIQ4yQ": {
        "kw": [
            "food",
            "menu",
            "bag",
            "minutes",
            "bit"
        ],
        "candidate": [
            "Vtahv3Af90H3fUuEEhPhdQ",
            "Q0fcX_1wvdmffqEPa246rg",
            "V0tRCjf95FTqVJvmxdeqbQ",
            "8axxI33rUyswfRk_v3vS0A"
        ],
        "explanation": {
            "Vtahv3Af90H3fUuEEhPhdQ": "This restaurant offers a diverse menu with highly-rated food, making it the top choice for the user.",
            "Q0fcX_1wvdmffqEPa246rg": "Known for its unique dishes and quality ingredients, this place ranks second for its exciting menu offerings.",
            "V0tRCjf95FTqVJvmxdeqbQ": "While still having good food, it has a more limited menu compared to the top two, placing it third.",
            "8axxI33rUyswfRk_v3vS0A": "Despite being decent, it ranks last due to less variety and lower food ratings in comparison to the others."
        }
    },
    "5Mujjzv-ZH6HhxT-hWCpVg": {
        "kw": [
            "food",
            "while",
            "menu",
            "door",
            "bag"
        ],
        "candidate": [
            "Sqwa2aNwnqCmc95gVWQ9bA",
            "V0tRCjf95FTqVJvmxdeqbQ",
            "47Uu-2MceSRFmohdzCOvGQ",
            "S1eha-aT5c7WMk7lDLsW0A"
        ],
        "explanation": {
            "Sqwa2aNwnqCmc95gVWQ9bA": "Known for its exceptional food quality and a diverse menu.",
            "V0tRCjf95FTqVJvmxdeqbQ": "Offers a good selection of items and is praised for its taste.",
            "47Uu-2MceSRFmohdzCOvGQ": "A solid choice with decent food, though not as diverse as the top two.",
            "S1eha-aT5c7WMk7lDLsW0A": "While it has satisfactory food, it lacks the menu variety that the user prefers."
        }
    },
    "3XDGNCH155seEXyEQPMi_w": {
        "kw": [
            "food",
            "menu",
            "door",
            "beef",
            "friend"
        ],
        "candidate": [
            "J_KI8rJa_dSwTglUbwFcdw",
            "N8hUGYmf0jEO9eDzmYHuAw",
            "6MR9GZjWjLAS3s39YdDXKw",
            "vL44Ky9VxUtOgteyHasRIA",
            "XahLCgicRsLPb0TSMAIQtw"
        ],
        "explanation": {
            "J_KI8rJa_dSwTglUbwFcdw": "Highly regarded for its excellent beef dishes and diverse menu options, making it a top choice for food enthusiasts.",
            "N8hUGYmf0jEO9eDzmYHuAw": "Offers a solid menu with beef varieties and a welcoming atmosphere for friends to enjoy a meal together.",
            "6MR9GZjWjLAS3s39YdDXKw": "Known for tasty food but with a more limited focus on beef, yet still offers a good experience.",
            "vL44Ky9VxUtOgteyHasRIA": "Provides decent food options, but less emphasis on beef compared to others on the list.",
            "XahLCgicRsLPb0TSMAIQtw": "While it has some great meal choices, it’s less aligned with the user's specific preferences regarding beef and menu variety."
        }
    },
    "rVEQ7nG4Bo7utMcqURxaIQ": {
        "kw": [
            "food",
            "menu",
            "door",
            "fried rice",
            "minutes"
        ],
        "candidate": [
            "Q0fcX_1wvdmffqEPa246rg",
            "9RKjjuTQYkYpGmCtfVsTZQ",
            "sH-11zOhWubXobEeuMo2gg",
            "vL44Ky9VxUtOgteyHasRIA",
            "_TqUO2XaxLQ9i_z3RM8puQ"
        ],
        "explanation": {
            "Q0fcX_1wvdmffqEPa246rg": "Known for its excellent fried rice dishes and varied menu, making it a top choice for the user.",
            "9RKjjuTQYkYpGmCtfVsTZQ": "Offers a good selection of entrees and has a reputation for quick service.",
            "sH-11zOhWubXobEeuMo2gg": "Provides a decent menu but lacks in variety compared to the top two; still has notable dishes.",
            "vL44Ky9VxUtOgteyHasRIA": "While the food is good, it is not particularly known for fried rice, which lowers its rank.",
            "_TqUO2XaxLQ9i_z3RM8puQ": "Overall menu options are limited, and it does not excel in any specific area as per the user’s preferences."
        }
    },
    "chG_7z0aA-TMs53pzYZFdg": {
        "kw": [
            "food",
            "decor",
            "lot",
            "chicken",
            "service"
        ],
        "candidate": [
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "Q0fcX_1wvdmffqEPa246rg",
            "QMySP-qHdwQNZY0gDba0ng",
            "hJNjKc4sKgWG__KitlJ1ag",
            "Rx85NUdD6MhrgKxHr05NlQ"
        ],
        "explanation": {
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Known for excellent chicken dishes and a vibrant atmosphere, making it a top choice for food and decor.",
            "Q0fcX_1wvdmffqEPa246rg": "Offers both great food and spacious seating, which aligns well with user preferences for decor and lot size.",
            "QMySP-qHdwQNZY0gDba0ng": "Provides good service and popular chicken options, with decent decor that appeals to the user.",
            "hJNjKc4sKgWG__KitlJ1ag": "While the food is satisfactory, the ambiance is less appealing compared to the top choices.",
            "Rx85NUdD6MhrgKxHr05NlQ": "Although it has good food, it does not stand out in terms of service or decor compared to the others."
        }
    },
    "aAVaN6Zw6-cRm5nftmOVJQ": {
        "kw": [
            "food",
            "while",
            "menu",
            "quality",
            "rice"
        ],
        "candidate": [
            "hJNjKc4sKgWG__KitlJ1ag",
            "adI5BlJCtvWq2uAwmyndXA",
            "FMoKoSHgitwnt_iMWm31nQ",
            "2vOHS-_p5ylEf0BGR1dO9w",
            "gtx0OZnN98YXAASyMzv3hw"
        ],
        "explanation": {
            "hJNjKc4sKgWG__KitlJ1ag": "Offers a diverse menu with high-quality rice dishes that appeal to the user's taste.",
            "adI5BlJCtvWq2uAwmyndXA": "Known for its flavorful and well-prepared rice options, making it a strong contender for quality dining.",
            "FMoKoSHgitwnt_iMWm31nQ": "Includes rice-based items but has a more limited menu variety compared to the top two.",
            "2vOHS-_p5ylEf0BGR1dO9w": "Provides decent rice dishes but lacks in overall menu innovation and quality.",
            "gtx0OZnN98YXAASyMzv3hw": "While it serves rice, it does not stand out in terms of food quality and menu selection compared to others."
        }
    },
    "rDacT7_YW2-geunGcmgeEw": {
        "kw": [
            "food",
            "while",
            "door",
            "bit",
            "meal"
        ],
        "candidate": [
            "S1eha-aT5c7WMk7lDLsW0A",
            "9RKjjuTQYkYpGmCtfVsTZQ",
            "xbCNlp2vWixy2W1WsfGv8g",
            "FMoKoSHgitwnt_iMWm31nQ",
            "aIs7Tt3pw6ymj3FOPPR4Ng"
        ],
        "explanation": {
            "S1eha-aT5c7WMk7lDLsW0A": "This restaurant has consistently high reviews for its flavorful dishes and reasonable wait times.",
            "9RKjjuTQYkYpGmCtfVsTZQ": "Known for its quick service and delicious food, making it a perfect option for a satisfying meal on the go.",
            "xbCNlp2vWixy2W1WsfGv8g": "Offers a diverse menu that caters to varying tastes while still providing efficient service.",
            "FMoKoSHgitwnt_iMWm31nQ": "While the food is good, it may take a bit longer to prepare, which is less ideal for the user's preferences.",
            "aIs7Tt3pw6ymj3FOPPR4Ng": "While it has some great dishes, it doesn't stand out as much in terms of meal efficiency compared to the others."
        }
    },
    "TrSM8ON_YdVASOJmMbwnGA": {
        "kw": [
            "food",
            "fried rice",
            "minutes",
            "meal",
            "way"
        ],
        "candidate": [
            "gqsU03i-WiyYHcBCdwObuQ",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "se9MhDAQjACYMO3LCIfT1Q",
            "563C7-HcjhZwZSl4fK-mfQ."
        ],
        "explanation": {
            "gqsU03i-WiyYHcBCdwObuQ": "This restaurant specializes in traditional fried rice dishes, making it the top choice based on the user's preference.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Known for quick service, it offers a variety of fried rice options suitable for a quick meal.",
            "se9MhDAQjACYMO3LCIfT1Q": "Offers fried rice but with a slower service, making it less ideal for time-sensitive dining preferences.",
            "563C7-HcjhZwZSl4fK-mfQ": "While it serves fried rice, it is primarily focused on other cuisines, making it the least relevant choice for the user."
        }
    },
    "asf3NiIfdlbiCUUwCO4iWg": {
        "kw": [
            "food",
            "good quality",
            "quality",
            "decor",
            "part"
        ],
        "candidate": [
            "qesu3mk5yHeak9CUO4gRdQ",
            "csbBCysrsifg8N10c0eHCA",
            "cgEzHZQKhi2anXfyF75MQw",
            "xbCNlp2vWixy2W1WsfGv8g"
        ],
        "explanation": {
            "qesu3mk5yHeak9CUO4gRdQ": "Known for high-quality food and exceptional decor, making it a favorite for aesthetic and culinary enthusiasts.",
            "csbBCysrsifg8N10c0eHCA": "Offers good quality food with a pleasant atmosphere, appealing to those prioritizing decor and overall experience.",
            "cgEzHZQKhi2anXfyF75MQw": "While having decent food quality, the decor is less impressive, placing it lower on the list.",
            "xbCNlp2vWixy2W1WsfGv8g": "Although it has its strengths, the food and decor do not align closely enough with the user's top preferences to remain higher in the ranking."
        }
    },
    "mJJj_SZff6MEWG5Vx1r8Bg": {
        "kw": [
            "food",
            "menu",
            "door",
            "bag",
            "minutes"
        ],
        "candidate": [
            "8PmbCVEjWGPouD1Tst6FsQ",
            "hz0ldhBHu5M4ri9M_mkOdQ",
            "Kcg5iMwYq5ibBuEhDXKx3Q",
            "qs9nL2T2guSLEudFHg71mw",
            "xjBvbDmbsA0VX-vA55SbAA"
        ],
        "explanation": {
            "8PmbCVEjWGPouD1Tst6FsQ": "Known for its high-quality food and diverse menu options, which align well with user preferences.",
            "hz0ldhBHu5M4ri9M_mkOdQ": "Offers great food and fast service, making it convenient for quick orders.",
            "Kcg5iMwYq5ibBuEhDXKx3Q": "While it has decent food, its menu is more limited compared to the top two options.",
            "qs9nL2T2guSLEudFHg71mw": "Good food but slower service, which affects the overall enjoyment based on the preferences.",
            "xjBvbDmbsA0VX-vA55SbAA": "Ranked last due to average food quality and longer wait times, making it less appealing."
        }
    },
    "DR6kA7EWIiGIEMuXASJL2w": {
        "kw": [
            "food",
            "restaurant",
            "cocktails",
            "place",
            "day"
        ],
        "candidate": [
            "EKEPtNKJdZxRhYoFhuG8ew",
            "6MR9GZjWjLAS3s39YdDXKw",
            "Rx85NUdD6MhrgKxHr05NlQ",
            "366NwqHwhOic5pBN1DjmDQ",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "EKEPtNKJdZxRhYoFhuG8ew": "This restaurant is highly rated for its food and mixology, making it a perfect match for culinary enthusiasts looking for cocktails.",
            "6MR9GZjWjLAS3s39YdDXKw": "Known for a diverse menu and impressive cocktail selection, it's an excellent choice for a quality dining experience.",
            "Rx85NUdD6MhrgKxHr05NlQ": "While still a good restaurant, it offers a less diverse cocktail menu compared to the top two options.",
            "366NwqHwhOic5pBN1DjmDQ": "This place offers decent food but lacks in cocktail variety, placing it lower in ranking.",
            "563C7-HcjhZwZSl4fK-mfQ": "Although it has a loyal following, it doesn't quite match the culinary standards or cocktail creativity of the others listed above."
        }
    },
    "xan14G_7IU66GtQPAA2cKw": {
        "kw": [
            "food",
            "while",
            "menu",
            "minutes",
            "fiver"
        ],
        "candidate": [
            "qeFGUu1WPvMMNn5Hno6D-Q",
            "S1eha-aT5c7WMk7lDLsW0A",
            "36jGZp7V0jLnPCYmRipUCg",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "qeFGUu1WPvMMNn5Hno6D-Q": "This restaurant is known for its extensive menu, providing various options to satisfy different tastes quickly.",
            "S1eha-aT5c7WMk7lDLsW0A": "This option offers a decent variety but is slightly longer in wait time compared to the top rank.",
            "36jGZp7V0jLnPCYmRipUCg": "It has good food, but the menu is more limited and might not cater to all preferences as effectively.",
            "563C7-HcjhZwZSl4fK-mfQ": "While this restaurant offers quality food, it has the least variety and longer wait times, hence the lower ranking."
        }
    },
    "e-jVwvMAiHTUYIRSmJKFAA": {
        "kw": [
            "food",
            "quality",
            "restaurant",
            "edinburgh",
            "place"
        ],
        "candidate": [
            "S1eha-aT5c7WMk7lDLsW0A",
            "cgEzHZQKhi2anXfyF75MQw",
            "BmrVL3Aj5usPfpu5DE1iCg",
            "366NwqHwhOic5pBN1DjmDQ",
            "0SBDr7GJAFzKECE7IIWfJA"
        ],
        "explanation": {
            "S1eha-aT5c7WMk7lDLsW0A": "Known for high-quality food and excellent service, making it a top choice for dining in Edinburgh.",
            "cgEzHZQKhi2anXfyF75MQw": "Offers a unique menu with a focus on local ingredients, enhancing the dining experience significantly.",
            "BmrVL3Aj5usPfpu5DE1iCg": "A solid performer with consistent quality, it remains a reliable option for good food.",
            "366NwqHwhOic5pBN1DjmDQ": "While decent, it lacks the standout food quality of the top choices.",
            "0SBDr7GJAFzKECE7IIWfJA": "Although okay, it falls behind in terms of food quality and unique dining experience in comparison to the others."
        }
    },
    "QFQGMnOEoqii9ttB9t-RXg": {
        "kw": [
            "food",
            "menu",
            "door",
            "minutes",
            "wait"
        ],
        "candidate": [
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "sH-11zOhWubXobEeuMo2gg",
            "xbCNlp2vWixy2W1WsfGv8g",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "nJdNzQ5Z278gTCFJ4HQBLA": "Offers a diverse menu and typically has shorter wait times.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Known for good food quality and reasonable service speed.",
            "sH-11zOhWubXobEeuMo2gg": "Popular for its food but has a slightly longer wait.",
            "xbCNlp2vWixy2W1WsfGv8g": "Offers a limited menu compared to higher-ranked options.",
            "563C7-HcjhZwZSl4fK-mfQ": "Has longer wait times and a less appealing menu variety."
        }
    },
    "brpOnxaRsg56LK7OverL0A": {
        "kw": [
            "food",
            "door",
            "fried rice",
            "prawn crackers",
            "bit"
        ],
        "candidate": [
            "FMoKoSHgitwnt_iMWm31nQ",
            "adI5BlJCtvWq2uAwmyndXA",
            "gJliACNKY4rK30BTMIzwsQ",
            "3hjLxqqEfnBhwL6ecave_g",
            "aIs7Tt3pw6ymj3FOPPR4Ng"
        ],
        "explanation": {
            "FMoKoSHgitwnt_iMWm31nQ": "Best known for its delicious fried rice and great service, directly aligning with the user's food preferences.",
            "adI5BlJCtvWq2uAwmyndXA": "Offers a variety of dishes including prawn crackers, complementing the user's liking for those snacks.",
            "gJliACNKY4rK30BTMIzwsQ": "Provides good quality food but lacks specific fried rice options, placing it lower in the ranking.",
            "3hjLxqqEfnBhwL6ecave_g": "Although it has decent options, it is less focused on the user's specified preferences.",
            "aIs7Tt3pw6ymj3FOPPR4Ng": "Least aligned with the user's food desires, as it does not prominently feature fried rice or prawn crackers."
        }
    },
    "xJKnmUxpJfzPovCTsT1kLg": {
        "kw": [
            "food",
            "menu",
            "friend",
            "price",
            "dishes"
        ],
        "candidate": [
            "csbBCysrsifg8N10c0eHCA",
            "se9MhDAQjACYMO3LCIfT1Q",
            "lWRbdK9YABr0auLG19FHhQ",
            "5Iin0tl6QJT_TyL1BldtyA",
            "Q0fcX_1wvdmffqEPa246rg"
        ],
        "explanation": {
            "csbBCysrsifg8N10c0eHCA": "It offers a diverse menu with high-quality dishes at reasonable prices, making it a great choice for food lovers.",
            "se9MhDAQjACYMO3LCIfT1Q": "Known for its friendly service and a menu that caters to various tastes, it stands out for social dining.",
            "lWRbdK9YABr0auLG19FHhQ": "While good, its menu may not be as varied or affordable as the top choices.",
            "5Iin0tl6QJT_TyL1BldtyA": "Offers decent food at a mid-range price but lacks the distinct dishes that elevate the experience.",
            "Q0fcX_1wvdmffqEPa246rg": "Although it has loyal customers, it falls short in menu options and price compared to the other restaurants."
        }
    },
    "dLOfp-2TAGAb78jGZPvMoA": {
        "kw": [
            "food",
            "fiver",
            "decor",
            "restaurant",
            "soup"
        ],
        "candidate": [
            "zc_ptb03jQiXnWGwmpAk0A",
            "B9gUwTS1_Yzj2vajjC7Vmg",
            "qeFGUu1WPvMMNn5Hno6D-Q",
            "V8vKFvdrvhTrQrt-rxKrPA",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "zc_ptb03jQiXnWGwmpAk0A": "This restaurant offers excellent food quality and a great selection of soups, which aligns perfectly with the user's preferences.",
            "B9gUwTS1_Yzj2vajjC7Vmg": "It provides good value for money (fiver), along with appealing decor, making it a solid choice.",
            "qeFGUu1WPvMMNn5Hno6D-Q": "This place is well-known for its food, but the decor might be less impressive than the top two.",
            "V8vKFvdrvhTrQrt-rxKrPA": "While it offers decent food, it falls short in both soup selection and decor compared to the higher-ranked options.",
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant is ranked lowest due to mediocre food quality and fewer offerings in terms of soups and decor."
        }
    },
    "Q-G5vPCbC9708m9Mw3fZVA": {
        "kw": [
            "food",
            "decor",
            "tea",
            "place",
            "table"
        ],
        "candidate": [
            "V8vKFvdrvhTrQrt-rxKrPA",
            "Q0fcX_1wvdmffqEPa246rg",
            "s7TMkWF36dwwD8R3TKsJqw",
            "AUiX65HxQqwk1yvsBcbTdQ",
            "PcR-9sTQRK_UN7qO9rzDNw"
        ],
        "explanation": {
            "V8vKFvdrvhTrQrt-rxKrPA": "Known for its exceptional food quality and beautiful decor that enhances the dining environment.",
            "Q0fcX_1wvdmffqEPa246rg": "Offers a great selection of teas and a cozy atmosphere, making it a favorite for tea lovers.",
            "s7TMkWF36dwwD8R3TKsJqw": "Provides a pleasant setting and reasonably good food, suitable for casual dining.",
            "AUiX65HxQqwk1yvsBcbTdQ": "Although decent, it falls short in both decor appeal and food inspiration compared to higher-ranked choices.",
            "PcR-9sTQRK_UN7qO9rzDNw": "While it has some strong points, it lacks the overall atmosphere and quality food offerings preferred by the user."
        }
    },
    "PuzhvFmuIvrCgJ_GRqyJPg": {
        "kw": [
            "food",
            "restaurant",
            "place",
            "lot",
            "chicken"
        ],
        "candidate": [
            "AEVNOYRr8ZsG1bj3NuEKgA",
            "xbCNlp2vWixy2W1WsfGv8g",
            "FMoKoSHgitwnt_iMWm31nQ",
            "gqsU03i-WiyYHcBCdwObuQ",
            "36jGZp7V0jLnPCYmRipUCg"
        ],
        "explanation": {
            "AEVNOYRr8ZsG1bj3NuEKgA": "Known for its excellent chicken dishes and spacious dining area.",
            "xbCNlp2vWixy2W1WsfGv8g": "Offers a variety of chicken options and has a good amount of space for diners.",
            "FMoKoSHgitwnt_iMWm31nQ": "Features a decent selection of chicken but less space compared to top picks.",
            "gqsU03i-WiyYHcBCdwObuQ": "While it has a solid menu, chicken options are not the highlight.",
            "36jGZp7V0jLnPCYmRipUCg": "Offers limited chicken dishes and is the least preferred in terms of space and options."
        }
    },
    "uaP7yULocq3L_XXClUu67Q": {
        "kw": [
            "food",
            "chance",
            "table",
            "regulars",
            "town"
        ],
        "candidate": [
            "z57omnqRcAODGwbwMHEIyw",
            "gtx0OZnN98YXAASyMzv3hw",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "se9MhDAQjACYMO3LCIfT1Q",
            "cgEzHZQKhi2anXfyF75MQw"
        ],
        "explanation": {
            "z57omnqRcAODGwbwMHEIyw": "This restaurant is known for its excellent food and has a loyal customer base, making it a great spot for regulars.",
            "gtx0OZnN98YXAASyMzv3hw": "Offers a unique dining experience with quality dishes and a community feel that resonates with local regulars.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Good reputation for consistency in food, attracting a steady stream of repeat customers, fitting the regulars aspect.",
            "se9MhDAQjACYMO3LCIfT1Q": "While still a solid choice, it has slightly less emphasis on community ties and regular clientele.",
            "cgEzHZQKhi2anXfyF75MQw": "Although it offers decent food, it lacks the local flavor and regular patronage that the user seems to prefer."
        }
    },
    "FmbduNxDfGN7TiHrY2UewA": {
        "kw": [
            "food",
            "menu",
            "door",
            "fiver",
            "bit"
        ],
        "candidate": [
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "nbJXmGpdCxiBnovBkBtWcA",
            "GS06uO84yKQpa7oezgVZgQ",
            "N8hUGYmf0jEO9eDzmYHuAw",
            "sH-11zOhWubXobEeuMo2gg"
        ],
        "explanation": {
            "nJdNzQ5Z278gTCFJ4HQBLA": "Known for its diverse menu options that cater to various tastes, making it ideal for food-oriented preferences.",
            "nbJXmGpdCxiBnovBkBtWcA": "Offers a solid range of dishes and is praised for quality, fitting the user's emphasis on food excellence.",
            "GS06uO84yKQpa7oezgVZgQ": "While good, it lacks the variety of options that the top two provide but still maintains quality.",
            "N8hUGYmf0jEO9eDzmYHuAw": "Has a decent menu, though it may not be as exciting or accessible as the top choices.",
            "sH-11zOhWubXobEeuMo2gg": "Rounds out the ranking with a limited menu and fewer standout dishes, hence the lower position."
        }
    },
    "0-wo7wKN_Rp0Xs6cBMEDJQ": {
        "kw": [
            "food",
            "price",
            "quality",
            "shop",
            "flavours"
        ],
        "candidate": [
            "FMoKoSHgitwnt_iMWm31nQ",
            "IWNPEvd3o6GHi60MxnPCVQ",
            "6MR9GZjWjLAS3s39YdDXKw",
            "E7s0QreUJ2H9r0Ls1yDeiQ"
        ],
        "explanation": {
            "FMoKoSHgitwnt_iMWm31nQ": "This restaurant provides a great balance of quality and value, with diverse flavors that appeal to the user’s taste.",
            "IWNPEvd3o6GHi60MxnPCVQ": "Known for its high-quality ingredients and reasonable prices, this option ranks well due to its consistent quality and flavor variety.",
            "6MR9GZjWjLAS3s39YdDXKw": "While it has good food, it may be slightly pricier than preferred, thus placing it lower in the ranking.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "This restaurant, although well-rated, does not prioritize the preferred attributes as strongly as the others, hence its last position."
        }
    },
    "fL35Nuk-Nde5BJfOD0W_EQ": {
        "kw": [
            "food",
            "service",
            "dinner",
            "atmosphere",
            "lots"
        ],
        "candidate": [
            "xbCNlp2vWixy2W1WsfGv8g",
            "rvOvog5Utw3VXBwiSCAl0A",
            "8axxI33rUyswfRk_v3vS0A",
            "z57omnqRcAODGwbwMHEIyw",
            "2vOHS-_p5ylEf0BGR1dO9w"
        ],
        "explanation": {
            "xbCNlp2vWixy2W1WsfGv8g": "This restaurant excels in food quality and has a vibrant atmosphere, making it ideal for dinner.",
            "rvOvog5Utw3VXBwiSCAl0A": "Known for its attentive service and delightful dishes, it’s a great option for a relaxed dining experience.",
            "8axxI33rUyswfRk_v3vS0A": "Offers a good variety of delicious dinner options and maintains a cozy ambiance.",
            "z57omnqRcAODGwbwMHEIyw": "While it has good food, the service can be inconsistent, and the atmosphere isn’t as vibrant as the top choices.",
            "2vOHS-_p5ylEf0BGR1dO9w": "Though it has decent offerings, it falls short in the atmosphere and service the user values for an enjoyable dinner experience."
        }
    },
    "E7UTVunQLtiTnGYBlUQFDg": {
        "kw": [
            "food",
            "meal",
            "price",
            "shop",
            "way"
        ],
        "candidate": [
            "xbCNlp2vWixy2W1WsfGv8g",
            "Djazk_urUgj9C6PTwg-2AA",
            "6MR9GZjWjLAS3s39YdDXKw",
            "APN05ziH92oIox8EMxcceg"
        ],
        "explanation": {
            "xbCNlp2vWixy2W1WsfGv8g": "This restaurant is known for its diverse menu and reasonable prices, making it a great fit for various meal preferences.",
            "Djazk_urUgj9C6PTwg-2AA": "Offers a good balance of meal quality and price, appealing to those looking for value.",
            "6MR9GZjWjLAS3s39YdDXKw": "Though it's a popular choice, its options may not meet all food preferences across the board, placing it lower.",
            "APN05ziH92oIox8EMxcceg": "While it has some unique offerings, its higher pricing and limited meal choices may not align with user preferences."
        }
    },
    "DdaPc_xbu6or0qcTPVd1bQ": {
        "kw": [
            "food",
            "minutes",
            "meal",
            "quality",
            "rice"
        ],
        "candidate": [
            "YHlpp0gYBcxL_YXZepT69g",
            "LUhVj-r2TtmFx6cyF9ilJg",
            "2HMvoTz_hw0noLzBWmyxcA",
            "aJvi4k0ndFlGBzSZzcbnTw",
            "nJdNzQ5Z278gTCFJ4HQBLA."
        ],
        "explanation": {
            "YHlpp0gYBcxL_YXZepT69g": "Known for its excellent rice dishes and high-quality ingredients, making it a top choice for food lovers.",
            "LUhVj-r2TtmFx6cyF9ilJg": "Offers diverse menu options with an emphasis on meal quality, satisfying both taste and nutritional needs.",
            "2HMvoTz_hw0noLzBWmyxcA": "Provides good quality meals but with slightly fewer rice options compared to the top two.",
            "aJvi4k0ndFlGBzSZzcbnTw": "Although it has decent food quality, it lacks a strong focus on rice, thus placing it lower.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Ranks last due to lesser food quality and fewer rice dishes, not aligning well with user preferences."
        }
    },
    "RmXIjppHNtVveguN10iO1g": {
        "kw": [
            "food",
            "menu",
            "door",
            "minutes",
            "friend"
        ],
        "candidate": [
            "FMoKoSHgitwnt_iMWm31nQ",
            "yYh6t6a_0LGLVS_MNYEHsQ",
            "563C7-HcjhZwZSl4fK-mfQ",
            "l_tk3iLmyKfBUCK-6nBbHg"
        ],
        "explanation": {
            "FMoKoSHgitwnt_iMWm31nQ": "This restaurant has a diverse menu appealing to various tastes, ideal for sharing with friends.",
            "yYh6t6a_0LGLVS_MNYEHsQ": "Known for quick service, ensuring that you won't wait long for your meal while still enjoying a satisfying menu.",
            "563C7-HcjhZwZSl4fK-mfQ": "Offers a limited but high-quality menu, which may fit the food preference but lacks variety.",
            "l_tk3iLmyKfBUCK-6nBbHg": "Although this restaurant has a decent menu, it is further away, making it less convenient for a quick visit with friends."
        }
    },
    "-0WUJsVpizkaAYQp05giUA": {
        "kw": [
            "food",
            "edinburgh",
            "place",
            "service",
            "life"
        ],
        "candidate": [
            "EiYE3T3hfqcpcficZ4zJzQ",
            "adI5BlJCtvWq2uAwmyndXA",
            "xjBvbDmbsA0VX-vA55SbAA",
            "fNtFIQM_FKsHsyEIVk_KMQ",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "EiYE3T3hfqcpcficZ4zJzQ": "Known for its exceptional food quality and attentive service, making it a top choice for diners.",
            "adI5BlJCtvWq2uAwmyndXA": "Offers a vibrant atmosphere and great local cuisine, contributing to a lively dining experience.",
            "xjBvbDmbsA0VX-vA55SbAA": "A solid option with good food, but slightly less focus on service compared to the top two.",
            "fNtFIQM_FKsHsyEIVk_KMQ": "While the food is decent, it lacks the standout service and atmosphere that the higher-ranked options provide.",
            "563C7-HcjhZwZSl4fK-mfQ": "Rounds out the list as it has acceptable food but does not particularly excel in any of the user's preferred categories."
        }
    },
    "tXIN2tMOAiZH-lGwEaHOkg": {
        "kw": [
            "food",
            "menu",
            "door",
            "minutes",
            "good quality"
        ],
        "candidate": [
            "hf_TA4bRRnzLQh2XUbqX6w",
            "3hjLxqqEfnBhwL6ecave_g",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "QMySP-qHdwQNZY0gDba0ng",
            "sH-11zOhWubXobEeuMo2gg"
        ],
        "explanation": {
            "hf_TA4bRRnzLQh2XUbqX6w": "This restaurant is praised for its high-quality food and extensive menu options.",
            "3hjLxqqEfnBhwL6ecave_g": "Ranked here for its good quality meals, offering a variety of choices that meet user preferences.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Known for consistent food quality but with a slightly less diverse menu compared to top options.",
            "QMySP-qHdwQNZY0gDba0ng": "Offers decent quality food, though the menu variety is more limited than preferred.",
            "sH-11zOhWubXobEeuMo2gg": "While it has good quality, it falls behind in menu options and variety, thus placed last."
        }
    },
    "6FFFFNZLeeHERUs1MatgBg": {
        "kw": [
            "food",
            "restaurant",
            "edinburgh",
            "tea",
            "great food"
        ],
        "candidate": [
            "S1eha-aT5c7WMk7lDLsW0A",
            "se9MhDAQjACYMO3LCIfT1Q",
            "Qe7yHDU5SPTsLVqQ6Cgnsw",
            "2vOHS-_p5ylEf0BGR1dO9w",
            "xjBvbDmbsA0VX-vA55SbAA"
        ],
        "explanation": {
            "S1eha-aT5c7WMk7lDLsW0A": "Known for its exceptional tea selection and renowned culinary offerings, making it a top choice for great food.",
            "se9MhDAQjACYMO3LCIfT1Q": "Offers a delightful range of dishes alongside a good tea menu, suiting the user’s preferences well.",
            "Qe7yHDU5SPTsLVqQ6Cgnsw": "A solid option with good food and a variety of teas, but not as highly regarded as the top two.",
            "2vOHS-_p5ylEf0BGR1dO9w": "Features decent food but lacks a notable tea selection compared to higher-ranked options.",
            "xjBvbDmbsA0VX-vA55SbAA": "Lower priority due to less emphasis on food quality and tea compared to others in the improved ranking."
        }
    },
    "mptGtDdTKaoKPxYY2puS5Q": {
        "kw": [
            "food",
            "friend",
            "restaurant",
            "way",
            "edinburgh"
        ],
        "candidate": [
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "BmrVL3Aj5usPfpu5DE1iCg",
            "6MR9GZjWjLAS3s39YdDXKw",
            "PiT0jyLL2Jwm2ODTDapOcg",
            "366NwqHwhOic5pBN1DjmDQ"
        ],
        "explanation": {
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Known for its vibrant atmosphere and great food, making it ideal for dining with friends.",
            "BmrVL3Aj5usPfpu5DE1iCg": "Offers a cozy setting with delicious dishes, perfect for a friendly gathering.",
            "6MR9GZjWjLAS3s39YdDXKw": "A popular spot renowned for its food and social vibe, appealing to those who enjoy dining with companions.",
            "PiT0jyLL2Jwm2ODTDapOcg": "Well-loved for its culinary offerings but less focused on social dining.",
            "366NwqHwhOic5pBN1DjmDQ": "While serving quality food, it lacks the social-friendly ambiance that enhances dining experiences with friends."
        }
    },
    "l_n89Nfn1BSJENwHy9nt-A": {
        "kw": [
            "food",
            "while",
            "beef",
            "restaurant",
            "dishes"
        ],
        "candidate": [
            "se9MhDAQjACYMO3LCIfT1Q",
            "KtUuxN2gZXeC7WpJ_w9hNg",
            "z-3ZDmVbHZjDrYZE42yKZA",
            "adI5BlJCtvWq2uAwmyndXA",
            "u9iy3hyA9HpETKi9qns__A."
        ],
        "explanation": {
            "se9MhDAQjACYMO3LCIfT1Q": "This restaurant is renowned for its exceptional beef dishes, making it the top choice for the user’s preferences.",
            "KtUuxN2gZXeC7WpJ_w9hNg": "Known for its variety of beef dishes, this spot offers a mix of traditional and innovative options that appeal to beef lovers.",
            "z-3ZDmVbHZjDrYZE42yKZA": "While it offers good food, its beef selection is not as expansive as the top two.",
            "adI5BlJCtvWq2uAwmyndXA": "This restaurant has some appealing dishes but focuses more on other proteins rather than beef.",
            "u9iy3hyA9HpETKi9qns__A": "It is a lower-ranked option, having limited beef dishes compared to the others."
        }
    },
    "ixBoXpBL1JmKmcP1F2fTHA": {
        "kw": [
            "food",
            "while",
            "menu",
            "minutes",
            "reality"
        ],
        "candidate": [
            "adI5BlJCtvWq2uAwmyndXA",
            "S1eha-aT5c7WMk7lDLsW0A",
            "hJNjKc4sKgWG__KitlJ1ag",
            "36jGZp7V0jLnPCYmRipUCg",
            "u9iy3hyA9HpETKi9qns__A."
        ],
        "explanation": {
            "adI5BlJCtvWq2uAwmyndXA": "This restaurant offers a diverse menu and efficient service, meeting the user’s preference for variety and quick dining.",
            "S1eha-aT5c7WMk7lDLsW0A": "This place is known for its innovative dishes and timely service, making it a good choice for someone valuing food quality and quick meals.",
            "hJNjKc4sKgWG__KitlJ1ag": "While it has a good menu, the service may be slower, thus ranking lower despite its quality.",
            "36jGZp7V0jLnPCYmRipUCg": "This restaurant has decent offerings but lacks the variety and speed desired by the user.",
            "u9iy3hyA9HpETKi9qns__A": "It has limited menu options and longer wait times, making it the least preferable option in this context."
        }
    },
    "lh1QIr8Bp8WOI1ws1tPZWA": {
        "kw": [
            "food",
            "while",
            "menu",
            "spicy sauce",
            "bit"
        ],
        "candidate": [
            "zc_ptb03jQiXnWGwmpAk0A",
            "z57omnqRcAODGwbwMHEIyw",
            "6MR9GZjWjLAS3s39YdDXKw",
            "LUhVj-r2TtmFx6cyF9ilJg",
            "zK_6fn5ZLSkW7OhRD30IBw"
        ],
        "explanation": {
            "zc_ptb03jQiXnWGwmpAk0A": "This restaurant is celebrated for its diverse menu and signature spicy sauces that align perfectly with your preferences.",
            "z57omnqRcAODGwbwMHEIyw": "Known for its bold flavors and creative dishes, this spot offers a variety of spicy options that excite the palate.",
            "6MR9GZjWjLAS3s39YdDXKw": "It has a good selection of spicy dishes, appealing for those who enjoy a bit of heat along with tasty food.",
            "LUhVj-r2TtmFx6cyF9ilJg": "A popular choice, but its spice levels tend to be milder compared to the top-ranking restaurants.",
            "zK_6fn5ZLSkW7OhRD30IBw": "Although still a solid option, it lacks the variety and intensity of spicy sauces found in others."
        }
    },
    "3HsiYKmrVW2nMDwHMpsrzQ": {
        "kw": [
            "food",
            "bit",
            "tea",
            "place",
            "name"
        ],
        "candidate": [
            "s7TMkWF36dwwD8R3TKsJqw",
            "563C7-HcjhZwZSl4fK-mfQ",
            "366NwqHwhOic5pBN1DjmDQ",
            "FMoKoSHgitwnt_iMWm31nQ",
            "36jGZp7V0jLnPCYmRipUCg"
        ],
        "explanation": {
            "s7TMkWF36dwwD8R3TKsJqw": "Known for its delicious food and a cozy environment, making it a top choice for the user.",
            "563C7-HcjhZwZSl4fK-mfQ": "Offers a unique dining experience with high-quality food that resonates with the user’s preferences.",
            "366NwqHwhOic5pBN1DjmDQ": "A good mix of cuisine and atmosphere, appealing to the user’s taste for a pleasant place to dine.",
            "FMoKoSHgitwnt_iMWm31nQ": "While still a solid option, it doesn't quite match the same level of dining experience as the top choices.",
            "36jGZp7V0jLnPCYmRipUCg": "Has its merits but is lower on the list due to less emphasis on food quality compared to the others."
        }
    },
    "OdUSlS-S6qfZFnDUCKzwEg": {
        "kw": [
            "food",
            "while",
            "menu",
            "bag",
            "minutes"
        ],
        "candidate": [
            "se9MhDAQjACYMO3LCIfT1Q",
            "P_q9rwxm-O-8cQ3xiswHHg",
            "Kcg5iMwYq5ibBuEhDXKx3Q",
            "adI5BlJCtvWq2uAwmyndXA",
            "hJNjKc4sKgWG__KitlJ1ag"
        ],
        "explanation": {
            "se9MhDAQjACYMO3LCIfT1Q": "Offers a wide-ranging menu that aligns well with the user's food preferences and has quick service.",
            "P_q9rwxm-O-8cQ3xiswHHg": "Great food and reasonably fast service, though menu options are slightly less varied than the top-ranked restaurant.",
            "Kcg5iMwYq5ibBuEhDXKx3Q": "Solid food quality with a decent menu, but service time may be slower compared to the first two.",
            "adI5BlJCtvWq2uAwmyndXA": "Quality menu items, but typically a longer wait time, which does not align with the user's preferences.",
            "hJNjKc4sKgWG__KitlJ1ag": "While the food is good, limited menu options and longer wait times place it last."
        }
    },
    "KcfGrudzTcML2md1gwP53g": {
        "kw": [
            "food",
            "while",
            "door",
            "minutes",
            "friend"
        ],
        "candidate": [
            "Sqwa2aNwnqCmc95gVWQ9bA",
            "hz0ldhBHu5M4ri9M_mkOdQ",
            "V0tRCjf95FTqVJvmxdeqbQ",
            "563C7-HcjhZwZSl4fK-mfQ",
            "l_tk3iLmyKfBUCK-6nBbHg"
        ],
        "explanation": {
            "Sqwa2aNwnqCmc95gVWQ9bA": "This restaurant is known for its excellent food and quick service, making it a great choice for a timely meal with friends.",
            "hz0ldhBHu5M4ri9M_mkOdQ": "Although slightly slower than the top choice, it still offers good food that friends can enjoy together.",
            "V0tRCjf95FTqVJvmxdeqbQ": "This option is decent but less favored due to its longer wait times compared to others.",
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant may have good food but is further away or has longer wait times, making it less convenient.",
            "l_tk3iLmyKfBUCK-6nBbHg": "It ranks lowest because it doesn't fit the quick access criteria as well as others on the list."
        }
    },
    "w6T9G6r1QtPRoOYrFVEM1w": {
        "kw": [
            "food",
            "place",
            "manager",
            "drinks",
            "venison"
        ],
        "candidate": [
            "563C7-HcjhZwZSl4fK-mfQ",
            "EKEPtNKJdZxRhYoFhuG8ew",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "L4ivYHVCDpIE0SrPaCn0LA"
        ],
        "explanation": {
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant excels in its venison offerings, has a well-regarded manager, and a strong drinks menu that fits the user's preferences.",
            "EKEPtNKJdZxRhYoFhuG8ew": "Known for its great ambiance and good food quality, this place aligns well with the user’s preference for a nice dining environment.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "While this restaurant has decent food options, it does not specialize in venison or drinks, making it less preferable.",
            "L4ivYHVCDpIE0SrPaCn0LA": "This restaurant is rated lower due to average management and a less appealing selection of drinks and food focusing on venison."
        }
    },
    "-ZM78Lp6guNOiE6yJNAJHw": {
        "kw": [
            "food",
            "menu",
            "minutes",
            "beef",
            "meal"
        ],
        "candidate": [
            "ZOyBVpeSQ7sYDeZa_v0MFw",
            "u9iy3hyA9HpETKi9qns__A",
            "vL44Ky9VxUtOgteyHasRIA",
            "8PmbCVEjWGPouD1Tst6FsQ",
            "P_q9rwxm-O-8cQ3xiswHHg"
        ],
        "explanation": {
            "ZOyBVpeSQ7sYDeZa_v0MFw": "Known for its diverse beef options and well-reviewed meal quality, making it highly favorable.",
            "u9iy3hyA9HpETKi9qns__A": "Offers a solid beef menu and generally quick service, appealing to the user's time preference.",
            "vL44Ky9VxUtOgteyHasRIA": "A decent selection of beef dishes, though not as standout as the top two options.",
            "8PmbCVEjWGPouD1Tst6FsQ": "Good overall menu, but its beef offerings are limited compared to higher-ranked options.",
            "P_q9rwxm-O-8cQ3xiswHHg": "While it has some meal appeal, the beef selections are not compelling enough to rank higher."
        }
    },
    "L3kgTysYuNKMtGPBZiP_bA": {
        "kw": [
            "food",
            "while",
            "menu",
            "door",
            "minutes"
        ],
        "candidate": [
            "vL44Ky9VxUtOgteyHasRIA",
            "S1eha-aT5c7WMk7lDLsW0A",
            "se9MhDAQjACYMO3LCIfT1Q",
            "563C7-HcjhZwZSl4fK-mfQ",
            "xWuzWH8qYaa75REqVd9Isw"
        ],
        "explanation": {
            "vL44Ky9VxUtOgteyHasRIA": "This restaurant is known for its diverse menu and quick service, making it ideal for food enthusiasts who value both quality and efficiency.",
            "S1eha-aT5c7WMk7lDLsW0A": "Offers a robust menu selection and a good balance of food quality, with relatively short wait times.",
            "se9MhDAQjACYMO3LCIfT1Q": "Although the food is decent, it lacks some variety in the menu compared to the top spots but has reasonable wait times.",
            "563C7-HcjhZwZSl4fK-mfQ": "Known for its food, but the menu is less flexible and door accessibility can be an issue, lowering its rank.",
            "xWuzWH8qYaa75REqVd9Isw": "This restaurant has longer wait times and less appealing menu options, contributing to its last-place position."
        }
    },
    "6S6sZMLuy_StHVs2lqpUUw": {
        "kw": [
            "food",
            "minutes",
            "standard",
            "restaurant",
            "place"
        ],
        "candidate": [
            "B9gUwTS1_Yzj2vajjC7Vmg",
            "QMySP-qHdwQNZY0gDba0ng",
            "sH-11zOhWubXobEeuMo2gg",
            "lWRbdK9YABr0auLG19FHhQ",
            "PcR-9sTQRK_UN7qO9rzDNw"
        ],
        "explanation": {
            "B9gUwTS1_Yzj2vajjC7Vmg": "This restaurant is known for its high-quality food and efficient service, making it a top choice for the user.",
            "QMySP-qHdwQNZY0gDba0ng": "Offers a solid standard dining experience with well-reviewed dishes that meet the user's expectations.",
            "sH-11zOhWubXobEeuMo2gg": "Known for its quick service and quality meals, it ranks well for those concerned with time without sacrificing taste.",
            "lWRbdK9YABr0auLG19FHhQ": "While still a good option, it is slightly lower due to longer wait times compared to the top three.",
            "PcR-9sTQRK_UN7qO9rzDNw": "This restaurant, while decent, falls short on food quality when compared to others in the new ranking."
        }
    },
    "WW3uGfrqB4tTDlQMKCiDbA": {
        "kw": [
            "food",
            "menu",
            "bag",
            "price",
            "quality"
        ],
        "candidate": [
            "BTDPN3hMRrENFZNb76lPKw",
            "Kcg5iMwYq5ibBuEhDXKx3Q",
            "cgEzHZQKhi2anXfyF75MQw",
            "6MR9GZjWjLAS3s39YdDXKw"
        ],
        "explanation": {
            "BTDPN3hMRrENFZNb76lPKw": "This restaurant offers a diverse menu with high-quality ingredients, ensuring a satisfying food experience.",
            "Kcg5iMwYq5ibBuEhDXKx3Q": "Known for its balance of price and quality, this restaurant provides excellent value without compromising taste.",
            "cgEzHZQKhi2anXfyF75MQw": "It has decent food quality but lacks in menu diversity compared to the top two choices.",
            "6MR9GZjWjLAS3s39YdDXKw": "While it might have attractive pricing, the overall food quality and menu options are less appealing than others."
        }
    },
    "mJM9uvrQ0q1nrSn1xRbHQQ": {
        "kw": [
            "food",
            "menu",
            "door",
            "part",
            "soup"
        ],
        "candidate": [
            "hz0ldhBHu5M4ri9M_mkOdQ",
            "_jNe_vwxiEh0G9JRZByc0w",
            "fbZKVUec4oNGmPRXzWGpxQ",
            "xjBvbDmbsA0VX-vA55SbAA",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "hz0ldhBHu5M4ri9M_mkOdQ": "This restaurant is known for its exceptional soup options and a diverse menu that aligns well with the user's preferences.",
            "_jNe_vwxiEh0G9JRZByc0w": "Offers a strong menu with various good food options, making it a close second in satisfying the user's taste.",
            "fbZKVUec4oNGmPRXzWGpxQ": "While it has a decent menu, its offerings are less aligned with the preferred soup choices compared to the top two.",
            "xjBvbDmbsA0VX-vA55SbAA": "This restaurant is good but lacks the variety in food and soup that the user appreciates.",
            "563C7-HcjhZwZSl4fK-mfQ": "Ranked lowest as it does not particularly stand out in food quality or menu variety for the user's specified preferences."
        }
    },
    "cDR_WMmV9dp2LwW-w_KmUA": {
        "kw": [
            "food",
            "menu",
            "door",
            "beef",
            "wait"
        ],
        "candidate": [
            "W-kOZ946xRWBJZvxXhJ7DA",
            "voaZjLwStQEq9-wj7hFYBQ",
            "563C7-HcjhZwZSl4fK-mfQ",
            "vL44Ky9VxUtOgteyHasRIA",
            "Kcg5iMwYq5ibBuEhDXKx3Q"
        ],
        "explanation": {
            "W-kOZ946xRWBJZvxXhJ7DA": "Known for its excellent beef dishes and a diverse menu, making it the top choice.",
            "voaZjLwStQEq9-wj7hFYBQ": "Offers a wide variety of foods, including great beef options, and is generally efficient in service.",
            "563C7-HcjhZwZSl4fK-mfQ": "Satisfactory in terms of food quality and menu selection, but not as strong in beef offerings.",
            "vL44Ky9VxUtOgteyHasRIA": "Good food overall, but lacks the beef focus and variety desired by the user.",
            "Kcg5iMwYq5ibBuEhDXKx3Q": "While it offers decent food, it ranks lowest due to limited menu options and longer wait times."
        }
    },
    "qFOy-T6HU4WxS5t_34IBaQ": {
        "kw": [
            "food",
            "menu",
            "minutes",
            "good quality",
            "standard"
        ],
        "candidate": [
            "J_KI8rJa_dSwTglUbwFcdw",
            "QMySP-qHdwQNZY0gDba0ng",
            "aIs7Tt3pw6ymj3FOPPR4Ng",
            "sH-11zOhWubXobEeuMo2gg",
            "xbCNlp2vWixy2W1WsfGv8g"
        ],
        "explanation": {
            "J_KI8rJa_dSwTglUbwFcdw": "Known for its excellent quality and varied menu, making it a top choice for food enthusiasts.",
            "QMySP-qHdwQNZY0gDba0ng": "Offers a good selection of dishes with a focus on fresh ingredients, reflects high standards.",
            "aIs7Tt3pw6ymj3FOPPR4Ng": "Offers good food quality but with a more limited menu compared to the top two.",
            "sH-11zOhWubXobEeuMo2gg": "While the food is decent, it lacks the variety and quality of higher-ranked options.",
            "xbCNlp2vWixy2W1WsfGv8g": "Despite being lower in ranking due to standard quality, it maintains a consistent but less exciting menu."
        }
    },
    "JUc49GPNufVHhPl2BIoAAw": {
        "kw": [
            "food",
            "place",
            "table",
            "day",
            "chicken"
        ],
        "candidate": [
            "V8vKFvdrvhTrQrt-rxKrPA",
            "_jNe_vwxiEh0G9JRZByc0w",
            "xjBvbDmbsA0VX-vA55SbAA",
            "EiYE3T3hfqcpcficZ4zJzQ",
            "pM4mWLjeaZJlcdUxut2lMg"
        ],
        "explanation": {
            "V8vKFvdrvhTrQrt-rxKrPA": "This restaurant is known for its excellent chicken dishes, making it a top choice for the user.",
            "_jNe_vwxiEh0G9JRZByc0w": "Offers a good ambiance and tables that are suitable for dining, plus is favorable for chicken menu options.",
            "xjBvbDmbsA0VX-vA55SbAA": "Has a decent selection of chicken dishes but is less popular for the dining ambiance.",
            "EiYE3T3hfqcpcficZ4zJzQ": "Satisfactory chicken offerings, but does not excel in either location or atmosphere.",
            "pM4mWLjeaZJlcdUxut2lMg": "While it may have other good menu items, it ranks last as it lacks a strong focus on the user's chicken preference."
        }
    },
    "2C7OiKoA9Tqkt76siBbRYA": {
        "kw": [
            "food",
            "bit",
            "wait",
            "price",
            "quality"
        ],
        "candidate": [
            "FMoKoSHgitwnt_iMWm31nQ",
            "nbJXmGpdCxiBnovBkBtWcA",
            "563C7-HcjhZwZSl4fK-mfQ",
            "sH-11zOhWubXobEeuMo2gg",
            "yYh6t6a_0LGLVS_MNYEHsQ"
        ],
        "explanation": {
            "FMoKoSHgitwnt_iMWm31nQ": "This restaurant is known for its high-quality food and reasonable prices, making it the top choice.",
            "nbJXmGpdCxiBnovBkBtWcA": "Offers a good balance of quality and price, with relatively low wait times.",
            "563C7-HcjhZwZSl4fK-mfQ": "Quality is decent but slightly higher in price; it's moved down due to less favorable wait times.",
            "sH-11zOhWubXobEeuMo2gg": "Wait times can be longer here, and while food is satisfactory, the price does not justify it compared to others.",
            "yYh6t6a_0LGLVS_MNYEHsQ": "Ranked lowest as it has the longest wait and doesn't offer as much value for the quality of food served."
        }
    },
    "r45-ZWkRzYk8_FnN4Wgnfw": {
        "kw": [
            "food",
            "while",
            "restaurant",
            "way",
            "edinburgh"
        ],
        "candidate": [
            "Kcg5iMwYq5ibBuEhDXKx3Q",
            "S1eha-aT5c7WMk7lDLsW0A",
            "I1j1kEbQ5BliKsjzl5etVA",
            "z57omnqRcAODGwbwMHEIyw",
            "xjBvbDmbsA0VX-vA55SbAA"
        ],
        "explanation": {
            "Kcg5iMwYq5ibBuEhDXKx3Q": "This restaurant is renowned for its exceptional local cuisine and has received numerous accolades in Edinburgh.",
            "S1eha-aT5c7WMk7lDLsW0A": "Known for its innovative dishes and vibrant ambiance, this spot is popular among food enthusiasts.",
            "I1j1kEbQ5BliKsjzl5etVA": "A well-regarded establishment that offers a contemporary spin on classic Scottish dishes.",
            "z57omnqRcAODGwbwMHEIyw": "Offers a solid menu but has less emphasis on uniqueness compared to the top-ranked options.",
            "xjBvbDmbsA0VX-vA55SbAA": "While decent, it lacks the standout qualities of the other restaurants in terms of the culinary experience."
        }
    },
    "-zhW9UyMKOMuuydi17x7Ag": {
        "kw": [
            "food",
            "menu",
            "quality",
            "restaurant",
            "way"
        ],
        "candidate": [
            "FMoKoSHgitwnt_iMWm31nQ",
            "MuVIpRAEkNfRnmhsPTdl3A",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "366NwqHwhOic5pBN1DjmDQ"
        ],
        "explanation": {
            "FMoKoSHgitwnt_iMWm31nQ": "This restaurant offers an exceptional menu with diverse options and high food quality.",
            "MuVIpRAEkNfRnmhsPTdl3A": "Known for its excellent food quality, it's a close competitor but slightly lacks menu variety compared to the top choice.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Offers good quality food but limited in menu options, making it less favorable for diverse preferences.",
            "366NwqHwhOic5pBN1DjmDQ": "While it has decent food quality, it does not meet the user’s preference for menu variety and quality as well as the others."
        }
    },
    "tI5jVZ1CGZr2tLt1cwGZ5g": {
        "kw": [
            "food",
            "menu",
            "price",
            "way",
            "place"
        ],
        "candidate": [
            "tD1veHsKELAH3b7wKmHsaw",
            "xOZ7bkrttSIGS4NZm49w5Q",
            "AUiX65HxQqwk1yvsBcbTdQ",
            "563C7-HcjhZwZSl4fK-mfQ",
            "nJdNzQ5Z278gTCFJ4HQBLA."
        ],
        "explanation": {
            "tD1veHsKELAH3b7wKmHsaw": "This restaurant excels in a diverse menu and offers good value for the quality of food, making it the top choice.",
            "xOZ7bkrttSIGS4NZm49w5Q": "Known for its excellent food and nice dining atmosphere, it ranks just behind for its slightly higher price point.",
            "AUiX65HxQqwk1yvsBcbTdQ": "Offers a decent menu and reasonable prices, but lacks in certain dining aspects compared to the top two.",
            "563C7-HcjhZwZSl4fK-mfQ": "While the food is good, it has a more limited menu and is less accessible in terms of location and price.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "This restaurant is ranked lowest primarily due to a lack of variety and higher price points compared to others."
        }
    },
    "1otkilxTrHF6Z1vdrrlZrQ": {
        "kw": [
            "food",
            "menu",
            "door",
            "bit",
            "friend"
        ],
        "candidate": [
            "5Iin0tl6QJT_TyL1BldtyA",
            "GS06uO84yKQpa7oezgVZgQ",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "se9MhDAQjACYMO3LCIfT1Q"
        ],
        "explanation": {
            "5Iin0tl6QJT_TyL1BldtyA": "This restaurant offers a diverse and high-quality menu that emphasizes fresh ingredients, making it a top choice for food lovers.",
            "GS06uO84yKQpa7oezgVZgQ": "Known for its friendly service and inviting atmosphere, this venue enhances dining experiences, catering well to the user's preference for a welcoming place.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Offers good quality food with a decent variety on the menu, albeit not as strong on friendliness compared to the top two.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "While it has a decent menu, it lacks the standout food quality and atmosphere of the top three, placing it lower in the ranking.",
            "se9MhDAQjACYMO3LCIfT1Q": "Although it offers an acceptable menu, it does not quite meet the user's food and atmosphere preferences, resulting in the lowest placement."
        }
    },
    "sJ-LZrznwzO49Syt_cI7Sg": {
        "kw": [
            "food",
            "menu",
            "wait",
            "friend",
            "price"
        ],
        "candidate": [
            "aHYIubjRbTLB3o_eXkrMXA",
            "xbCNlp2vWixy2W1WsfGv8g",
            "vL44Ky9VxUtOgteyHasRIA",
            "te-QMdSMQdjws6NnRexjJQ",
            "Q0fcX_1wvdmffqEPa246rg"
        ],
        "explanation": {
            "aHYIubjRbTLB3o_eXkrMXA": "This restaurant offers high-quality food, a diverse menu, and is well-priced, making it the top choice for friends.",
            "xbCNlp2vWixy2W1WsfGv8g": "Known for its good food and reasonable wait times, this option also features a menu that caters to various tastes.",
            "vL44Ky9VxUtOgteyHasRIA": "It strikes a balance between food quality and affordability, though the menu might be less varied than the top two.",
            "te-QMdSMQdjws6NnRexjJQ": "This restaurant has decent food and a moderate price but does not excel in menu options or wait times.",
            "Q0fcX_1wvdmffqEPa246rg": "While popular, it tends to have longer wait times and higher prices, placing it last in this ranking based on user preferences."
        }
    },
    "QyP254XCNlI7DvPsze5LQw": {
        "kw": [
            "food",
            "menu",
            "door",
            "meal",
            "restaurant"
        ],
        "candidate": [
            "GS06uO84yKQpa7oezgVZgQ",
            "S1eha-aT5c7WMk7lDLsW0A",
            "Kcg5iMwYq5ibBuEhDXKx3Q",
            "V0tRCjf95FTqVJvmxdeqbQ",
            "l_tk3iLmyKfBUCK-6nBbHg"
        ],
        "explanation": {
            "GS06uO84yKQpa7oezgVZgQ": "This restaurant is known for its diverse menu that caters to various preferences, making it an excellent choice for different meal occasions.",
            "S1eha-aT5c7WMk7lDLsW0A": "Offers a great balance between food quality and an innovative menu, appealing to those looking for unique dining experiences.",
            "Kcg5iMwYq5ibBuEhDXKx3Q": "It provides a solid selection of meals, maintaining good food quality but lacking some of the inventive dishes found in higher-ranked options.",
            "V0tRCjf95FTqVJvmxdeqbQ": "While still a good choice, the menu is less diverse compared to the top-ranked restaurants, limiting meal options.",
            "l_tk3iLmyKfBUCK-6nBbHg": "This restaurant ranks lower due to a more limited menu with fewer appealing choices, affecting the overall dining experience."
        }
    },
    "hpCpVb1Ty9LoYQ0-gzRDDw": {
        "kw": [
            "food",
            "menu",
            "price",
            "quality",
            "way"
        ],
        "candidate": [
            "LUhVj-r2TtmFx6cyF9ilJg",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "xOZ7bkrttSIGS4NZm49w5Q",
            "z-3ZDmVbHZjDrYZE42yKZA"
        ],
        "explanation": {
            "LUhVj-r2TtmFx6cyF9ilJg": "This restaurant excels in a diverse menu and high quality of food without being overly expensive.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Known for excellent quality, this restaurant offers great value for the price, making it a solid choice.",
            "xOZ7bkrttSIGS4NZm49w5Q": "While it has good quality food, the menu is somewhat limited compared to the top options, impacting its ranking.",
            "z-3ZDmVbHZjDrYZE42yKZA": "This restaurant falls short in terms of menu diversity and price, making it less favorable overall."
        }
    },
    "-TJhZseJMYZjOab0wMOnAQ": {
        "kw": [
            "food",
            "beef",
            "good quality",
            "decor",
            "restaurant"
        ],
        "candidate": [
            "AUiX65HxQqwk1yvsBcbTdQ",
            "z57omnqRcAODGwbwMHEIyw",
            "J_KI8rJa_dSwTglUbwFcdw",
            "xOZ7bkrttSIGS4NZm49w5Q",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "AUiX65HxQqwk1yvsBcbTdQ": "This restaurant is renowned for its premium beef, ensuring quality food that meets the user's preference.",
            "z57omnqRcAODGwbwMHEIyw": "Offers a variety of expertly cooked beef dishes and boasts a modern decor, enhancing the dining experience.",
            "J_KI8rJa_dSwTglUbwFcdw": "Known for good quality beef and a cozy, stylish ambiance, making it a suitable choice for the user.",
            "xOZ7bkrttSIGS4NZm49w5Q": "While it has decent beef offerings, its decor is less impressive compared to the top three, placing it lower.",
            "563C7-HcjhZwZSl4fK-mfQ": "Although it serves good food, it lacks the specific focus on beef quality and appealing decor that the user desires."
        }
    },
    "hIZiWElzEfM4Jh_xkrDVpg": {
        "kw": [
            "food",
            "menu",
            "restaurant",
            "way",
            "edinburgh"
        ],
        "candidate": [
            "z57omnqRcAODGwbwMHEIyw",
            "cgEzHZQKhi2anXfyF75MQw",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "adI5BlJCtvWq2uAwmyndXA",
            "Vtahv3Af90H3fUuEEhPhdQ"
        ],
        "explanation": {
            "z57omnqRcAODGwbwMHEIyw": "This restaurant is renowned for its innovative Scottish menu and locally sourced ingredients, making it a top choice for food enthusiasts in Edinburgh.",
            "cgEzHZQKhi2anXfyF75MQw": "This establishment offers a diverse menu with exceptional food quality, appealing to those looking for a varied dining experience.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "While slightly less notable than the top two, it still boasts a unique culinary approach and is well-rated for its flavorful dishes.",
            "adI5BlJCtvWq2uAwmyndXA": "Although it has merit, it caters more to casual dining, making it less ideal for a focused culinary experience.",
            "Vtahv3Af90H3fUuEEhPhdQ": "This restaurant, while enjoyable, may lack the exceptional menu variety that the user seems to favor."
        }
    },
    "ZYZNcugF3xUEGyLOVGiZ0Q": {
        "kw": [
            "food",
            "menu",
            "friend",
            "quality",
            "restaurant"
        ],
        "candidate": [
            "MuVIpRAEkNfRnmhsPTdl3A",
            "FMoKoSHgitwnt_iMWm31nQ",
            "Q0fcX_1wvdmffqEPa246rg",
            "wNy3CnWWAnTCfDYsZTSUPw"
        ],
        "explanation": {
            "MuVIpRAEkNfRnmhsPTdl3A": "This restaurant offers a diverse and high-quality menu that aligns well with the user's food and quality preferences.",
            "FMoKoSHgitwnt_iMWm31nQ": "Known for its excellent menu options, it's a favorite for friends dining together, ranking it higher.",
            "Q0fcX_1wvdmffqEPa246rg": "While still good, it lacks the broader appeal and quality found in the top two restaurants.",
            "wNy3CnWWAnTCfDYsZTSUPw": "Although it has its charm, it ranked lower due to limited menu options and food quality that does not match the user's top priorities."
        }
    },
    "Oj8RHeu2_I9hMmme8IbU4A": {
        "kw": [
            "food",
            "menu",
            "quality",
            "flavours",
            "tea"
        ],
        "candidate": [
            "z-3ZDmVbHZjDrYZE42yKZA",
            "W-kOZ946xRWBJZvxXhJ7DA",
            "563C7-HcjhZwZSl4fK-mfQ",
            "qesu3mk5yHeak9CUO4gRdQ"
        ],
        "explanation": {
            "z-3ZDmVbHZjDrYZE42yKZA": "This restaurant is recognized for its outstanding menu quality and rich flavours, making it a top choice for food lovers, especially those who enjoy tea pairings.",
            "W-kOZ946xRWBJZvxXhJ7DA": "Known for its diverse menu and flavorful offerings, it ranks highly but slightly lower due to fewer tea selections compared to the first.",
            "563C7-HcjhZwZSl4fK-mfQ": "Offers good food and quality, but the menu is less extensive than those ranked higher.",
            "qesu3mk5yHeak9CUO4gRdQ": "While it has quality food, it falls short in menu variety and flavours compared to the others on this list."
        }
    },
    "nBwONfmYwAK-wpw-1SKxYA": {
        "kw": [
            "food",
            "restaurant",
            "place",
            "lady",
            "hour"
        ],
        "candidate": [
            "e8ohWYW8rbOZWZ4pojU4zQ",
            "563C7-HcjhZwZSl4fK-mfQ",
            "sH-11zOhWubXobEeuMo2gg",
            "22nkIQ4BeSYwsyaPOczOeA"
        ],
        "explanation": {
            "e8ohWYW8rbOZWZ4pojU4zQ": "This restaurant is known for its exceptional food quality and a pleasant dining atmosphere, making it an ideal choice based on the user's preference.",
            "563C7-HcjhZwZSl4fK-mfQ": "While slightly lower, this restaurant maintains a solid reputation for its food and offers a cozy environment suitable for an evening out.",
            "sH-11zOhWubXobEeuMo2gg": "This option presents a decent dining experience but falls short in cuisine variety compared to the top two restaurants.",
            "22nkIQ4BeSYwsyaPOczOeA": "Although not necessarily bad, it offers less in the way of ambiance and culinary distinction, placing it last in this ranking."
        }
    },
    "DWxUS4lNikQQgD3GaiHf8Q": {
        "kw": [
            "food",
            "restaurant",
            "edinburgh",
            "place",
            "service"
        ],
        "candidate": [
            "voaZjLwStQEq9-wj7hFYBQ",
            "N8hUGYmf0jEO9eDzmYHuAw",
            "_jNe_vwxiEh0G9JRZByc0w",
            "vxXiFhC4KX7qTOfRHnu0NA",
            "o9KcGDv2Lkbtit7mxZs8qA"
        ],
        "explanation": {
            "voaZjLwStQEq9-wj7hFYBQ": "Known for excellent food and outstanding service, making it a perfect fit for the user's preferences.",
            "N8hUGYmf0jEO9eDzmYHuAw": "Offers great culinary experiences and a lively atmosphere, appealing to diners looking for both food and service quality.",
            "_jNe_vwxiEh0G9JRZByc0w": "Provides good food quality and decent service, maintaining a solid reputation in the Edinburgh dining scene.",
            "vxXiFhC4KX7qTOfRHnu0NA": "While it has tasty food, the service may not be as exceptional as the top-ranked options, placing it lower.",
            "o9KcGDv2Lkbtit7mxZs8qA": "Although it serves decent meals, it lacks the standout qualities in service and food that the top restaurants offer, resulting in the lowest rank."
        }
    },
    "dq27itUgsOV9ObbtpBRezQ": {
        "kw": [
            "food",
            "menu",
            "door",
            "bit",
            "quality"
        ],
        "candidate": [
            "I1j1kEbQ5BliKsjzl5etVA",
            "voaZjLwStQEq9-wj7hFYBQ",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "GS06uO84yKQpa7oezgVZgQ",
            "Z-9ZLg77FXTQCMqp1gGsrQ"
        ],
        "explanation": {
            "I1j1kEbQ5BliKsjzl5etVA": "Known for its high-quality food and an extensive menu selection, making it a top choice for discerning diners.",
            "voaZjLwStQEq9-wj7hFYBQ": "Offers a diverse menu with a focus on quality, appealing to the user's preference for varied dining options.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "While it has good food, its menu variety is slightly less than the top two, placing it in the middle.",
            "GS06uO84yKQpa7oezgVZgQ": "Provides solid food quality but has a more limited menu, which doesn't align as well with the user's preferences.",
            "Z-9ZLg77FXTQCMqp1gGsrQ": "While it has decent food, it ranks last due to lower quality and menu diversity compared to the others."
        }
    },
    "lOZKlSyQa-jSv4HZ66okGg": {
        "kw": [
            "food",
            "while",
            "menu",
            "door",
            "minutes"
        ],
        "candidate": [
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "LUhVj-r2TtmFx6cyF9ilJg",
            "P_q9rwxm-O-8cQ3xiswHHg",
            "vL44Ky9VxUtOgteyHasRIA"
        ],
        "explanation": {
            "E7s0QreUJ2H9r0Ls1yDeiQ": "This restaurant offers a diverse menu and is known for its exceptional food quality, making it the top choice.",
            "LUhVj-r2TtmFx6cyF9ilJg": "A strong second choice due to a good menu variety and balanced food options.",
            "P_q9rwxm-O-8cQ3xiswHHg": "This option provides decent food, but slightly less menu variety compared to the top two.",
            "vL44Ky9VxUtOgteyHasRIA": "Previously rated higher, but its limited menu options and lower overall food quality influence its placement here."
        }
    },
    "F0nFAY1Qi_7it_Q52n3nTw": {
        "kw": [
            "food",
            "while",
            "menu",
            "minutes",
            "reality"
        ],
        "candidate": [
            "36jGZp7V0jLnPCYmRipUCg",
            "hJNjKc4sKgWG__KitlJ1ag",
            "8Haoz9Mil7ZnHGU48sgBtw",
            "S1eha-aT5c7WMk7lDLsW0A"
        ],
        "explanation": {
            "36jGZp7V0jLnPCYmRipUCg": "Known for its wide-ranging menu that caters to various tastes and quick service.",
            "hJNjKc4sKgWG__KitlJ1ag": "Offers delightful food with some unique options, although slightly slower than the top pick.",
            "8Haoz9Mil7ZnHGU48sgBtw": "Good food and decent menu variety, but the wait times can be longer.",
            "S1eha-aT5c7WMk7lDLsW0A": "While it has a solid menu, it lacks the same variety and speed of service as the others."
        }
    },
    "ZD3_a2-bcugIQfh_0rWqIQ": {
        "kw": [
            "food",
            "menu",
            "minutes",
            "meal",
            "price"
        ],
        "candidate": [
            "vL44Ky9VxUtOgteyHasRIA",
            "P_q9rwxm-O-8cQ3xiswHHg",
            "8PmbCVEjWGPouD1Tst6FsQ",
            "LUhVj-r2TtmFx6cyF9ilJg",
            "vy5dhJyQ_VC1NUpPMmRUlw"
        ],
        "explanation": {
            "vL44Ky9VxUtOgteyHasRIA": "This restaurant offers a diverse menu with high-quality food options at reasonable prices, aligning with the user's preferences.",
            "P_q9rwxm-O-8cQ3xiswHHg": "Known for quick meal preparation and a balanced menu, it caters well to the user's preference for efficiency without compromising on taste.",
            "8PmbCVEjWGPouD1Tst6FsQ": "While the food is good, its price point may be slightly higher than preferred, causing it to be ranked lower.",
            "LUhVj-r2TtmFx6cyF9ilJg": "This restaurant has decent options but lacks the variety compared to those ranked higher, making it less favorable for the user.",
            "vy5dhJyQ_VC1NUpPMmRUlw": "Although it has some popular dishes, it does not meet several of the user's preferences effectively, resulting in the lowest ranking."
        }
    },
    "4FxADcoBgm_8xqTyfmTIug": {
        "kw": [
            "food",
            "beef",
            "good quality",
            "friend",
            "quality"
        ],
        "candidate": [
            "hJNjKc4sKgWG__KitlJ1ag",
            "S1eha-aT5c7WMk7lDLsW0A",
            "ZOyBVpeSQ7sYDeZa_v0MFw",
            "cgEzHZQKhi2anXfyF75MQw"
        ],
        "explanation": {
            "hJNjKc4sKgWG__KitlJ1ag": "Known for its premium beef offerings and high-quality dishes, ideal for a friend’s gathering.",
            "S1eha-aT5c7WMk7lDLsW0A": "Offers a solid range of beef dishes with good quality, making it a popular choice for quality-conscious diners.",
            "ZOyBVpeSQ7sYDeZa_v0MFw": "While it has decent options, it does not specialize in high-quality beef as much as the top choices.",
            "cgEzHZQKhi2anXfyF75MQw": "Less focused on beef and overall quality compared to the other ranked restaurants, making it less suitable for the user’s preferences."
        }
    },
    "l0-VQ8nA_oijpKlRB7dkow": {
        "kw": [
            "food",
            "menu",
            "decor",
            "restaurant",
            "servers"
        ],
        "candidate": [
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "hJNjKc4sKgWG__KitlJ1ag",
            "K8D_ltZWGvdXUaSE7bBiDw",
            "6MR9GZjWjLAS3s39YdDXKw"
        ],
        "explanation": {
            "nJdNzQ5Z278gTCFJ4HQBLA": "This restaurant consistently excels in food quality and has an extensive menu that appeals to diverse tastes.",
            "hJNjKc4sKgWG__KitlJ1ag": "Known for its beautiful decor and attentive service, this spot enhances the dining experience, making it a great second choice.",
            "K8D_ltZWGvdXUaSE7bBiDw": "While it has good food, the menu can be limited, and the decor is less impressive compared to the top two options.",
            "6MR9GZjWjLAS3s39YdDXKw": "This restaurant, although it offers decent food, falls short in service and ambiance, placing it at the bottom of the ranking."
        }
    },
    "8kWbwEqdgDjSogg56e6PnA": {
        "kw": [
            "food",
            "menu",
            "minutes",
            "meal",
            "soup"
        ],
        "candidate": [
            "WUAe0FGaLRCremEDXqNV4A",
            "B9gUwTS1_Yzj2vajjC7Vmg",
            "6Ljr0VgQpJOWJG6dlph9Fw",
            "6MR9GZjWjLAS3s39YdDXKw",
            "z-3ZDmVbHZjDrYZE42yKZA"
        ],
        "explanation": {
            "WUAe0FGaLRCremEDXqNV4A": "This restaurant offers a diverse menu with a strong emphasis on soups and hearty meals, making it a top choice for the user's preferences.",
            "B9gUwTS1_Yzj2vajjC7Vmg": "Known for its excellent food quality and variety, it also has a solid soup selection, appealing to the user's interests.",
            "6Ljr0VgQpJOWJG6dlph9Fw": "While this restaurant has decent food, its menu lacks the depth in soups that the user is looking for, placing it lower in the ranking.",
            "6MR9GZjWjLAS3s39YdDXKw": "This spot offers good meals but is somewhat limited in its soup offerings, which is a crucial part of the user's preferences.",
            "z-3ZDmVbHZjDrYZE42yKZA": "Although it provides a satisfactory dining experience, its menu does not cater specifically to the user's focus on soups and full meal options, making it the least favorable choice."
        }
    },
    "XKEaZzncxtx4BovE2eOAdw": {
        "kw": [
            "food",
            "door",
            "meal",
            "price",
            "standard"
        ],
        "candidate": [
            "zc_ptb03jQiXnWGwmpAk0A",
            "563C7-HcjhZwZSl4fK-mfQ",
            "366NwqHwhOic5pBN1DjmDQ",
            "z57omnqRcAODGwbwMHEIyw",
            "EiYE3T3hfqcpcficZ4zJzQ"
        ],
        "explanation": {
            "zc_ptb03jQiXnWGwmpAk0A": "This restaurant offers the best food quality and good price, appealing directly to the user’s preferences.",
            "563C7-HcjhZwZSl4fK-mfQ": "Known for its favorable meal options and reasonable pricing, making it a strong contender.",
            "366NwqHwhOic5pBN1DjmDQ": "While still good, its food quality is slightly below the top options but offers decent convenience.",
            "z57omnqRcAODGwbwMHEIyw": "This restaurant is less favorable in terms of food quality but remains competitive on price.",
            "EiYE3T3hfqcpcficZ4zJzQ": "Although it has its merits, it doesn't align closely with the user's needs for food quality and value."
        }
    },
    "-0MQ4webH2uc1ZAsGsNENg": {
        "kw": [
            "food",
            "quality",
            "restaurant",
            "tea",
            "star"
        ],
        "candidate": [
            "AUiX65HxQqwk1yvsBcbTdQ",
            "563C7-HcjhZwZSl4fK-mfQ",
            "xbCNlp2vWixy2W1WsfGv8g",
            "6MR9GZjWjLAS3s39YdDXKw",
            "sH-11zOhWubXobEeuMo2gg"
        ],
        "explanation": {
            "AUiX65HxQqwk1yvsBcbTdQ": "This restaurant is known for its exceptional food quality and a diverse menu that resonates with the user's taste.",
            "563C7-HcjhZwZSl4fK-mfQ": "This venue offers a delightful dining experience with highly praised dishes and a cozy atmosphere, perfect for tea lovers.",
            "xbCNlp2vWixy2W1WsfGv8g": "Ranked here for its consistent quality and unique culinary offerings that appeal to the user's palate.",
            "6MR9GZjWjLAS3s39YdDXKw": "This restaurant has a reputation for its innovative dishes and premium quality, making it a worthy contender.",
            "sH-11zOhWubXobEeuMo2gg": "While still a good option, it falls lower due to less emphasis on the specific preferences outlined."
        }
    },
    "omLRfZKggXtjRWN_VXf7Fg": {
        "kw": [
            "food",
            "price",
            "quality",
            "decor",
            "restaurant"
        ],
        "candidate": [
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "xWuzWH8qYaa75REqVd9Isw",
            "563C7-HcjhZwZSl4fK-mfQ",
            "EiYE3T3hfqcpcficZ4zJzQ"
        ],
        "explanation": {
            "nJdNzQ5Z278gTCFJ4HQBLA": "This restaurant excels in food quality and has an inviting decor, making it a top choice.",
            "xWuzWH8qYaa75REqVd9Isw": "Offers a great balance of price and quality, with a pleasant ambiance that enhances the dining experience.",
            "563C7-HcjhZwZSl4fK-mfQ": "While the food is good, it’s slightly pricier than the top choices, impacting its rank.",
            "EiYE3T3hfqcpcficZ4zJzQ": "Offers decent food but lacks in decor and overall value compared to the others, placing it last in the ranking."
        }
    },
    "rzB7X6rJckrK4kzSA3Dqng": {
        "kw": [
            "food",
            "while",
            "friend",
            "restaurant",
            "hotel"
        ],
        "candidate": [
            "Q0fcX_1wvdmffqEPa246rg",
            "r3U-3yOP1ZB8Yu8Gv0Auwg",
            "563C7-HcjhZwZSl4fK-mfQ",
            "FMoKoSHgitwnt_iMWm31nQ",
            "kHWSO8fV0Mp-M3J-w1ma7A"
        ],
        "explanation": {
            "Q0fcX_1wvdmffqEPa246rg": "This restaurant is highly praised for its food quality and vibrant atmosphere, making it ideal for dining with friends.",
            "r3U-3yOP1ZB8Yu8Gv0Auwg": "Known for its delicious menu and friendly service, it creates a welcoming environment for a meal with friends.",
            "563C7-HcjhZwZSl4fK-mfQ": "Offers a unique culinary experience that appeals to food lovers, justifying its position in the top half of the ranking.",
            "FMoKoSHgitwnt_iMWm31nQ": "While it still provides good food, its atmosphere and service are more casual, placing it lower in comparison.",
            "kHWSO8fV0Mp-M3J-w1ma7A": "Though it has its merits, it’s better suited for a more subdued outing, making it the least favorable for the user's stated preferences."
        }
    },
    "aDct2Z6b3vHuX5ra35uALA": {
        "kw": [
            "food",
            "decor",
            "edinburgh",
            "place",
            "star"
        ],
        "candidate": [
            "cgEzHZQKhi2anXfyF75MQw",
            "e8ohWYW8rbOZWZ4pojU4zQ",
            "B9gUwTS1_Yzj2vajjC7Vmg",
            "xOZ7bkrttSIGS4NZm49w5Q",
            "6MR9GZjWjLAS3s39YdDXKw"
        ],
        "explanation": {
            "cgEzHZQKhi2anXfyF75MQw": "This restaurant offers exceptional food and a cozy decor that enhances the dining experience in Edinburgh.",
            "e8ohWYW8rbOZWZ4pojU4zQ": "Known for its stunning interior and ambiance, it also serves quality dishes that match the user's preferences.",
            "B9gUwTS1_Yzj2vajjC7Vmg": "While it has a good food offering, the decor lacks the charm found in the top two places.",
            "xOZ7bkrttSIGS4NZm49w5Q": "Offers decent food but does not stand out in decor, placing it lower in the ranking.",
            "6MR9GZjWjLAS3s39YdDXKw": "Although it has its merits, it falls short in both food and decor compared to the others listed."
        }
    },
    "t8aJIHxkutRlWMRNSvpq6w": {
        "kw": [
            "food",
            "menu",
            "beef",
            "bit",
            "friend"
        ],
        "candidate": [
            "Q0fcX_1wvdmffqEPa246rg",
            "563C7-HcjhZwZSl4fK-mfQ",
            "AUiX65HxQqwk1yvsBcbTdQ",
            "se9MhDAQjACYMO3LCIfT1Q",
            "_TqUO2XaxLQ9i_z3RM8puQ"
        ],
        "explanation": {
            "Q0fcX_1wvdmffqEPa246rg": "Known for its diverse menu with a strong focus on high-quality beef dishes, this restaurant is ideal for the user's food preferences.",
            "563C7-HcjhZwZSl4fK-mfQ": "Offers a good selection of beef options and has a reputation for great food and a pleasant atmosphere for dining with friends.",
            "AUiX65HxQqwk1yvsBcbTdQ": "While it has favorable reviews, its beef selection isn’t as extensive, placing it slightly lower in the ranking.",
            "se9MhDAQjACYMO3LCIfT1Q": "This restaurant provides a decent menu but is less focused on beef offerings compared to others above it.",
            "_TqUO2XaxLQ9i_z3RM8puQ": "Although it has some appealing dishes, it lacks the strong emphasis on beef that the user prefers, resulting in a lower placement."
        }
    },
    "x_Frpa8QWc25FDJ5BJM8tg": {
        "kw": [
            "food",
            "meal",
            "table",
            "chips",
            "waiter"
        ],
        "candidate": [
            "APN05ziH92oIox8EMxcceg",
            "xbCNlp2vWixy2W1WsfGv8g",
            "xWuzWH8qYaa75REqVd9Isw",
            "EiYE3T3hfqcpcficZ4zJzQ",
            "se9MhDAQjACYMO3LCIfT1Q"
        ],
        "explanation": {
            "APN05ziH92oIox8EMxcceg": "This restaurant is known for its exceptional food and attentive waitstaff, making it ideal for the user's preferences.",
            "xbCNlp2vWixy2W1WsfGv8g": "Strong food quality and a pleasant dining experience with good service place this restaurant high on the list.",
            "xWuzWH8qYaa75REqVd9Isw": "Offers a solid meal experience but slightly lower in waiter interaction, thus positioned here.",
            "EiYE3T3hfqcpcficZ4zJzQ": "While the food is decent, the service doesn't consistently meet the expectations outlined by the user.",
            "se9MhDAQjACYMO3LCIfT1Q": "Although it has some appealing items, the overall experience, especially in service, does not align closely with user preferences."
        }
    },
    "BhYROfCjIJsKUk22_IVHig": {
        "kw": [
            "food",
            "while",
            "menu",
            "door",
            "bag"
        ],
        "candidate": [
            "5Iin0tl6QJT_TyL1BldtyA",
            "se9MhDAQjACYMO3LCIfT1Q",
            "adI5BlJCtvWq2uAwmyndXA",
            "Kcg5iMwYq5ibBuEhDXKx3Q",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "5Iin0tl6QJT_TyL1BldtyA": "This restaurant offers a diverse menu with a focus on high-quality food, appealing to the user's top preference.",
            "se9MhDAQjACYMO3LCIfT1Q": "Known for its tasty offerings and inviting atmosphere, this place ranks well for its secondary food option.",
            "adI5BlJCtvWq2uAwmyndXA": "This restaurant provides good food but less variety compared to those above.",
            "Kcg5iMwYq5ibBuEhDXKx3Q": "Though it has decent food, it lacks some of the menu options that might satisfy the user's preferences fully.",
            "563C7-HcjhZwZSl4fK-mfQ": "While it may have some appeal, it falls short in overall menu quality and depth compared to the others."
        }
    },
    "CD-cuKfj2wybw2DDQbp5Wg": {
        "kw": [
            "food",
            "menu",
            "minutes",
            "bit",
            "friend"
        ],
        "candidate": [
            "PiT0jyLL2Jwm2ODTDapOcg",
            "Q0fcX_1wvdmffqEPa246rg",
            "B9gUwTS1_Yzj2vajjC7Vmg",
            "3hjLxqqEfnBhwL6ecave_g",
            "vL44Ky9VxUtOgteyHasRIA"
        ],
        "explanation": {
            "PiT0jyLL2Jwm2ODTDapOcg": "Offers a diverse menu with excellent food quality, perfect for a satisfying meal with friends.",
            "Q0fcX_1wvdmffqEPa246rg": "Known for its quick service and flavorful dishes, making it a convenient choice for dining out.",
            "B9gUwTS1_Yzj2vajjC7Vmg": "Features a nice variety of menu options, though it may take a bit longer to prepare food.",
            "3hjLxqqEfnBhwL6ecave_g": "Provides decent food, but lacks the menu diversity needed to cater to all tastes.",
            "vL44Ky9VxUtOgteyHasRIA": "While it has a good atmosphere, the food quality does not meet the same standard as the others."
        }
    },
    "Q7fH0eiQbLyI8MDTLHU4aw": {
        "kw": [
            "food",
            "menu",
            "beef",
            "dishes",
            "edinburgh"
        ],
        "candidate": [
            "EIZnpMr9ccgutaGzGjzZ9g",
            "6MR9GZjWjLAS3s39YdDXKw",
            "utYpyFOjNisHl1h7lDGSGA",
            "AUiX65HxQqwk1yvsBcbTdQ",
            "366NwqHwhOic5pBN1DjmDQ."
        ],
        "explanation": {
            "EIZnpMr9ccgutaGzGjzZ9g": "This restaurant is known for a diverse menu that features high-quality beef dishes, which directly aligns with the user's preference.",
            "6MR9GZjWjLAS3s39YdDXKw": "Offers a good selection of beef-centric options and has received positive feedback for its menu variety.",
            "utYpyFOjNisHl1h7lDGSGA": "While it has decent menu options, it doesn't focus specifically on beef, hence it is placed lower.",
            "AUiX65HxQqwk1yvsBcbTdQ": "This restaurant has a solid reputation but lacks the specific beef dishes that the user prefers.",
            "366NwqHwhOic5pBN1DjmDQ": "Although it offers good food, it doesn't specialize in beef, making it less relevant to the user's criteria."
        }
    },
    "J7Hl7OCQcFjmUerZhcwxOw": {
        "kw": [
            "food",
            "bit",
            "way",
            "edinburgh",
            "place"
        ],
        "candidate": [
            "cgEzHZQKhi2anXfyF75MQw",
            "I1j1kEbQ5BliKsjzl5etVA",
            "hz0ldhBHu5M4ri9M_mkOdQ",
            "563C7-HcjhZwZSl4fK-mfQ",
            "s7TMkWF36dwwD8R3TKsJqw"
        ],
        "explanation": {
            "cgEzHZQKhi2anXfyF75MQw": "This restaurant excels in food quality and offers a unique culinary experience that resonates with the user's preference for good food.",
            "I1j1kEbQ5BliKsjzl5etVA": "Known for its inviting atmosphere and delicious menu options, it’s a great fit for those looking to enjoy a meal in Edinburgh.",
            "hz0ldhBHu5M4ri9M_mkOdQ": "Offers a solid dining experience with balanced flavors but slightly less renowned than the top two.",
            "563C7-HcjhZwZSl4fK-mfQ": "While this restaurant has decent offerings, it lacks the same level of culinary distinction as the higher-ranked options.",
            "s7TMkWF36dwwD8R3TKsJqw": "This place is more casual and may not meet the user's preferences for a superior dining experience focused on food quality."
        }
    },
    "zjj6fK65LRB4WNlE8Qt3lg": {
        "kw": [
            "food",
            "quality",
            "restaurant",
            "edinburgh",
            "tea"
        ],
        "candidate": [
            "adI5BlJCtvWq2uAwmyndXA",
            "2vOHS-_p5ylEf0BGR1dO9w",
            "FMoKoSHgitwnt_iMWm31nQ",
            "563C7-HcjhZwZSl4fK-mfQ",
            "xOZ7bkrttSIGS4NZm49w5Q"
        ],
        "explanation": {
            "adI5BlJCtvWq2uAwmyndXA": "Known for its exceptional food quality and a great selection of teas, making it a top choice for the user.",
            "2vOHS-_p5ylEf0BGR1dO9w": "Offers a quality dining experience with notable tea options, suitable for the user's preferences.",
            "FMoKoSHgitwnt_iMWm31nQ": "A solid restaurant with good food but slight lower emphasis on tea compared to the top two.",
            "563C7-HcjhZwZSl4fK-mfQ": "While it has good food, its tea selection is less impressive than the higher-ranked options.",
            "xOZ7bkrttSIGS4NZm49w5Q": "Rounds out the list as it does not focus heavily on either food quality or tea offerings that align with user preferences."
        }
    },
    "W1vp1LjV8rkCOIYFCAACdg": {
        "kw": [
            "food",
            "minutes",
            "friend",
            "quality",
            "restaurant"
        ],
        "candidate": [
            "B9gUwTS1_Yzj2vajjC7Vmg",
            "sH-11zOhWubXobEeuMo2gg",
            "xOZ7bkrttSIGS4NZm49w5Q",
            "PiT0jyLL2Jwm2ODTDapOcg"
        ],
        "explanation": {
            "B9gUwTS1_Yzj2vajjC7Vmg": "Known for its exceptional quality and variety of dishes, making it perfect for sharing among friends.",
            "sH-11zOhWubXobEeuMo2gg": "Offers a good balance of quality food and a vibrant atmosphere, ideal for enjoying with friends.",
            "xOZ7bkrttSIGS4NZm49w5Q": "Although slightly less appealing in quality, it provides a quick dining option that still maintains decent food standards.",
            "PiT0jyLL2Jwm2ODTDapOcg": "While it has its strengths, the overall quality to dining experience ratio doesn't match the others."
        }
    },
    "c17s5z5V4_ppX4w6TZdFDg": {
        "kw": [
            "food",
            "price",
            "rice",
            "soup",
            "taste"
        ],
        "candidate": [
            "Vtahv3Af90H3fUuEEhPhdQ",
            "hJNjKc4sKgWG__KitlJ1ag",
            "F3xksTtZUfanOcLQqJn0eQ",
            "Q0fcX_1wvdmffqEPa246rg"
        ],
        "explanation": {
            "Vtahv3Af90H3fUuEEhPhdQ": "This restaurant is known for its excellent rice dishes and affordable prices, aligning well with the preferences.",
            "hJNjKc4sKgWG__KitlJ1ag": "Offers a variety of flavorful soups and tasty options, making it a strong contender for the user.",
            "F3xksTtZUfanOcLQqJn0eQ": "While it has decent food, its prices are higher, which may not align as well with the user's need for value.",
            "Q0fcX_1wvdmffqEPa246rg": "This restaurant has limited options for rice and soup, which are key preferences, resulting in its lower placement."
        }
    },
    "cqecqnFK2eu88VtKJLHpiA": {
        "kw": [
            "food",
            "door",
            "minutes",
            "bit",
            "friend"
        ],
        "candidate": [
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "KMlY-L1oAL3qMQnwQCJPhQ",
            "S1eha-aT5c7WMk7lDLsW0A",
            "vL44Ky9VxUtOgteyHasRIA",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "E7s0QreUJ2H9r0Ls1yDeiQ": "This restaurant offers exceptional food options ideal for sharing with friends and is known for its inviting atmosphere.",
            "KMlY-L1oAL3qMQnwQCJPhQ": "Known for its robust menu and quick service, it appeals to the desire for both quality food and efficiency.",
            "S1eha-aT5c7WMk7lDLsW0A": "Provides satisfying meals that cater to a wide range of tastes and is good for casual dining with friends.",
            "vL44Ky9VxUtOgteyHasRIA": "Offers decent food and a pleasant environment but is less aligned with user preferences compared to the top options.",
            "563C7-HcjhZwZSl4fK-mfQ": "While it's a solid choice, it lacks some of the engaging social aspects and food quality that the user seems to prioritize."
        }
    },
    "l8gCfUNUdO64TtIv71UUaA": {
        "kw": [
            "food",
            "menu",
            "bit",
            "friend",
            "quality"
        ],
        "candidate": [
            "LUhVj-r2TtmFx6cyF9ilJg",
            "ZOyBVpeSQ7sYDeZa_v0MFw",
            "FMoKoSHgitwnt_iMWm31nQ",
            "wNy3CnWWAnTCfDYsZTSUPw",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "LUhVj-r2TtmFx6cyF9ilJg": "Known for its exceptional food quality and diverse menu options that cater well to friends dining together.",
            "ZOyBVpeSQ7sYDeZa_v0MFw": "Offers an impressive menu with high-quality dishes, making it a popular choice for food enthusiasts.",
            "FMoKoSHgitwnt_iMWm31nQ": "Provides a solid menu and good food quality, suitable for small groups looking for a satisfying meal.",
            "wNy3CnWWAnTCfDYsZTSUPw": "While it has a decent menu, the food quality doesn't match the higher-rated options.",
            "563C7-HcjhZwZSl4fK-mfQ": "Last due to lower food quality and limited menu compared to other choices on this list."
        }
    },
    "0tuicLSSRM8eCyVhIG5QeQ": {
        "kw": [
            "food",
            "treat",
            "edinburgh",
            "service",
            "fish"
        ],
        "candidate": [
            "Q0fcX_1wvdmffqEPa246rg",
            "563C7-HcjhZwZSl4fK-mfQ",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "xWuzWH8qYaa75REqVd9Isw"
        ],
        "explanation": {
            "Q0fcX_1wvdmffqEPa246rg": "This restaurant is highly praised for its fresh fish options and outstanding customer service, making it a top choice for the user.",
            "563C7-HcjhZwZSl4fK-mfQ": "Known for its delicious seafood dishes, this place also emphasizes a great dining experience and treats.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "While it has good food offerings, its focus on other cuisines can detract slightly from the fish preference.",
            "xWuzWH8qYaa75REqVd9Isw": "Although this restaurant is decent, it does not specialize in fish and might not offer the satisfying experience the user seeks."
        }
    },
    "LZr86Mk7R8dxkh2Jo2NGWw": {
        "kw": [
            "food",
            "rice",
            "service",
            "atmosphere",
            "try"
        ],
        "candidate": [
            "8PmbCVEjWGPouD1Tst6FsQ",
            "vL44Ky9VxUtOgteyHasRIA",
            "LUhVj-r2TtmFx6cyF9ilJg",
            "W-kOZ946xRWBJZvxXhJ7DA",
            "cgEzHZQKhi2anXfyF75MQw"
        ],
        "explanation": {
            "8PmbCVEjWGPouD1Tst6FsQ": "This restaurant is renowned for its exceptional rice dishes and attentive service, providing an inviting atmosphere for diners.",
            "vL44Ky9VxUtOgteyHasRIA": "Known for its vibrant atmosphere and diverse menu options, this place offers delicious food that highlights rice as a staple, along with good service.",
            "LUhVj-r2TtmFx6cyF9ilJg": "Offers a cozy ambiance and well-prepared rice dishes, making it a solid choice for those who prioritize comfort and quality of food.",
            "W-kOZ946xRWBJZvxXhJ7DA": "While it has good food and a moderate atmosphere, it does not stand out in terms of service compared to the top-rated options.",
            "cgEzHZQKhi2anXfyF75MQw": "This restaurant falls short in the user’s key areas, providing average service and atmosphere, leading to a lower placement in the ranking."
        }
    },
    "4YH_x__cYF_y8QtaQcYYFg": {
        "kw": [
            "food",
            "menu",
            "door",
            "minutes",
            "price"
        ],
        "candidate": [
            "2HMvoTz_hw0noLzBWmyxcA",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "yYh6t6a_0LGLVS_MNYEHsQ",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "VecnSuJm8sD83LWJ_KqAtg"
        ],
        "explanation": {
            "2HMvoTz_hw0noLzBWmyxcA": "This restaurant offers high-quality food and a diverse menu that aligns with the user's preferences.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Known for its competitive pricing and good food, it provides a solid experience without breaking the bank.",
            "yYh6t6a_0LGLVS_MNYEHsQ": "A bit less favorable in food quality than the top options, but still a good choice with reasonable wait times.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "While it has decent food, its menu options are limited, which may not fully satisfy the user's desire for variety.",
            "VecnSuJm8sD83LWJ_KqAtg": "This restaurant is pricier and has longer wait times, making it the least favored option in this ranking."
        }
    },
    "1s_F5PS7L8Azn50w860O7w": {
        "kw": [
            "food",
            "menu",
            "bit",
            "wait",
            "meal"
        ],
        "candidate": [
            "nbJXmGpdCxiBnovBkBtWcA",
            "Q0fcX_1wvdmffqEPa246rg",
            "zc_ptb03jQiXnWGwmpAk0A",
            "BmrVL3Aj5usPfpu5DE1iCg",
            "hJNjKc4sKgWG__KitlJ1ag."
        ],
        "explanation": {
            "nbJXmGpdCxiBnovBkBtWcA": "This restaurant offers an extensive menu with high-quality food, making it the top choice.",
            "Q0fcX_1wvdmffqEPa246rg": "Known for its flavorful dishes and reasonable wait times, it ranks highly for meal satisfaction.",
            "zc_ptb03jQiXnWGwmpAk0A": "While the food is good, the menu is more limited compared to the top two options, placing it here.",
            "BmrVL3Aj5usPfpu5DE1iCg": "Although it offers decent food, the longer wait times affect its ranking negatively.",
            "hJNjKc4sKgWG__KitlJ1ag": "This option lags in both menu variety and food quality, making it the least favorable choice."
        }
    },
    "0sGiC_VQubXxFEkg-OLqyw": {
        "kw": [
            "food",
            "menu",
            "restaurant",
            "part",
            "dishes"
        ],
        "candidate": [
            "ZOyBVpeSQ7sYDeZa_v0MFw",
            "csbBCysrsifg8N10c0eHCA",
            "pM4mWLjeaZJlcdUxut2lMg",
            "nusoG27oU24aEZVNvF1QqA"
        ],
        "explanation": {
            "ZOyBVpeSQ7sYDeZa_v0MFw": "This restaurant provides an extensive menu with innovative dishes that cater to various tastes.",
            "csbBCysrsifg8N10c0eHCA": "Known for its quality food and a well-curated selection of menu items, this restaurant appeals to those seeking culinary variety.",
            "pM4mWLjeaZJlcdUxut2lMg": "Offers a decent variety of dishes, making it a good option though slightly less diverse than the top two.",
            "nusoG27oU24aEZVNvF1QqA": "While still a good choice, it has a more limited menu compared to the others, resulting in the lowest ranking."
        }
    },
    "x_B6HetResuFzznXnVyEog": {
        "kw": [
            "food",
            "minutes",
            "good quality",
            "quality",
            "soup"
        ],
        "candidate": [
            "QMySP-qHdwQNZY0gDba0ng",
            "3hjLxqqEfnBhwL6ecave_g",
            "rvOvog5Utw3VXBwiSCAl0A",
            "hJNjKc4sKgWG__KitlJ1ag",
            "2HMvoTz_hw0noLzBWmyxcA"
        ],
        "explanation": {
            "QMySP-qHdwQNZY0gDba0ng": "Known for its excellent soup quality and overall fine dining experience.",
            "3hjLxqqEfnBhwL6ecave_g": "Offers a variety of soups and has a reputation for good food quality.",
            "rvOvog5Utw3VXBwiSCAl0A": "While it has decent quality, it focuses less on soups compared to the top two.",
            "hJNjKc4sKgWG__KitlJ1ag": "Good food quality but limited soup options, placing it lower in the ranking.",
            "2HMvoTz_hw0noLzBWmyxcA": "Though it has decent food, its overall offerings do not align as closely with the preferences for good soup."
        }
    },
    "NV0u95G-WcjZRAfCX-jcWw": {
        "kw": [
            "food",
            "menu",
            "friend",
            "meal",
            "decor"
        ],
        "candidate": [
            "cgEzHZQKhi2anXfyF75MQw",
            "V8vKFvdrvhTrQrt-rxKrPA",
            "xWuzWH8qYaa75REqVd9Isw",
            "6MR9GZjWjLAS3s39YdDXKw"
        ],
        "explanation": {
            "cgEzHZQKhi2anXfyF75MQw": "This restaurant offers a diverse menu and a vibrant decor, making it perfect for a meal with friends.",
            "V8vKFvdrvhTrQrt-rxKrPA": "Known for its excellent food quality and nice ambiance, it’s a strong contender for enjoyable dining.",
            "xWuzWH8qYaa75REqVd9Isw": "Good food and a pleasing environment place it ahead of the last option, though it lacks menu diversity.",
            "6MR9GZjWjLAS3s39YdDXKw": "While it has decent meal options, it scores lower on food quality and decor, making it less attractive for group meals."
        }
    },
    "0S2KCUzFvnWvlRWaDMz7Ng": {
        "kw": [
            "food",
            "menu",
            "minutes",
            "meal",
            "treat"
        ],
        "candidate": [
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "KL1oif2ocGH2dJ4w-oT_Mg",
            "xbCNlp2vWixy2W1WsfGv8g",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "Q0fcX_1wvdmffqEPa246rg"
        ],
        "explanation": {
            "E7s0QreUJ2H9r0Ls1yDeiQ": "This restaurant offers a diverse menu and high-quality food, making it a top choice for the user.",
            "KL1oif2ocGH2dJ4w-oT_Mg": "Offers a good menu with decent meal options, suitable for various dining preferences.",
            "xbCNlp2vWixy2W1WsfGv8g": "A solid place for food, though slightly less varied than the top options.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Provides good food but lacks in menu diversity to fully satisfy the user's preferences.",
            "Q0fcX_1wvdmffqEPa246rg": "While a decent option, it ranks lowest due to limited menu appeal compared to others."
        }
    },
    "wK7unWb9i25ekCP37sWtfQ": {
        "kw": [
            "food",
            "menu",
            "meal",
            "standard",
            "quality"
        ],
        "candidate": [
            "kYDkMGQEuQIeSOGZHHjIxA",
            "E8PkjCmDnDE7_2rYf38lRA",
            "vL44Ky9VxUtOgteyHasRIA",
            "cgEzHZQKhi2anXfyF75MQw",
            "6MR9GZjWjLAS3s39YdDXKw"
        ],
        "explanation": {
            "kYDkMGQEuQIeSOGZHHjIxA": "This restaurant offers a high-quality menu with a wide selection of dishes that appeal to gourmet tastes.",
            "E8PkjCmDnDE7_2rYf38lRA": "Known for its consistent standards and quality ingredients, this venue provides a satisfying dining experience.",
            "vL44Ky9VxUtOgteyHasRIA": "Offers a decent menu but slightly less variety than the top two rankings, though still maintains good quality.",
            "cgEzHZQKhi2anXfyF75MQw": "While respectable in quality, it lacks the diverse meal options that enhance the dining experience compared to higher-ranked restaurants.",
            "6MR9GZjWjLAS3s39YdDXKw": "This restaurant is placed last as it offers limited menu items and lower overall quality compared to the others."
        }
    },
    "7aPagLrqA9U1lXluIMP65g": {
        "kw": [
            "food",
            "menu",
            "cocktails",
            "service",
            "lunch"
        ],
        "candidate": [
            "e8ohWYW8rbOZWZ4pojU4zQ",
            "WUAe0FGaLRCremEDXqNV4A",
            "xWuzWH8qYaa75REqVd9Isw",
            "z57omnqRcAODGwbwMHEIyw",
            "563C7-HcjhZwZSl4fK-mfQ."
        ],
        "explanation": {
            "e8ohWYW8rbOZWZ4pojU4zQ": "Offers an excellent food menu and innovative cocktails suitable for lunch, with exceptional service.",
            "WUAe0FGaLRCremEDXqNV4A": "Known for its diverse menu and high-quality ingredients, making it a top choice for lunch.",
            "xWuzWH8qYaa75REqVd9Isw": "While not as strong in cocktails, it compensates with good food and decent service.",
            "z57omnqRcAODGwbwMHEIyw": "Provides a respectable menu and service but lacks the cocktail selection desired for lunch outings.",
            "563C7-HcjhZwZSl4fK-mfQ": "Has lower ratings in food variety and service quality, placing it last in this ranking for the user's preferences."
        }
    },
    "jCMdF94UyMHEi6iv8ys-gg": {
        "kw": [
            "food",
            "door",
            "minutes",
            "good quality",
            "bit"
        ],
        "candidate": [
            "z57omnqRcAODGwbwMHEIyw",
            "563C7-HcjhZwZSl4fK-mfQ",
            "vL44Ky9VxUtOgteyHasRIA",
            "hJNjKc4sKgWG__KitlJ1ag",
            "KMlY-L1oAL3qMQnwQCJPhQ."
        ],
        "explanation": {
            "z57omnqRcAODGwbwMHEIyw": "This restaurant is known for its high-quality food and efficient delivery service, aligning perfectly with the user's priorities.",
            "563C7-HcjhZwZSl4fK-mfQ": "Offers decent quality food and a reliable delivery time, making it a good alternative.",
            "vL44Ky9VxUtOgteyHasRIA": "Provides quality food but with slightly longer delivery times, placing it in the middle.",
            "hJNjKc4sKgWG__KitlJ1ag": "The quality is acceptable, but the delivery is slower, which is less favorable for the user.",
            "KMlY-L1oAL3qMQnwQCJPhQ": "Ranked last due to inconsistent food quality and longer wait times for delivery."
        }
    },
    "avbAP7ZQpDUgNcDywZtCsg": {
        "kw": [
            "food",
            "taste",
            "chips",
            "town",
            "royal mile"
        ],
        "candidate": [
            "z57omnqRcAODGwbwMHEIyw",
            "_jNe_vwxiEh0G9JRZByc0w",
            "se9MhDAQjACYMO3LCIfT1Q",
            "l_tk3iLmyKfBUCK-6nBbHg",
            "Q0fcX_1wvdmffqEPa246rg"
        ],
        "explanation": {
            "z57omnqRcAODGwbwMHEIyw": "This restaurant is known for its exceptional food and flavor, making it a top choice for taste enthusiasts.",
            "_jNe_vwxiEh0G9JRZByc0w": "This establishment offers a great selection of chips and is conveniently located near the Royal Mile, emphasizing local dining.",
            "se9MhDAQjACYMO3LCIfT1Q": "This place has good food and is reasonably close, but it doesn't rank as high due to less focus on taste and chips.",
            "l_tk3iLmyKfBUCK-6nBbHg": "While decent, this restaurant falls short in terms of taste and proximity to the desired area.",
            "Q0fcX_1wvdmffqEPa246rg": "Despite being a known venue, it lacks the quality taste and doesn't align well with the user's preference for chips and Royal Mile."
        }
    },
    "4A0Fjisy8aO4ObsKMBdKhQ": {
        "kw": [
            "food",
            "menu",
            "quality",
            "rice",
            "restaurant"
        ],
        "candidate": [
            "hJNjKc4sKgWG__KitlJ1ag",
            "22nkIQ4BeSYwsyaPOczOeA",
            "8PmbCVEjWGPouD1Tst6FsQ",
            "vL44Ky9VxUtOgteyHasRIA",
            "adI5BlJCtvWq2uAwmyndXA"
        ],
        "explanation": {
            "hJNjKc4sKgWG__KitlJ1ag": "Known for its high-quality dishes and diverse rice options, making it a top choice for the user's preferences.",
            "22nkIQ4BeSYwsyaPOczOeA": "Offers a good variety of rice-based dishes and maintains a high standard of food quality.",
            "8PmbCVEjWGPouD1Tst6FsQ": "While the food is enjoyable, it doesn't focus as heavily on rice options compared to the top two.",
            "vL44Ky9VxUtOgteyHasRIA": "Provides decent food quality but has fewer rice selections, placing it lower on the list.",
            "adI5BlJCtvWq2uAwmyndXA": "The menu is limited in variety and does not meet the user’s preference for rice dishes."
        }
    },
    "PW50KG6menpoHdKeYLAvTg": {
        "kw": [
            "food",
            "edinburgh",
            "place",
            "day",
            "group"
        ],
        "candidate": [
            "YST4gp2ecFtyUpRAFNZ_HQ",
            "KMlY-L1oAL3qMQnwQCJPhQ",
            "563C7-HcjhZwZSl4fK-mfQ",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "_jNe_vwxiEh0G9JRZByc0w"
        ],
        "explanation": {
            "YST4gp2ecFtyUpRAFNZ_HQ": "This restaurant offers a vibrant atmosphere and a menu well-suited for group dining, making it an ideal choice for your gathering.",
            "KMlY-L1oAL3qMQnwQCJPhQ": "Known for its excellent food and accommodating staff, this venue is popular for larger groups.",
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant has a diverse menu that's perfect for various palates in a group setting.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "While it has great offerings, it may not be as accommodating for larger groups compared to the above options.",
            "_jNe_vwxiEh0G9JRZByc0w": "This place is ranked lower due to limited group seating and its menu not being as versatile for different tastes."
        }
    },
    "3uugj6C_tFdRa8SmVevJFA": {
        "kw": [
            "food",
            "door",
            "fried rice",
            "bag",
            "beef"
        ],
        "candidate": [
            "W-kOZ946xRWBJZvxXhJ7DA",
            "8PmbCVEjWGPouD1Tst6FsQ",
            "Kcg5iMwYq5ibBuEhDXKx3Q",
            "ZOyBVpeSQ7sYDeZa_v0MFw",
            "vL44Ky9VxUtOgteyHasRIA"
        ],
        "explanation": {
            "W-kOZ946xRWBJZvxXhJ7DA": "This restaurant specializes in fried rice and has a great beef dish on the menu, making it ideal for the user's preferences.",
            "8PmbCVEjWGPouD1Tst6FsQ": "Known for its quick delivery and variety of beef dishes, this place also offers decent fried rice options.",
            "Kcg5iMwYq5ibBuEhDXKx3Q": "Although it serves good food, it doesn't specialize in fried rice or beef as much as the top two restaurants.",
            "ZOyBVpeSQ7sYDeZa_v0MFw": "This restaurant may offer some fried rice options, but they are less recognized for their beef dishes.",
            "vL44Ky9VxUtOgteyHasRIA": "This place falls short on the beef and fried rice offerings compared to others in this list."
        }
    },
    "yRm9czxWwbiJA-rtRAigcA": {
        "kw": [
            "food",
            "menu",
            "decor",
            "cocktails",
            "place"
        ],
        "candidate": [
            "563C7-HcjhZwZSl4fK-mfQ",
            "z57omnqRcAODGwbwMHEIyw",
            "Sqwa2aNwnqCmc95gVWQ9bA",
            "6MR9GZjWjLAS3s39YdDXKw"
        ],
        "explanation": {
            "563C7-HcjhZwZSl4fK-mfQ": "Known for its exceptional food quality and well-curated menu, making it a top choice for food enthusiasts.",
            "z57omnqRcAODGwbwMHEIyw": "Offers a pleasant decor and a good selection of cocktails, enhancing the dining experience.",
            "Sqwa2aNwnqCmc95gVWQ9bA": "Balanced value for its food and atmosphere, but slightly less impressive in cocktails compared to the top two.",
            "6MR9GZjWjLAS3s39YdDXKw": "While the food is good, the menu and cocktail options are not as strong, placing it last in this ranking."
        }
    },
    "EWNjX2eqSWi5xHZ-iRR7QA": {
        "kw": [
            "food",
            "menu",
            "meal",
            "chance",
            "decor"
        ],
        "candidate": [
            "nbJXmGpdCxiBnovBkBtWcA",
            "Iexv0Un2MfGEjHk8ejL8Ww",
            "GS06uO84yKQpa7oezgVZgQ",
            "8axxI33rUyswfRk_v3vS0A",
            "nJdNzQ5Z278gTCFJ4HQBLA"
        ],
        "explanation": {
            "nbJXmGpdCxiBnovBkBtWcA": "This restaurant offers an exceptional menu with diverse food options, making it the top choice for the user's dining preferences.",
            "Iexv0Un2MfGEjHk8ejL8Ww": "Known for its unique meal experiences and pleasant decor, it ranks second for the atmosphere and food quality.",
            "GS06uO84yKQpa7oezgVZgQ": "Although it has a good menu, the food quality is slightly less consistent compared to the top two, placing it in third.",
            "8axxI33rUyswfRk_v3vS0A": "This restaurant has decent decor but lacks the innovative meal options that the user is looking for.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Placed last due to lower ratings in both food quality and decor, not meeting the user's high standards."
        }
    },
    "E68ZPVpcuWhxvnjq8vTqAA": {
        "kw": [
            "food",
            "meal",
            "price",
            "quality",
            "taste"
        ],
        "candidate": [
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "z57omnqRcAODGwbwMHEIyw",
            "W-kOZ946xRWBJZvxXhJ7DA",
            "22nkIQ4BeSYwsyaPOczOeA"
        ],
        "explanation": {
            "E7s0QreUJ2H9r0Ls1yDeiQ": "This restaurant offers high-quality food at reasonable prices, making it a top choice for taste and value.",
            "z57omnqRcAODGwbwMHEIyw": "Known for its flavorful dishes, it balances quality and price well, appealing to taste preferences.",
            "W-kOZ946xRWBJZvxXhJ7DA": "While still good, it doesn't quite match the taste and quality of the top two on this list.",
            "22nkIQ4BeSYwsyaPOczOeA": "This restaurant is placed last as it does not align as closely with the user's preferences for food quality and taste."
        }
    },
    "QssDrW4xPnhnpx_nMo2Kow": {
        "kw": [
            "food",
            "restaurant",
            "place",
            "tomato",
            "service"
        ],
        "candidate": [
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "B9gUwTS1_Yzj2vajjC7Vmg",
            "563C7-HcjhZwZSl4fK-mfQ",
            "se9MhDAQjACYMO3LCIfT1Q",
            "Q0fcX_1wvdmffqEPa246rg"
        ],
        "explanation": {
            "nJdNzQ5Z278gTCFJ4HQBLA": "Known for its exceptional tomato-based dishes and outstanding service, making it a perfect match for the user's preferences.",
            "B9gUwTS1_Yzj2vajjC7Vmg": "Offers a variety of fresh and flavorful food options, with a particular emphasis on their tomato specialties and attentive service.",
            "563C7-HcjhZwZSl4fK-mfQ": "While good, it does not excel in tomato dishes compared to the top choices, but still maintains decent service.",
            "se9MhDAQjACYMO3LCIfT1Q": "A solid option, though primarily known for other cuisines rather than tomato-focused dishes.",
            "Q0fcX_1wvdmffqEPa246rg": "Ranked lowest due to a lack of emphasis on food quality and service in comparison to the other eateries."
        }
    },
    "M-RKuwyjIsgY-w9TGLKNSA": {
        "kw": [
            "food",
            "menu",
            "bit",
            "price",
            "quality"
        ],
        "candidate": [
            "nbF7bEjx_4lQJ3t6aVqFjA",
            "LUhVj-r2TtmFx6cyF9ilJg",
            "2HMvoTz_hw0noLzBWmyxcA",
            "8Haoz9Mil7ZnHGU48sgBtw"
        ],
        "explanation": {
            "nbF7bEjx_4lQJ3t6aVqFjA": "Offers a diverse menu with high-quality ingredients and good value for the price.",
            "LUhVj-r2TtmFx6cyF9ilJg": "Features quality dishes at a reasonable price but with a slightly less diverse menu compared to the top choice.",
            "2HMvoTz_hw0noLzBWmyxcA": "Provides decent food quality and options but is less competitively priced than the top two.",
            "8Haoz9Mil7ZnHGU48sgBtw": "While it has good food, it lacks in price and menu variety, placing it at the bottom of the ranking."
        }
    },
    "N0udGqfu8uh4Pa8OaV2ozQ": {
        "kw": [
            "food",
            "quality",
            "restaurant",
            "way",
            "edinburgh"
        ],
        "candidate": [
            "hJNjKc4sKgWG__KitlJ1ag",
            "xlHRYejgZj-iTm-QPhc8zQ",
            "Q0fcX_1wvdmffqEPa246rg",
            "cgEzHZQKhi2anXfyF75MQw"
        ],
        "explanation": {
            "hJNjKc4sKgWG__KitlJ1ag": "This restaurant is renowned for its top-tier culinary offerings and local ingredients, making it a favorite for food enthusiasts in Edinburgh.",
            "xlHRYejgZj-iTm-QPhc8zQ": "Known for a creative menu and commitment to quality, this restaurant provides a unique dining experience that aligns with the user's emphasis on food quality.",
            "Q0fcX_1wvdmffqEPa246rg": "While offering decent food, it sits below the top two due to slightly less innovative cuisine.",
            "cgEzHZQKhi2anXfyF75MQw": "Though popular, it tends to cater more to a casual dining experience rather than focusing strictly on high-quality food."
        }
    },
    "xYmJTCC4GowUQRsn-q0ZvA": {
        "kw": [
            "food",
            "menu",
            "bit",
            "decor",
            "taste"
        ],
        "candidate": [
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "3hjLxqqEfnBhwL6ecave_g",
            "se9MhDAQjACYMO3LCIfT1Q",
            "yF_fqO9cUUEyaIWhb-iOQQ",
            "xWuzWH8qYaa75REqVd9Isw"
        ],
        "explanation": {
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Offers a diverse menu with high-quality food and a pleasing decor that enhances the overall dining experience.",
            "3hjLxqqEfnBhwL6ecave_g": "Known for its delicious taste and unique dishes, making it a favorite among those who value menu variety.",
            "se9MhDAQjACYMO3LCIfT1Q": "Provides good food but has slightly less variety compared to the top two, though it still maintains a pleasant atmosphere.",
            "yF_fqO9cUUEyaIWhb-iOQQ": "While it has decent food quality, the decor and overall ambiance may not appeal as much as others in the top spots.",
            "xWuzWH8qYaa75REqVd9Isw": "The taste is average, and the overall dining experience lacks the appealing elements that rank higher on this list."
        }
    },
    "N2bEXLOeKlYcaObv6UwmeQ": {
        "kw": [
            "food",
            "friend",
            "quality",
            "table",
            "group"
        ],
        "candidate": [
            "g_fGPZJlGeKGLgC-j-tj6w",
            "EiYE3T3hfqcpcficZ4zJzQ",
            "hJNjKc4sKgWG__KitlJ1ag",
            "u9iy3hyA9HpETKi9qns__A",
            "e8ohWYW8rbOZWZ4pojU4zQ"
        ],
        "explanation": {
            "g_fGPZJlGeKGLgC-j-tj6w": "This restaurant is known for its high-quality food and has good seating arrangements for groups.",
            "EiYE3T3hfqcpcficZ4zJzQ": "Offers excellent food options and is popular among friends, perfect for group settings.",
            "hJNjKc4sKgWG__KitlJ1ag": "Known for decent quality food but slightly less accommodating for larger tables than the top two.",
            "u9iy3hyA9HpETKi9qns__A": "While it has good food, it is less suitable for larger gatherings compared to others in the list.",
            "e8ohWYW8rbOZWZ4pojU4zQ": "This restaurant is the least recommended due to lesser food quality and not being ideal for groups."
        }
    },
    "SqVspkn4ivOfeBYgk-EIKA": {
        "kw": [
            "food",
            "menu",
            "minutes",
            "place",
            "desperation"
        ],
        "candidate": [
            "XarxHcmxyjvhzoROMTLyMg",
            "csbBCysrsifg8N10c0eHCA",
            "EKEPtNKJdZxRhYoFhuG8ew",
            "zc_ptb03jQiXnWGwmpAk0A"
        ],
        "explanation": {
            "XarxHcmxyjvhzoROMTLyMg": "This restaurant offers a diverse menu that caters to various tastes, making it a great choice for food enthusiasts.",
            "csbBCysrsifg8N10c0eHCA": "Known for its quick service and delicious dishes, it ranks high for those with time constraints and a craving for good food.",
            "EKEPtNKJdZxRhYoFhuG8ew": "While still good, its menu is less varied compared to the top two, appealing more to specific tastes.",
            "zc_ptb03jQiXnWGwmpAk0A": "This spot, while decent, falls short in food quality and menu variety compared to the rest of the ranking."
        }
    },
    "3c57DbE5YVzaBqJzXTixcA": {
        "kw": [
            "food",
            "door",
            "beef",
            "bit",
            "restaurant"
        ],
        "candidate": [
            "WUAe0FGaLRCremEDXqNV4A",
            "z57omnqRcAODGwbwMHEIyw",
            "563C7-HcjhZwZSl4fK-mfQ",
            "W-kOZ946xRWBJZvxXhJ7DA"
        ],
        "explanation": {
            "WUAe0FGaLRCremEDXqNV4A": "This restaurant is well-known for its high-quality beef dishes, making it the top choice for the user's preference.",
            "z57omnqRcAODGwbwMHEIyw": "It offers a variety of beef options and is highly rated for its food quality, justifying its second place.",
            "563C7-HcjhZwZSl4fK-mfQ": "Although it has good reviews, its beef offerings are more limited compared to the top two, placing it lower.",
            "W-kOZ946xRWBJZvxXhJ7DA": "While it provides decent menu options, it lacks a strong focus on beef, which is a key preference for the user."
        }
    },
    "oy9owJElDBGC5kRZQmGxrw": {
        "kw": [
            "food",
            "menu",
            "friend",
            "meal",
            "restaurant"
        ],
        "candidate": [
            "V8vKFvdrvhTrQrt-rxKrPA",
            "b8-lt7cnQpcvHM6Qre-WZA",
            "563C7-HcjhZwZSl4fK-mfQ",
            "gqsU03i-WiyYHcBCdwObuQ"
        ],
        "explanation": {
            "V8vKFvdrvhTrQrt-rxKrPA": "This restaurant offers a varied menu that's well-suited for sharing among friends during a meal.",
            "b8-lt7cnQpcvHM6Qre-WZA": "The vibrant dining atmosphere makes it an excellent choice for social gatherings, complemented by a diverse selection of dishes.",
            "563C7-HcjhZwZSl4fK-mfQ": "While it has good food, the menu is more limited compared to the top two options, making it less ideal for a group setting.",
            "gqsU03i-WiyYHcBCdwObuQ": "This place has a great meal experience but may not cater as well to a varied menu that accommodates group preferences."
        }
    },
    "23BfvNiCUERIKFu3w7ljUg": {
        "kw": [
            "food",
            "bit",
            "meal",
            "price",
            "decor"
        ],
        "candidate": [
            "yF_fqO9cUUEyaIWhb-iOQQ",
            "6MR9GZjWjLAS3s39YdDXKw",
            "AUiX65HxQqwk1yvsBcbTdQ",
            "BmrVL3Aj5usPfpu5DE1iCg",
            "zc_ptb03jQiXnWGwmpAk0A"
        ],
        "explanation": {
            "yF_fqO9cUUEyaIWhb-iOQQ": "This restaurant offers high-quality food that is well-presented and has a great atmosphere, making it a favorite for meal satisfaction.",
            "6MR9GZjWjLAS3s39YdDXKw": "Known for its delicious meal options, this spot balances good food with reasonable prices, ensuring value for customers.",
            "AUiX65HxQqwk1yvsBcbTdQ": "While the food is good, the price might be on the higher side, affecting overall score even with a pleasant decor.",
            "BmrVL3Aj5usPfpu5DE1iCg": "This restaurant has decent food but lacks in decor, and the pricing does not reflect the experience adequately.",
            "zc_ptb03jQiXnWGwmpAk0A": "Although popular, this place compromises on meal consistency and decor, resulting in a lower rank."
        }
    },
    "iZE1J4HZ7CQdiL76w6vsJw": {
        "kw": [
            "food",
            "restaurant",
            "edinburgh",
            "place",
            "service"
        ],
        "candidate": [
            "N8hUGYmf0jEO9eDzmYHuAw",
            "FMoKoSHgitwnt_iMWm31nQ",
            "I1j1kEbQ5BliKsjzl5etVA",
            "xOZ7bkrttSIGS4NZm49w5Q",
            "l_tk3iLmyKfBUCK-6nBbHg"
        ],
        "explanation": {
            "N8hUGYmf0jEO9eDzmYHuAw": "Known for its exceptional food variety and outstanding service, making it a top choice.",
            "FMoKoSHgitwnt_iMWm31nQ": "Offers a fantastic dining experience with a strong emphasis on quality dishes and friendly staff.",
            "I1j1kEbQ5BliKsjzl5etVA": "Provides solid food options and decent service, appealing to a wide range of tastes.",
            "xOZ7bkrttSIGS4NZm49w5Q": "Good food but less consistent service, placing it lower in preference.",
            "l_tk3iLmyKfBUCK-6nBbHg": "While the food is satisfactory, it lacks the service quality expected, making it the least favored."
        }
    },
    "ZkWzMb9QbB5e3JerEIg4Fw": {
        "kw": [
            "food",
            "while",
            "menu",
            "range",
            "friend"
        ],
        "candidate": [
            "563C7-HcjhZwZSl4fK-mfQ",
            "FMoKoSHgitwnt_iMWm31nQ",
            "LUhVj-r2TtmFx6cyF9ilJg",
            "V0tRCjf95FTqVJvmxdeqbQ"
        ],
        "explanation": {
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant has a diverse menu that caters well to groups.",
            "FMoKoSHgitwnt_iMWm31nQ": "Offers a solid range of food options, perfect for sharing among friends.",
            "LUhVj-r2TtmFx6cyF9ilJg": "Good food quality, but slightly limited in menu variety compared to the top two.",
            "V0tRCjf95FTqVJvmxdeqbQ": "While enjoyable, it ranks lower due to a narrower menu that may not appeal as much to larger groups."
        }
    },
    "NIiI-af78NxSrdTl3mfF0w": {
        "kw": [
            "food",
            "door",
            "meal",
            "quality",
            "restaurant"
        ],
        "candidate": [
            "z57omnqRcAODGwbwMHEIyw",
            "3hjLxqqEfnBhwL6ecave_g",
            "APN05ziH92oIox8EMxcceg",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "vL44Ky9VxUtOgteyHasRIA"
        ],
        "explanation": {
            "z57omnqRcAODGwbwMHEIyw": "This restaurant is known for its exceptional food quality and diverse meal options, making it a top choice.",
            "3hjLxqqEfnBhwL6ecave_g": "It offers high-quality dishes and convenient meal delivery, appealing to user's preference for convenience.",
            "APN05ziH92oIox8EMxcceg": "A solid option with good food quality, though slightly less varied in meal choices compared to the top two.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "While the food quality is decent, it lacks some of the allure and variety found in higher-ranked options.",
            "vL44Ky9VxUtOgteyHasRIA": "This restaurant offers basic meals with consistent, but not outstanding, food quality, placing it last."
        }
    },
    "nF5jMQ2CUIiQG7U-yvFq7g": {
        "kw": [
            "food",
            "menu",
            "bit",
            "quality",
            "restaurant"
        ],
        "candidate": [
            "N1BTJaWnLsCVsJ3I41EPdg",
            "FMoKoSHgitwnt_iMWm31nQ",
            "hJNjKc4sKgWG__KitlJ1ag",
            "8PmbCVEjWGPouD1Tst6FsQ",
            "yYh6t6a_0LGLVS_MNYEHsQ"
        ],
        "explanation": {
            "N1BTJaWnLsCVsJ3I41EPdg": "Ranked highest for having a diverse menu and consistently high food quality.",
            "FMoKoSHgitwnt_iMWm31nQ": "Known for its exceptional food quality and a good selection of dishes, making it a strong second choice.",
            "hJNjKc4sKgWG__KitlJ1ag": "Offers good quality food but has a more limited menu, placing it third.",
            "8PmbCVEjWGPouD1Tst6FsQ": "While decent in quality, the restaurant's menu lacks variety, which affects its ranking.",
            "yYh6t6a_0LGLVS_MNYEHsQ": "Ranked lowest as it frequently receives lower marks for food quality and does not stand out in menu variety."
        }
    },
    "u8wr1QZT5k2maUB6_8ni-Q": {
        "kw": [
            "food",
            "price",
            "quality",
            "edinburgh",
            "place"
        ],
        "candidate": [
            "563C7-HcjhZwZSl4fK-mfQ",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "EiYE3T3hfqcpcficZ4zJzQ",
            "XahLCgicRsLPb0TSMAIQtw",
            "8axxI33rUyswfRk_v3vS0A"
        ],
        "explanation": {
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant offers a high-quality food experience at a reasonable price, making it a top choice.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Known for its excellent dishes and atmosphere, this place strikes a good balance between quality and pricing.",
            "EiYE3T3hfqcpcficZ4zJzQ": "A solid option, it has decent food and is more affordable compared to others, but it lacks the top-tier quality of those above.",
            "XahLCgicRsLPb0TSMAIQtw": "While the food is good, it is slightly more expensive without a corresponding increase in quality for the price.",
            "8axxI33rUyswfRk_v3vS0A": "Placed last due to lower food quality and higher prices relative to others in the list."
        }
    },
    "Fou1SlEsdm7ceRTAJCSK-Q": {
        "kw": [
            "food",
            "edinburgh",
            "tea",
            "day",
            "service"
        ],
        "candidate": [
            "563C7-HcjhZwZSl4fK-mfQ",
            "WUAe0FGaLRCremEDXqNV4A",
            "6MR9GZjWjLAS3s39YdDXKw",
            "xWuzWH8qYaa75REqVd9Isw",
            "aIs7Tt3pw6ymj3FOPPR4Ng"
        ],
        "explanation": {
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant excels in food quality and has a great selection of teas, making it ideal for daytime visits.",
            "WUAe0FGaLRCremEDXqNV4A": "Known for excellent service and a cozy atmosphere, it offers a wonderful menu suited for lunch or tea time.",
            "6MR9GZjWjLAS3s39YdDXKw": "While slightly lower on food ranking, it has good service and a nice tea selection, suitable for daytime outings.",
            "xWuzWH8qYaa75REqVd9Isw": "This spot is popular but does not meet as many preferences regarding tea or daytime service quality as the top ones.",
            "aIs7Tt3pw6ymj3FOPPR4Ng": "This restaurant, although ranked higher previously, lacks in the tea selection and daytime service that the user is looking for."
        }
    },
    "7N9YwddVlZtd2NQkvx3jGQ": {
        "kw": [
            "food",
            "minutes",
            "beef",
            "meal",
            "size"
        ],
        "candidate": [
            "se9MhDAQjACYMO3LCIfT1Q",
            "xjBvbDmbsA0VX-vA55SbAA",
            "WUAe0FGaLRCremEDXqNV4A",
            "36jGZp7V0jLnPCYmRipUCg",
            "z-3ZDmVbHZjDrYZE42yKZA."
        ],
        "explanation": {
            "se9MhDAQjACYMO3LCIfT1Q": "This restaurant is known for its high-quality beef dishes and generous meal sizes, making it a top choice for the user's preferences.",
            "xjBvbDmbsA0VX-vA55SbAA": "Offers a solid variety of beef meals that are satisfying in size, so it ranks closely behind the top choice.",
            "WUAe0FGaLRCremEDXqNV4A": "While it has good food, it doesn't specialize in beef as much as the previous two, thus its lower ranking.",
            "36jGZp7V0jLnPCYmRipUCg": "Provides decent meal options but is less favored in terms of beef selection and overall size.",
            "z-3ZDmVbHZjDrYZE42yKZA": "Rounds out the list as it offers limited beef options and smaller meal sizes compared to others."
        }
    },
    "RFxjYeLW_aYLdVW3PBwFNg": {
        "kw": [
            "food",
            "while",
            "menu",
            "bag",
            "beef"
        ],
        "candidate": [
            "Q0fcX_1wvdmffqEPa246rg",
            "Kcg5iMwYq5ibBuEhDXKx3Q",
            "hJNjKc4sKgWG__KitlJ1ag",
            "se9MhDAQjACYMO3LCIfT1Q",
            "563C7-HcjhZwZSl4fK-mfQ."
        ],
        "explanation": {
            "Q0fcX_1wvdmffqEPa246rg": "This restaurant has a highly praised beef menu and a solid reputation for food quality.",
            "Kcg5iMwYq5ibBuEhDXKx3Q": "Known for its diverse menu, it offers several beef dishes that are also popular among diners.",
            "hJNjKc4sKgWG__KitlJ1ag": "While it has decent food, its beef options are not as extensive as the top two choices.",
            "se9MhDAQjACYMO3LCIfT1Q": "This restaurant has a good menu but is not primarily known for its beef, placing it lower on the list.",
            "563C7-HcjhZwZSl4fK-mfQ": "Although it has decent offerings, it lacks strong beef options, making it the least favorable choice for the user’s preferences."
        }
    },
    "w_kJSxW49eAT6NdiXJEpsw": {
        "kw": [
            "food",
            "menu",
            "meal",
            "quality",
            "rice"
        ],
        "candidate": [
            "B9gUwTS1_Yzj2vajjC7Vmg",
            "FMoKoSHgitwnt_iMWm31nQ",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "LUhVj-r2TtmFx6cyF9ilJg",
            "BmrVL3Aj5usPfpu5DE1iCg"
        ],
        "explanation": {
            "B9gUwTS1_Yzj2vajjC7Vmg": "Offers a diverse and high-quality menu featuring various rice-based dishes, making it the top choice.",
            "FMoKoSHgitwnt_iMWm31nQ": "Known for its exceptional food quality with a strong rice selection, placed second for its innovative dishes.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Provides good quality meals with rice options that satisfy but lacks some variety compared to the top two.",
            "LUhVj-r2TtmFx6cyF9ilJg": "Features decent dishes, but rice is not the highlight, thus ranking lower.",
            "BmrVL3Aj5usPfpu5DE1iCg": "While it has quality food, its emphasis is less on rice, making it the least preferable based on user preferences."
        }
    },
    "HxEgQzp1ELEBXyk9v5UF2A": {
        "kw": [
            "food",
            "while",
            "friend",
            "quality",
            "rice"
        ],
        "candidate": [
            "cgEzHZQKhi2anXfyF75MQw",
            "kYDkMGQEuQIeSOGZHHjIxA",
            "2YPpmW-mpN2f6c4cFDtjPw",
            "P_q9rwxm-O-8cQ3xiswHHg",
            "u9iy3hyA9HpETKi9qns__A"
        ],
        "explanation": {
            "cgEzHZQKhi2anXfyF75MQw": "This restaurant specializes in high-quality rice dishes and frequently receives great reviews for its flavor and presentation.",
            "kYDkMGQEuQIeSOGZHHjIxA": "Known for its overall food quality, this place offers a variety of rice-based meals that cater to a range of tastes.",
            "2YPpmW-mpN2f6c4cFDtjPw": "Offers solid options for rice dishes but isn’t as frequently praised as the top two, placing it next in quality focus.",
            "P_q9rwxm-O-8cQ3xiswHHg": "While it has some good quality food, it lacks a strong emphasis on rice in its menu items.",
            "u9iy3hyA9HpETKi9qns__A": "This restaurant has lower emphasis on rice and quality compared to the others, making it least favorable according to your preferences."
        }
    },
    "KIRUItqBI5IwFB1PWqSGzA": {
        "kw": [
            "food",
            "friend",
            "restaurant",
            "goodness",
            "afternoon tea"
        ],
        "candidate": [
            "adI5BlJCtvWq2uAwmyndXA",
            "lWRbdK9YABr0auLG19FHhQ",
            "GbRN507iOJ6JOU-dixk-PQ",
            "XahLCgicRsLPb0TSMAIQtw"
        ],
        "explanation": {
            "adI5BlJCtvWq2uAwmyndXA": "Known for exceptional food quality and ambiance, making it ideal for an enjoyable afternoon tea with friends.",
            "lWRbdK9YABr0auLG19FHhQ": "Offers great food and a friendly atmosphere, suitable for social dining experiences.",
            "GbRN507iOJ6JOU-dixk-PQ": "While it serves good food, it’s not as strong on the afternoon tea concept compared to the top restaurants.",
            "XahLCgicRsLPb0TSMAIQtw": "Lacks unique afternoon tea offerings and has a more generic dining environment, placing it last."
        }
    },
    "qv6zFKA9j2_YSkZ3ImUHAw": {
        "kw": [
            "food",
            "bit",
            "quality",
            "edinburgh",
            "place"
        ],
        "candidate": [
            "S1eha-aT5c7WMk7lDLsW0A",
            "tD1veHsKELAH3b7wKmHsaw",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "2vOHS-_p5ylEf0BGR1dO9w",
            "hz0ldhBHu5M4ri9M_mkOdQ."
        ],
        "explanation": {
            "S1eha-aT5c7WMk7lDLsW0A": "Known for its high-quality dishes and excellent dining experience in Edinburgh.",
            "tD1veHsKELAH3b7wKmHsaw": "Offers a unique menu with a strong emphasis on flavor and presentation.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Has a solid reputation for quality food but slightly less focus on the overall dining environment.",
            "2vOHS-_p5ylEf0BGR1dO9w": "A good choice for food quality but lacks a distinct ambiance compared to the top restaurants.",
            "hz0ldhBHu5M4ri9M_mkOdQ": "While offering decent food, it falls short in both quality and setting compared to the others."
        }
    },
    "2CvY-N_zMLI_WOv8HogPhw": {
        "kw": [
            "food",
            "meal",
            "quality",
            "edinburgh",
            "place"
        ],
        "candidate": [
            "AUiX65HxQqwk1yvsBcbTdQ",
            "Kcg5iMwYq5ibBuEhDXKx3Q",
            "3hjLxqqEfnBhwL6ecave_g",
            "8PmbCVEjWGPouD1Tst6FsQ",
            "utYpyFOjNisHl1h7lDGSGA"
        ],
        "explanation": {
            "AUiX65HxQqwk1yvsBcbTdQ": "This restaurant is known for its high-quality ingredients and well-executed dishes, making it an excellent choice for discerning diners.",
            "Kcg5iMwYq5ibBuEhDXKx3Q": "Offers innovative meal options and is well-reviewed for its commitment to quality and fresh, local produce, appealing to food enthusiasts.",
            "3hjLxqqEfnBhwL6ecave_g": "Popular for its diverse menu crafting satisfying meals, though it slightly lags behind in quality compared to the top two.",
            "8PmbCVEjWGPouD1Tst6FsQ": "While it has some good meal options, the focus on quality is less consistent, placing it lower in the ranking.",
            "utYpyFOjNisHl1h7lDGSGA": "This restaurant, while offering reasonable meals, does not stand out in terms of quality, placing it last in this ranking."
        }
    },
    "zZtSF9uCvA4-z_-j1RiyAA": {
        "kw": [
            "food",
            "friend",
            "quality",
            "taste",
            "edinburgh"
        ],
        "candidate": [
            "sH-11zOhWubXobEeuMo2gg",
            "T3iWl33fpg4H88zUFr-dSw",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "W-kOZ946xRWBJZvxXhJ7DA",
            "6MR9GZjWjLAS3s39YdDXKw"
        ],
        "explanation": {
            "sH-11zOhWubXobEeuMo2gg": "This restaurant is known for its exceptional quality and flavors, making it a top choice for food lovers.",
            "T3iWl33fpg4H88zUFr-dSw": "Highly rated for its tasty offerings and a great atmosphere for enjoying meals with friends.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "This restaurant stands out for its authentic taste and good reviews on food quality.",
            "W-kOZ946xRWBJZvxXhJ7DA": "Although it has its merits, it does not match the high standards of food quality and taste set by the top three.",
            "6MR9GZjWjLAS3s39YdDXKw": "This option is the least favorable based on user preferences for quality and taste compared to the others listed."
        }
    },
    "4FUVYIUwdLkHrQZ17VV3Tg": {
        "kw": [
            "food",
            "menu",
            "friend",
            "price",
            "quality"
        ],
        "candidate": [
            "Kcg5iMwYq5ibBuEhDXKx3Q",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "cgEzHZQKhi2anXfyF75MQw",
            "z-3ZDmVbHZjDrYZE42yKZA"
        ],
        "explanation": {
            "Kcg5iMwYq5ibBuEhDXKx3Q": "This restaurant offers a diverse menu with high-quality food and is ideal for dining with friends.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Known for its excellent food quality and reasonable prices, it caters well to group dining.",
            "cgEzHZQKhi2anXfyF75MQw": "While the food is good, the menu variety is limited compared to the top two.",
            "z-3ZDmVbHZjDrYZE42yKZA": "Though affordable, the quality is not as high, which affects its overall appeal for food quality preference."
        }
    },
    "XFqrwk2eyELwev8aFSxvQg": {
        "kw": [
            "food",
            "price",
            "edinburgh",
            "service",
            "curries"
        ],
        "candidate": [
            "WAMesuyxdmL3SRigsxlXng",
            "3hjLxqqEfnBhwL6ecave_g",
            "aIs7Tt3pw6ymj3FOPPR4Ng",
            "zK_6fn5ZLSkW7OhRD30IBw",
            "PiT0jyLL2Jwm2ODTDapOcg"
        ],
        "explanation": {
            "WAMesuyxdmL3SRigsxlXng": "Known for its exceptional curry offerings and great service, making it a top choice for the user’s preferences.",
            "3hjLxqqEfnBhwL6ecave_g": "Offers a variety of affordable curry dishes, and maintains solid service, placing it high on the list.",
            "aIs7Tt3pw6ymj3FOPPR4Ng": "Featured for good food quality and reasonable prices, but less specialized in curries compared to the top two.",
            "zK_6fn5ZLSkW7OhRD30IBw": "While it has decent curry options, it is further down due to some service inconsistencies.",
            "PiT0jyLL2Jwm2ODTDapOcg": "Although this restaurant offers a unique dining experience, it ranks lowest due to higher prices and less focus on curries."
        }
    },
    "Ou4BjdfuERdzcRN_tMhq4Q": {
        "kw": [
            "food",
            "quality",
            "place",
            "lot",
            "selection"
        ],
        "candidate": [
            "Q0fcX_1wvdmffqEPa246rg",
            "ksP8426d2qN-mg-JDpkRVQ",
            "fNtFIQM_FKsHsyEIVk_KMQ",
            "lWRbdK9YABr0auLG19FHhQ",
            "utYpyFOjNisHl1h7lDGSGA"
        ],
        "explanation": {
            "Q0fcX_1wvdmffqEPa246rg": "This restaurant excels in food quality and has an extensive menu, making it a top choice for diverse selections.",
            "ksP8426d2qN-mg-JDpkRVQ": "Known for its high-quality dishes, this establishment offers a solid selection in a great location.",
            "fNtFIQM_FKsHsyEIVk_KMQ": "This place has a good reputation for quality food but has a slightly less extensive selection.",
            "lWRbdK9YABr0auLG19FHhQ": "While still a solid option, it has less variety compared to the top three rankings.",
            "utYpyFOjNisHl1h7lDGSGA": "This restaurant has good food but is rated lower in quality and selection compared to others in this list."
        }
    },
    "d0M3Bx5CfuCBMx4a6yFb2w": {
        "kw": [
            "food",
            "place",
            "table",
            "service",
            "street"
        ],
        "candidate": [
            "se9MhDAQjACYMO3LCIfT1Q",
            "EiYE3T3hfqcpcficZ4zJzQ",
            "S1eha-aT5c7WMk7lDLsW0A",
            "csbBCysrsifg8N10c0eHCA",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "se9MhDAQjACYMO3LCIfT1Q": "This restaurant excels in food quality and has a great ambiance, making it the top choice.",
            "EiYE3T3hfqcpcficZ4zJzQ": "Known for its excellent service and food variety, it's a solid contender for second place.",
            "S1eha-aT5c7WMk7lDLsW0A": "While it has good food, its location and atmosphere are less favorable, placing it third.",
            "csbBCysrsifg8N10c0eHCA": "This option offers decent food but lacks in service and is less appealing in terms of atmosphere.",
            "563C7-HcjhZwZSl4fK-mfQ": "Although it is decent, it did not stand out in food or service, placing it last in the ranking."
        }
    },
    "9-e6IZC7lv7zWVGr0kDBfw": {
        "kw": [
            "food",
            "hotel",
            "edinburgh",
            "place",
            "chicken"
        ],
        "candidate": [
            "IWNPEvd3o6GHi60MxnPCVQ",
            "gqsU03i-WiyYHcBCdwObuQ",
            "se9MhDAQjACYMO3LCIfT1Q",
            "pM4mWLjeaZJlcdUxut2lMg",
            "563C7-HcjhZwZSl4fK-mfQ."
        ],
        "explanation": {
            "IWNPEvd3o6GHi60MxnPCVQ": "This restaurant is renowned for its exceptional chicken dishes and a vibrant atmosphere, making it a top choice for food lovers.",
            "gqsU03i-WiyYHcBCdwObuQ": "Known for its unique offerings and delicious chicken options, this place provides a strong experience tailored to the user’s culinary preferences.",
            "se9MhDAQjACYMO3LCIfT1Q": "While good, it does not specialize in chicken as prominently as the top two, but still offers solid food choices.",
            "pM4mWLjeaZJlcdUxut2lMg": "This restaurant offers a mix of cuisines, but options for chicken may not be as robust.",
            "563C7-HcjhZwZSl4fK-mfQ": "Although a well-rated establishment, it is less focused on chicken and more on other types of dishes, making it lower on the user's preference scale."
        }
    },
    "xuQ51kpd3TKXwYwHUysRpQ": {
        "kw": [
            "food",
            "meal",
            "edinburgh",
            "place",
            "table"
        ],
        "candidate": [
            "E8PkjCmDnDE7_2rYf38lRA",
            "_TqUO2XaxLQ9i_z3RM8puQ",
            "APN05ziH92oIox8EMxcceg",
            "366NwqHwhOic5pBN1DjmDQ",
            "e8ohWYW8rbOZWZ4pojU4zQ"
        ],
        "explanation": {
            "E8PkjCmDnDE7_2rYf38lRA": "Best known for its exceptional food quality and memorable meal experiences, perfect for the user's emphasis on dining.",
            "_TqUO2XaxLQ9i_z3RM8puQ": "Offers a unique atmosphere and strong focus on culinary delight, making it ideal for the user's preferences.",
            "APN05ziH92oIox8EMxcceg": "Well-regarded in Edinburgh for its diverse menu options, contributing to meal satisfaction.",
            "366NwqHwhOic5pBN1DjmDQ": "A solid choice, though it may not stand out as much as the top three for culinary experiences.",
            "e8ohWYW8rbOZWZ4pojU4zQ": "Despite being a good restaurant, it doesn't align as closely with the user's preferences as the others in terms of food and meal focus."
        }
    },
    "Et6mwzOORak5K6kJ-yw4Xw": {
        "kw": [
            "food",
            "restaurant",
            "champagne",
            "tower",
            "perfect spot"
        ],
        "candidate": [
            "2vOHS-_p5ylEf0BGR1dO9w",
            "Q0fcX_1wvdmffqEPa246rg",
            "Jwp4UFa93ENe-0REPo5hCQ",
            "lWRbdK9YABr0auLG19FHhQ",
            "XahLCgicRsLPb0TSMAIQtw"
        ],
        "explanation": {
            "2vOHS-_p5ylEf0BGR1dO9w": "This restaurant offers a great view along with exquisite food and a notable champagne selection.",
            "Q0fcX_1wvdmffqEPa246rg": "Known for its beautifully crafted dishes and a fabulous ambiance, it is also situated in a tower, providing an excellent dining experience.",
            "Jwp4UFa93ENe-0REPo5hCQ": "Offers good food and an elegant atmosphere, although not as strong in the champagne selection as the top two.",
            "lWRbdK9YABr0auLG19FHhQ": "Provides decent food but lacks in the ambiance and champagne options compared to the top-ranking restaurants.",
            "XahLCgicRsLPb0TSMAIQtw": "Last due to a lesser focus on food quality and a less appealing setting for the user’s preferences."
        }
    },
    "YBtA8qWOVU0Jee8g_jAXEQ": {
        "kw": [
            "food",
            "place",
            "service",
            "fish",
            "great food"
        ],
        "candidate": [
            "cgEzHZQKhi2anXfyF75MQw",
            "csbBCysrsifg8N10c0eHCA",
            "xWuzWH8qYaa75REqVd9Isw",
            "6Kl2SQp-zGo-nsdImLykxw",
            "tD1veHsKELAH3b7wKmHsaw"
        ],
        "explanation": {
            "cgEzHZQKhi2anXfyF75MQw": "Known for its exceptional seafood dishes and high-quality ingredients, aligning perfectly with the user's fish preference.",
            "csbBCysrsifg8N10c0eHCA": "Offers great service and a welcoming atmosphere, which enhances the overall dining experience while serving impressive fish options.",
            "xWuzWH8qYaa75REqVd9Isw": "Features a diverse menu with commendable fish dishes, though it slightly lags in comparison to the top-ranked restaurants regarding service.",
            "6Kl2SQp-zGo-nsdImLykxw": "While it serves good food, it does not specialize in fish dishes, which is a key preference for the user.",
            "tD1veHsKELAH3b7wKmHsaw": "Although considered decent, its overall offerings do not meet the user's high standards for food quality and do not particularly highlight fish."
        }
    },
    "N5EqlX0a8Hu6vheBMgTtDA": {
        "kw": [
            "food",
            "restaurant",
            "place",
            "day",
            "service"
        ],
        "candidate": [
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "pM4mWLjeaZJlcdUxut2lMg",
            "qeFGUu1WPvMMNn5Hno6D-Q",
            "xbCNlp2vWixy2W1WsfGv8g"
        ],
        "explanation": {
            "nJdNzQ5Z278gTCFJ4HQBLA": "This restaurant is known for exceptional food quality and attentive service, making it the top choice.",
            "pM4mWLjeaZJlcdUxut2lMg": "Offers a great variety of dishes with consistent performance in both food and service.",
            "qeFGUu1WPvMMNn5Hno6D-Q": "While the food is good, the service can sometimes be hit or miss, placing it lower than the top two.",
            "xbCNlp2vWixy2W1WsfGv8g": "Although it has decent offerings, it lacks the refinement in food and service compared to the others."
        }
    },
    "xA78hV3BVAycTmVIm3pU-w": {
        "kw": [
            "food",
            "quality",
            "decor",
            "red wine",
            "service"
        ],
        "candidate": [
            "z57omnqRcAODGwbwMHEIyw",
            "L4ivYHVCDpIE0SrPaCn0LA",
            "e8ohWYW8rbOZWZ4pojU4zQ",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "z57omnqRcAODGwbwMHEIyw": "This restaurant is renowned for its exceptional food quality and service, making it top choice for red wine pairings.",
            "L4ivYHVCDpIE0SrPaCn0LA": "Known for its beautiful decor and a solid wine list, it provides a great atmosphere alongside high-quality cuisine.",
            "e8ohWYW8rbOZWZ4pojU4zQ": "Offers good food and service, with a cozy ambiance that complements its wine selection.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Solid option with decent food, though it lacks the standout decor found in higher-ranked choices.",
            "563C7-HcjhZwZSl4fK-mfQ": "While the service is satisfactory, it falls short in food and decor compared to other options on the list."
        }
    },
    "q7afpu276gtNdGDWaGqn0g": {
        "kw": [
            "food",
            "minutes",
            "restaurant",
            "table",
            "royal mile"
        ],
        "candidate": [
            "KMlY-L1oAL3qMQnwQCJPhQ",
            "S1eha-aT5c7WMk7lDLsW0A",
            "K8D_ltZWGvdXUaSE7bBiDw",
            "B9gUwTS1_Yzj2vajjC7Vmg",
            "xbCNlp2vWixy2W1WsfGv8g"
        ],
        "explanation": {
            "KMlY-L1oAL3qMQnwQCJPhQ": "Known for its exceptional food quality and is conveniently located near the Royal Mile.",
            "S1eha-aT5c7WMk7lDLsW0A": "Offers a great dining experience with a focus on locally sourced ingredients, slightly farther but worth the visit.",
            "K8D_ltZWGvdXUaSE7bBiDw": "A popular choice with good reviews, situated within a reasonable walking distance to the Royal Mile.",
            "B9gUwTS1_Yzj2vajjC7Vmg": "Offers good food but is a bit less accessible and may have longer wait times.",
            "xbCNlp2vWixy2W1WsfGv8g": "While it has its charm, it's further away and may not meet the quick dining preference."
        }
    },
    "U1L1ZTbrFOu9kdxa1A2cgg": {
        "kw": [
            "food",
            "restaurant",
            "town",
            "reasonable price",
            "choice"
        ],
        "candidate": [
            "z57omnqRcAODGwbwMHEIyw",
            "sjrTFzrb7_pzzBEpC-BvpA",
            "PiT0jyLL2Jwm2ODTDapOcg",
            "DdfvQ1hZOB0-ra7pu-wwoA"
        ],
        "explanation": {
            "z57omnqRcAODGwbwMHEIyw": "Offers a diverse menu that caters to various tastes at reasonable prices.",
            "sjrTFzrb7_pzzBEpC-BvpA": "Known for its local specialties and a good range of affordable options.",
            "PiT0jyLL2Jwm2ODTDapOcg": "Features a decent menu but has slightly higher prices compared to the top two.",
            "DdfvQ1hZOB0-ra7pu-wwoA": "While it has a unique offering, the limited food choice and higher costs make it less appealing."
        }
    },
    "eJpAIofn1vugSg-h57gPrQ": {
        "kw": [
            "food",
            "friend",
            "meal",
            "price",
            "rice"
        ],
        "candidate": [
            "o9KcGDv2Lkbtit7mxZs8qA",
            "cgEzHZQKhi2anXfyF75MQw",
            "E7s0QreUJ2H9r0Ls1yDeiQ"
        ],
        "explanation": {
            "o9KcGDv2Lkbtit7mxZs8qA": "This restaurant offers great food suitable for sharing, and it has a good price point, making it ideal for meals with friends.",
            "cgEzHZQKhi2anXfyF75MQw": "While still a good option and affordable, it lacks the same level of food quality or ambiance for sharing as the top choice.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Positioned lower as it may have higher prices or does not focus on rice dishes, which are a preference for the user."
        }
    },
    "LGfDJMfXDDj93YUfrEqEhA": {
        "kw": [
            "food",
            "door",
            "decor",
            "restaurant",
            "way"
        ],
        "candidate": [
            "AEVNOYRr8ZsG1bj3NuEKgA",
            "xbCNlp2vWixy2W1WsfGv8g",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "gqsU03i-WiyYHcBCdwObuQ",
            "N8hUGYmf0jEO9eDzmYHuAw"
        ],
        "explanation": {
            "AEVNOYRr8ZsG1bj3NuEKgA": "This restaurant excels in food quality and has a charming decor that enhances the dining experience.",
            "xbCNlp2vWixy2W1WsfGv8g": "Known for its inviting atmosphere and great service, it provides a delightful overall experience.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Offers a solid menu with good food but less focus on unique decor than higher-ranked places.",
            "gqsU03i-WiyYHcBCdwObuQ": "While food is decent, it lacks the ambiance that adds to the dining experience.",
            "N8hUGYmf0jEO9eDzmYHuAw": "While it has some strengths in food, the overall atmosphere and decor don’t match the user's top preferences."
        }
    },
    "ccHzPfXNuczHUnE50xorTA": {
        "kw": [
            "food",
            "menu",
            "minutes",
            "meal",
            "rice"
        ],
        "candidate": [
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "E_scgX9Vws9adbh4i_QJnQ",
            "hJNjKc4sKgWG__KitlJ1ag",
            "se9MhDAQjACYMO3LCIfT1Q"
        ],
        "explanation": {
            "E7s0QreUJ2H9r0Ls1yDeiQ": "This restaurant is known for its diverse rice-based dishes, satisfying the user’s key preference.",
            "E_scgX9Vws9adbh4i_QJnQ": "Offers a good selection of rice meals that cater to different tastes while still being highly rated.",
            "hJNjKc4sKgWG__KitlJ1ag": "Although it provides some rice options, it lacks the variety and focus on meal types compared to the top two.",
            "se9MhDAQjACYMO3LCIfT1Q": "This restaurant has the least emphasis on rice dishes, making it less suitable based on the user's preferences."
        }
    },
    "Adg7wTKXnMxCERIQ1tv8fg": {
        "kw": [
            "food",
            "while",
            "menu",
            "friend",
            "price"
        ],
        "candidate": [
            "47Uu-2MceSRFmohdzCOvGQ",
            "B9gUwTS1_Yzj2vajjC7Vmg",
            "se9MhDAQjACYMO3LCIfT1Q",
            "K8D_ltZWGvdXUaSE7bBiDw",
            "366NwqHwhOic5pBN1DjmDQ"
        ],
        "explanation": {
            "47Uu-2MceSRFmohdzCOvGQ": "This restaurant offers a fantastic menu with high-quality food at reasonable prices, making it ideal for sharing with friends.",
            "B9gUwTS1_Yzj2vajjC7Vmg": "Known for its diverse menu and great tastes, this place strikes a balance between quality and value.",
            "se9MhDAQjACYMO3LCIfT1Q": "Offers good food but lacks the variety that enhances the dining experience for groups.",
            "K8D_ltZWGvdXUaSE7bBiDw": "While it has decent food, the menu is limited, making it less suitable for a group seeking variety.",
            "366NwqHwhOic5pBN1DjmDQ": "Although this restaurant has some quality dishes, its price point and limited menu options do not cater well to the user's preferences."
        }
    },
    "PqfTIt852IueKvvewNCW4g": {
        "kw": [
            "food",
            "decor",
            "edinburgh",
            "place",
            "service"
        ],
        "candidate": [
            "HpgBVYnLQRRBPLxEdGe1Hg",
            "Q0fcX_1wvdmffqEPa246rg",
            "Rx85NUdD6MhrgKxHr05NlQ",
            "xWuzWH8qYaa75REqVd9Isw"
        ],
        "explanation": {
            "HpgBVYnLQRRBPLxEdGe1Hg": "This restaurant excels in food quality and has a stylish decor, making it the top choice for the user.",
            "Q0fcX_1wvdmffqEPa246rg": "Known for its excellent service and pleasant atmosphere, this restaurant offers a great overall experience.",
            "Rx85NUdD6MhrgKxHr05NlQ": "While the food is solid, its decor and service do not stand out as much compared to the top two.",
            "xWuzWH8qYaa75REqVd9Isw": "Although it has some good elements, it falls behind due to lower ratings in food and ambiance."
        }
    },
    "-K78Uw-3Z_Ph0JCx0FXNig": {
        "kw": [
            "food",
            "friend",
            "price",
            "part",
            "good value"
        ],
        "candidate": [
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "pM4mWLjeaZJlcdUxut2lMg",
            "hJNjKc4sKgWG__KitlJ1ag",
            "xWuzWH8qYaa75REqVd9Isw",
            "Q0fcX_1wvdmffqEPa246rg"
        ],
        "explanation": {
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Offers great food quality at reasonable prices, making it the best value choice for a group.",
            "pM4mWLjeaZJlcdUxut2lMg": "Known for its sharing platters and overall good food, it remains fairly priced, enhancing its value.",
            "hJNjKc4sKgWG__KitlJ1ag": "Solid food options but slightly pricier; suitable for casual dining with friends.",
            "xWuzWH8qYaa75REqVd9Isw": "Good food, but the price can be on the higher side without as much emphasis on shareability.",
            "Q0fcX_1wvdmffqEPa246rg": "While decent, it doesn’t stand out in terms of value or food quality compared to the others."
        }
    },
    "t_mhu4-BWlTamg9KbGU91w": {
        "kw": [
            "food",
            "minutes",
            "wait",
            "meal",
            "soup"
        ],
        "candidate": [
            "EKEPtNKJdZxRhYoFhuG8ew",
            "BmrVL3Aj5usPfpu5DE1iCg",
            "Q0fcX_1wvdmffqEPa246rg",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "hJNjKc4sKgWG__KitlJ1ag"
        ],
        "explanation": {
            "EKEPtNKJdZxRhYoFhuG8ew": "Offers a great variety of soup with quick service and high food quality.",
            "BmrVL3Aj5usPfpu5DE1iCg": "Known for its delicious meal options that include soups and has a moderate wait time.",
            "Q0fcX_1wvdmffqEPa246rg": "Good food quality but can have longer wait times compared to higher-ranked options.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Offers decent food options, but less focus on soups and longer wait times detract from its ranking.",
            "hJNjKc4sKgWG__KitlJ1ag": "While it has good food, it lacks soup options and can have the longest wait times."
        }
    },
    "KaU3rrZ-MP1KRfOyTbBD1A": {
        "kw": [
            "food",
            "rice",
            "part",
            "edinburgh",
            "fine selection"
        ],
        "candidate": [
            "z57omnqRcAODGwbwMHEIyw",
            "adI5BlJCtvWq2uAwmyndXA",
            "Vtahv3Af90H3fUuEEhPhdQ",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "vL44Ky9VxUtOgteyHasRIA"
        ],
        "explanation": {
            "z57omnqRcAODGwbwMHEIyw": "Known for its exceptional rice dishes and a fine selection of ingredients that caters to discerning palates.",
            "adI5BlJCtvWq2uAwmyndXA": "Offers a variety of rice-based meals with high-quality flavors and a reputation for good service.",
            "Vtahv3Af90H3fUuEEhPhdQ": "Provides a solid selection of rice dishes, though it is slightly less refined than the top two.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Features a diverse menu but lacks the focused rice expertise found in the top options.",
            "vL44Ky9VxUtOgteyHasRIA": "The least recommended due to limited rice offerings and overall lower food quality compared to others."
        }
    },
    "bFuvgmxqql2KRj56bHmIZQ": {
        "kw": [
            "food",
            "restaurant",
            "place",
            "service",
            "waiter"
        ],
        "candidate": [
            "Q0fcX_1wvdmffqEPa246rg",
            "xlHRYejgZj-iTm-QPhc8zQ",
            "AEVNOYRr8ZsG1bj3NuEKgA",
            "se9MhDAQjACYMO3LCIfT1Q",
            "8axxI33rUyswfRk_v3vS0A."
        ],
        "explanation": {
            "Q0fcX_1wvdmffqEPa246rg": "This restaurant is known for its exceptional food quality and attentive service, making it a top choice.",
            "xlHRYejgZj-iTm-QPhc8zQ": "Renowned for its ambiance and quality of food, this place provides a great dining experience and good service.",
            "AEVNOYRr8ZsG1bj3NuEKgA": "While it has solid food, the service experience has been inconsistent, placing it lower.",
            "se9MhDAQjACYMO3LCIfT1Q": "This restaurant offers decent food but lacks the level of service and waiter engagement found in higher-ranked options.",
            "8axxI33rUyswfRk_v3vS0A": "Although the food is acceptable, the service has been noted as lacking, warranting its lower position in the ranking."
        }
    },
    "rBHZxhzDiZR2gCFoEgGRpQ": {
        "kw": [
            "food",
            "menu",
            "bit",
            "restaurant",
            "edinburgh"
        ],
        "candidate": [
            "se9MhDAQjACYMO3LCIfT1Q",
            "V8vKFvdrvhTrQrt-rxKrPA",
            "WUAe0FGaLRCremEDXqNV4A",
            "6MR9GZjWjLAS3s39YdDXKw"
        ],
        "explanation": {
            "se9MhDAQjACYMO3LCIfT1Q": "This restaurant is known for its extensive and innovative menu, focusing on high-quality ingredients that cater to a variety of tastes.",
            "V8vKFvdrvhTrQrt-rxKrPA": "This restaurant offers a well-rounded menu with good food options and a cozy atmosphere, making it a popular choice in Edinburgh.",
            "WUAe0FGaLRCremEDXqNV4A": "While it has decent food, its menu lacks the diversity found in the top two; however, it still maintains a loyal following.",
            "6MR9GZjWjLAS3s39YdDXKw": "Although well-rated, it tends to have a more limited menu, placing it last in priority according to the user's food and menu preferences."
        }
    },
    "ccIa9Xj2r8lFnYB7seE5LA": {
        "kw": [
            "food",
            "meal",
            "edinburgh",
            "place",
            "service"
        ],
        "candidate": [
            "Q1XCsLlyXZJU0ZjuVCcM4A",
            "0HyuO5rOKeaa08TFzjIJIA",
            "KMlY-L1oAL3qMQnwQCJPhQ",
            "oAsjdHwXgKtK-NU_JEYuPg",
            "cgEzHZQKhi2anXfyF75MQw"
        ],
        "explanation": {
            "Q1XCsLlyXZJU0ZjuVCcM4A": "Ranked highest due to exceptional food quality and outstanding service that enhances the meal experience.",
            "0HyuO5rOKeaa08TFzjIJIA": "Placed second for its highly rated meal options and pleasant atmosphere, which aligns with user preferences.",
            "KMlY-L1oAL3qMQnwQCJPhQ": "A solid choice for good food, but service has been noted as inconsistent, hence the middle ranking.",
            "oAsjdHwXgKtK-NU_JEYuPg": "Offers decent food and service, but lacks the special ambiance that elevates the dining experience.",
            "cgEzHZQKhi2anXfyF75MQw": "Ranked lowest as it has received mixed reviews regarding both food and service quality."
        }
    },
    "wbYenlOjoHtEfYUZ28l6yQ": {
        "kw": [
            "food",
            "weekend",
            "lot",
            "counter",
            "town"
        ],
        "candidate": [
            "S1eha-aT5c7WMk7lDLsW0A",
            "xOZ7bkrttSIGS4NZm49w5Q",
            "J_KI8rJa_dSwTglUbwFcdw",
            "GbRN507iOJ6JOU-dixk-PQ"
        ],
        "explanation": {
            "S1eha-aT5c7WMk7lDLsW0A": "This restaurant offers a diverse menu that caters to food enthusiasts and is noted for its lively weekend atmosphere.",
            "xOZ7bkrttSIGS4NZm49w5Q": "Known for its casual counter dining, this spot is popular among locals and offers great food options for weekend visits.",
            "J_KI8rJa_dSwTglUbwFcdw": "While it has good food, it lacks the counter setup that the user prefers and is less vibrant on weekends compared to the top two.",
            "GbRN507iOJ6JOU-dixk-PQ": "This restaurant is primarily dine-in, making it less aligned with the counter dining preference and has limited weekend buzz."
        }
    },
    "Demry6BFAChyZsIicv5EbQ": {
        "kw": [
            "food",
            "menu",
            "quality",
            "hands",
            "rice"
        ],
        "candidate": [
            "z-3ZDmVbHZjDrYZE42yKZA",
            "V8vKFvdrvhTrQrt-rxKrPA",
            "aJvi4k0ndFlGBzSZzcbnTw",
            "hJNjKc4sKgWG__KitlJ1ag",
            "zc_ptb03jQiXnWGwmpAk0A."
        ],
        "explanation": {
            "z-3ZDmVbHZjDrYZE42yKZA": "Offers a variety of rice dishes with exceptional quality, aligning closely with user preferences.",
            "V8vKFvdrvhTrQrt-rxKrPA": "Known for its diverse menu and high-quality ingredients, including several rice-based entrees.",
            "aJvi4k0ndFlGBzSZzcbnTw": "Features good quality dishes and acceptable rice options, though not as extensive in variety as the top two.",
            "hJNjKc4sKgWG__KitlJ1ag": "Provides decent food quality but lacks a strong emphasis on rice-themed dishes.",
            "zc_ptb03jQiXnWGwmpAk0A": "While the food is good, the menu variety is limited in terms of rice options, making it less favorable overall."
        }
    },
    "oN9bug-cjYV5XfAXkUkDZQ": {
        "kw": [
            "food",
            "restaurant",
            "soup",
            "bottles",
            "street"
        ],
        "candidate": [
            "S1eha-aT5c7WMk7lDLsW0A",
            "s7TMkWF36dwwD8R3TKsJqw",
            "FMoKoSHgitwnt_iMWm31nQ",
            "qeFGUu1WPvMMNn5Hno6D-Q",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "S1eha-aT5c7WMk7lDLsW0A": "This restaurant specializes in a variety of soups, making it a perfect fit for the user's preference.",
            "s7TMkWF36dwwD8R3TKsJqw": "Known for its street food style and unique takes on soup dishes, it aligns well with the user’s tastes.",
            "FMoKoSHgitwnt_iMWm31nQ": "Offers good food overall but has fewer specific soup options compared to the top two.",
            "qeFGUu1WPvMMNn5Hno6D-Q": "Provides a decent menu but lacks a strong focus on soup, placing it lower.",
            "563C7-HcjhZwZSl4fK-mfQ": "While it has a varied menu, it is less related to the user’s specific preferences and therefore ranks the lowest."
        }
    },
    "F__GQ51ECBWekNnIxJT0AQ": {
        "kw": [
            "food",
            "service",
            "money",
            "drinks",
            "great service"
        ],
        "candidate": [
            "KMlY-L1oAL3qMQnwQCJPhQ",
            "Sagzs4cd0ruWEK_T9DaFHg",
            "EiYE3T3hfqcpcficZ4zJzQ",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "KMlY-L1oAL3qMQnwQCJPhQ": "This restaurant is known for its exceptional food quality and outstanding service, making it a top choice.",
            "Sagzs4cd0ruWEK_T9DaFHg": "While also offering great food, it is slightly less favored in terms of service compared to the top rank.",
            "EiYE3T3hfqcpcficZ4zJzQ": "It provides good food and reasonable prices, but service and drink selection could be improved.",
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant falls last due to higher prices and less emphasis on service and drinks, making it the least aligned with the user's preferences."
        }
    },
    "nHIUbyU_XZnFtdi3-oymXA": {
        "kw": [
            "food",
            "meal",
            "price",
            "shop",
            "decor"
        ],
        "candidate": [
            "FMoKoSHgitwnt_iMWm31nQ",
            "hf_TA4bRRnzLQh2XUbqX6w",
            "V0tRCjf95FTqVJvmxdeqbQ",
            "563C7-HcjhZwZSl4fK-mfQ",
            "sH-11zOhWubXobEeuMo2gg"
        ],
        "explanation": {
            "FMoKoSHgitwnt_iMWm31nQ": "This restaurant excels in food quality and overall meal experience, making it the top choice.",
            "hf_TA4bRRnzLQh2XUbqX6w": "Offers a great atmosphere with appealing decor and reasonably priced meals.",
            "V0tRCjf95FTqVJvmxdeqbQ": "Good food with creative meal options, slightly higher in price but worth it for the experience.",
            "563C7-HcjhZwZSl4fK-mfQ": "Solid food selection and decent prices, but decor could use improvement.",
            "sH-11zOhWubXobEeuMo2gg": "While it has some good dishes, it falls short in both decor and overall value compared to others."
        }
    },
    "hS5B81QZp24M-9m8lDBv0A": {
        "kw": [
            "food",
            "quality",
            "chance",
            "way",
            "place"
        ],
        "candidate": [
            "AUiX65HxQqwk1yvsBcbTdQ",
            "Q0fcX_1wvdmffqEPa246rg",
            "563C7-HcjhZwZSl4fK-mfQ",
            "Rx85NUdD6MhrgKxHr05NlQ"
        ],
        "explanation": {
            "AUiX65HxQqwk1yvsBcbTdQ": "This restaurant is known for its exceptional food quality and innovative dishes, aligning perfectly with the user's preference.",
            "Q0fcX_1wvdmffqEPa246rg": "Offers a solid dining experience focusing on ambiance and service, making it a suitable option for a well-rounded visit.",
            "563C7-HcjhZwZSl4fK-mfQ": "While it delivers decent food, it lacks the same level of quality that the top two places provide.",
            "Rx85NUdD6MhrgKxHr05NlQ": "This restaurant falls short in food quality and overall dining experience compared to the others, justifying its lower ranking."
        }
    },
    "ltJ6UR7deTWoPMej1AW2jQ": {
        "kw": [
            "food",
            "meal",
            "music",
            "scotland",
            "delicious"
        ],
        "candidate": [
            "0SBDr7GJAFzKECE7IIWfJA",
            "BmrVL3Aj5usPfpu5DE1iCg",
            "0HyuO5rOKeaa08TFzjIJIA",
            "hJNjKc4sKgWG__KitlJ1ag",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "0SBDr7GJAFzKECE7IIWfJA": "This restaurant offers authentic Scottish cuisine that aligns perfectly with the user's desire for delicious food.",
            "BmrVL3Aj5usPfpu5DE1iCg": "Known for its exceptional meals and focus on local ingredients, this restaurant is also a good match for the user's interest in satisfying food.",
            "0HyuO5rOKeaa08TFzjIJIA": "While not specifically Scottish, this place features music and a warm atmosphere, enhancing the overall dining experience.",
            "hJNjKc4sKgWG__KitlJ1ag": "This restaurant has a diverse menu, but its Scottish offerings are not the highlight, placing it lower in the ranking.",
            "563C7-HcjhZwZSl4fK-mfQ": "Although it offers a nice culinary experience, it lacks the strong Scottish flavor that the user seems to prefer."
        }
    },
    "8UgMUgkhCh3HwB0x7YgxqQ": {
        "kw": [
            "food",
            "treat",
            "lol",
            "edinburgh",
            "place"
        ],
        "candidate": [
            "BmrVL3Aj5usPfpu5DE1iCg",
            "0SBDr7GJAFzKECE7IIWfJA",
            "r3U-3yOP1ZB8Yu8Gv0Auwg",
            "tD1veHsKELAH3b7wKmHsaw",
            "FMoKoSHgitwnt_iMWm31nQ."
        ],
        "explanation": {
            "BmrVL3Aj5usPfpu5DE1iCg": "This restaurant is renowned for its exceptional food and delightful treats, making it a perfect fit for the user's preferences.",
            "0SBDr7GJAFzKECE7IIWfJA": "Known for its vibrant atmosphere and tasty offerings, this restaurant provides a great dining experience.",
            "r3U-3yOP1ZB8Yu8Gv0Auwg": "A local favorite that offers hearty meals and a fun vibe, suitable for the user's \"lol\" preference.",
            "tD1veHsKELAH3b7wKmHsaw": "While it has good food, it lacks some of the treat-like qualities the user may be seeking.",
            "FMoKoSHgitwnt_iMWm31nQ": "Offers decent food, but overall doesn't strongly meet the user's specific preferences for treats and food quality as compared to others."
        }
    },
    "X4qXP6G0GBz1y5bDUafYrQ": {
        "kw": [
            "food",
            "time",
            "money",
            "order",
            "kitchen"
        ],
        "candidate": [
            "vy5dhJyQ_VC1NUpPMmRUlw",
            "LUhVj-r2TtmFx6cyF9ilJg",
            "r3U-3yOP1ZB8Yu8Gv0Auwg",
            "yv8m3r2v3xQtDCYnwJa99Q",
            "adI5BlJCtvWq2uAwmyndXA."
        ],
        "explanation": {
            "vy5dhJyQ_VC1NUpPMmRUlw": "Offers the highest food quality and great service time, fitting well into the budget.",
            "LUhVj-r2TtmFx6cyF9ilJg": "Strong kitchen style and good food, it's an excellent compromise between quality and price.",
            "r3U-3yOP1ZB8Yu8Gv0Auwg": "Provides decent food options but takes longer than preferred; still within budget.",
            "yv8m3r2v3xQtDCYnwJa99Q": "Quality is acceptable, but it is less time-efficient and may not be the best choice for budget-conscious diners.",
            "adI5BlJCtvWq2uAwmyndXA": "While the kitchen style appeals to some, overall food quality and time efficiency do not meet the user's top priorities."
        }
    },
    "pSfeno8ExPHvn8NXca5sfA": {
        "kw": [
            "food",
            "minutes",
            "beef",
            "decor",
            "flavor"
        ],
        "candidate": [
            "563C7-HcjhZwZSl4fK-mfQ",
            "_TqUO2XaxLQ9i_z3RM8puQ",
            "Q0fcX_1wvdmffqEPa246rg",
            "se9MhDAQjACYMO3LCIfT1Q",
            "XarxHcmxyjvhzoROMTLyMg"
        ],
        "explanation": {
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant offers the best beef dishes with outstanding flavor that aligns perfectly with user preferences.",
            "_TqUO2XaxLQ9i_z3RM8puQ": "Known for its stylish decor and excellent beef-based menu, making it a top choice after the first.",
            "Q0fcX_1wvdmffqEPa246rg": "Offers a variety of beef options with good flavor, but lacks in decor compared to the top two.",
            "se9MhDAQjACYMO3LCIfT1Q": "While it provides good food, its offerings are less focused on beef and flavor compared to higher-ranked options.",
            "XarxHcmxyjvhzoROMTLyMg": "This restaurant has decent food and decor but does not stand out in beef or flavor, placing it last."
        }
    },
    "awto1-gW36q0avBVDGf_1g": {
        "kw": [
            "food",
            "bit",
            "place",
            "wine",
            "bread"
        ],
        "candidate": [
            "nbJXmGpdCxiBnovBkBtWcA",
            "Rx85NUdD6MhrgKxHr05NlQ",
            "se9MhDAQjACYMO3LCIfT1Q",
            "_TqUO2XaxLQ9i_z3RM8puQ",
            "DdfvQ1hZOB0-ra7pu-wwoA"
        ],
        "explanation": {
            "nbJXmGpdCxiBnovBkBtWcA": "This restaurant offers an excellent selection of food and has a great wine list, making it the top choice for this user.",
            "Rx85NUdD6MhrgKxHr05NlQ": "Known for its quality ingredients and flavorful dishes, it also pairs well with a varied wine selection.",
            "se9MhDAQjACYMO3LCIfT1Q": "While this place has good food, its wine pairing options add value, appealing to the user's preferences.",
            "_TqUO2XaxLQ9i_z3RM8puQ": "The food is decent, but it lacks the standout aspects in wine and bread that the user seeks.",
            "DdfvQ1hZOB0-ra7pu-wwoA": "Though it has a nice atmosphere, the food and wine offerings do not align well with the user's top preferences."
        }
    },
    "QcwinI60dFY5nd7ZwXZphA": {
        "kw": [
            "food",
            "door",
            "friend",
            "meal",
            "chance"
        ],
        "candidate": [
            "2HMvoTz_hw0noLzBWmyxcA",
            "IWNPEvd3o6GHi60MxnPCVQ",
            "GS06uO84yKQpa7oezgVZgQ",
            "vL44Ky9VxUtOgteyHasRIA",
            "W-kOZ946xRWBJZvxXhJ7DA."
        ],
        "explanation": {
            "2HMvoTz_hw0noLzBWmyxcA": "This restaurant excels in food quality and has a welcoming atmosphere for dining with friends.",
            "IWNPEvd3o6GHi60MxnPCVQ": "Offers diverse meal options and is conveniently accessible, making it a great choice for group dining.",
            "GS06uO84yKQpa7oezgVZgQ": "Known for its good food but may have longer wait times which could affect group dining experiences.",
            "vL44Ky9VxUtOgteyHasRIA": "Provides a decent meal experience but lacks the vibrancy that may enhance the dining with friends aspect.",
            "W-kOZ946xRWBJZvxXhJ7DA": "While it has good food, it is less ideal for social gatherings compared to the others."
        }
    },
    "-ZBReTMh4DEGjc9XtteCtg": {
        "kw": [
            "food",
            "while",
            "menu",
            "good quality",
            "meal"
        ],
        "candidate": [
            "8axxI33rUyswfRk_v3vS0A",
            "xbCNlp2vWixy2W1WsfGv8g",
            "PiT0jyLL2Jwm2ODTDapOcg",
            "hJNjKc4sKgWG__KitlJ1ag",
            "xEBRgLnqQ9bYkxTyyR3MNQ"
        ],
        "explanation": {
            "8axxI33rUyswfRk_v3vS0A": "Known for high-quality ingredients and an extensive menu catering to various tastes.",
            "xbCNlp2vWixy2W1WsfGv8g": "Offers a diverse range of dishes that emphasize good quality and presentation.",
            "PiT0jyLL2Jwm2ODTDapOcg": "Popular for its consistently good meals and a well-rounded menu.",
            "hJNjKc4sKgWG__KitlJ1ag": "While it has some good options, it falls slightly short in menu variety compared to the above.",
            "xEBRgLnqQ9bYkxTyyR3MNQ": "Offers decent meals but lacks the quality and variety that the user is seeking."
        }
    },
    "mBcFST0p0wFnqYUGjtZ4lg": {
        "kw": [
            "food",
            "restaurant",
            "soup",
            "edinburgh",
            "servers"
        ],
        "candidate": [
            "FMoKoSHgitwnt_iMWm31nQ",
            "se9MhDAQjACYMO3LCIfT1Q",
            "6MR9GZjWjLAS3s39YdDXKw",
            "EKEPtNKJdZxRhYoFhuG8ew",
            "AUiX65HxQqwk1yvsBcbTdQ"
        ],
        "explanation": {
            "FMoKoSHgitwnt_iMWm31nQ": "Known for an exceptional soup selection and great service, fitting the user's taste for food in Edinburgh.",
            "se9MhDAQjACYMO3LCIfT1Q": "Offers a variety of hearty dishes and attentive servers, making it a suitable option for those seeking good food and atmosphere.",
            "6MR9GZjWjLAS3s39YdDXKw": "A restaurant praised for its fresh ingredients and efficient staff, appealing to the user's desire for quality dining experiences.",
            "EKEPtNKJdZxRhYoFhuG8ew": "Although it has good offerings, it does not specialize in soup as much as the higher-ranked options.",
            "AUiX65HxQqwk1yvsBcbTdQ": "This place has decent food but it lacks the strong emphasis on soups and service compared to the top choices."
        }
    },
    "xux7pwny7edNxhUmPPpFkg": {
        "kw": [
            "food",
            "flavor",
            "edinburgh",
            "table",
            "service"
        ],
        "candidate": [
            "se9MhDAQjACYMO3LCIfT1Q",
            "hJNjKc4sKgWG__KitlJ1ag",
            "cgEzHZQKhi2anXfyF75MQw",
            "563C7-HcjhZwZSl4fK-mfQ",
            "qeFGUu1WPvMMNn5Hno6D-Q"
        ],
        "explanation": {
            "se9MhDAQjACYMO3LCIfT1Q": "Known for exceptional food quality and customer service, making it a top choice for flavor enthusiasts.",
            "hJNjKc4sKgWG__KitlJ1ag": "Offers a diverse menu with rich flavors and a welcoming atmosphere, perfect for a table setting.",
            "cgEzHZQKhi2anXfyF75MQw": "Highly rated for its creative cuisine and attentive service, ensuring a great dining experience.",
            "563C7-HcjhZwZSl4fK-mfQ": "Good food and service, though it slightly lags behind others in flavor complexity.",
            "qeFGUu1WPvMMNn5Hno6D-Q": "While it has decent offerings, it doesn't stand out as much in terms of food and service quality compared to the others."
        }
    },
    "93vyTaJgzQRQO4Zs9Cg_pw": {
        "kw": [
            "food",
            "spicy sauce",
            "bit",
            "friend",
            "way"
        ],
        "candidate": [
            "nbF7bEjx_4lQJ3t6aVqFjA",
            "UqcK-YuHPzcWQtNjmhTb7g",
            "hJNjKc4sKgWG__KitlJ1ag",
            "22nkIQ4BeSYwsyaPOczOeA"
        ],
        "explanation": {
            "nbF7bEjx_4lQJ3t6aVqFjA": "Known for its robust spicy sauces that cater to those who enjoy heat, making it ideal for a flavorful group outing.",
            "UqcK-YuHPzcWQtNjmhTb7g": "Offers a variety of dishes with a spicy twist, great for sharing with friends while enjoying bold flavors.",
            "hJNjKc4sKgWG__KitlJ1ag": "Features some spicy options but is less focused on communal dining experiences compared to the top choices.",
            "22nkIQ4BeSYwsyaPOczOeA": "While it provides decent food, it lacks the strong emphasis on spicy flavors that the user prefers for a fun dining experience with friends."
        }
    },
    "fQKue8ExT7MGxFcaxBWAIQ": {
        "kw": [
            "food",
            "menu",
            "minutes",
            "quality",
            "rice"
        ],
        "candidate": [
            "sH-11zOhWubXobEeuMo2gg",
            "IO8J6QJsdFeuso1Xmp3YtA",
            "BmrVL3Aj5usPfpu5DE1iCg",
            "2HMvoTz_hw0noLzBWmyxcA",
            "z-3ZDmVbHZjDrYZE42yKZA"
        ],
        "explanation": {
            "sH-11zOhWubXobEeuMo2gg": "Known for its high-quality rice dishes and extensive menu options, making it the top choice.",
            "IO8J6QJsdFeuso1Xmp3YtA": "Offers a variety of delicious rice-based meals, maintaining high standards of food quality.",
            "BmrVL3Aj5usPfpu5DE1iCg": "Good menu selection with decent rice dishes, although it doesn't stand out as much as the top two.",
            "2HMvoTz_hw0noLzBWmyxcA": "Satisfies the food quality requirement but has a more limited rice menu compared to others.",
            "z-3ZDmVbHZjDrYZE42yKZA": "Offers average quality and menu variety, making it the least preferred option based on the user's preferences."
        }
    },
    "HYJUTUxMzyLyniE5tFoE-g": {
        "kw": [
            "food",
            "door",
            "good experience",
            "part",
            "edinburgh"
        ],
        "candidate": [
            "EKEPtNKJdZxRhYoFhuG8ew",
            "lrPNLw0zbfzgWrWINMjsNw",
            "Vtahv3Af90H3fUuEEhPhdQ",
            "563C7-HcjhZwZSl4fK-mfQ",
            "z57omnqRcAODGwbwMHEIyw"
        ],
        "explanation": {
            "EKEPtNKJdZxRhYoFhuG8ew": "This restaurant is known for its excellent food and spacious layout, giving diners an enjoyable experience.",
            "lrPNLw0zbfzgWrWINMjsNw": "Offers a vibrant atmosphere and good options for larger parties, making it a great choice for a good experience.",
            "Vtahv3Af90H3fUuEEhPhdQ": "While still good, it slightly lacks in space compared to the top two, but the food quality remains high.",
            "563C7-HcjhZwZSl4fK-mfQ": "Has a decent menu but is lower on the experience scale than the top-ranked restaurants.",
            "z57omnqRcAODGwbwMHEIyw": "Prioritized last due to lesser emphasis on food quality and experience, not aligning well with the user's preferences."
        }
    },
    "fac2ymxeYW7tu6ysUGzaNw": {
        "kw": [
            "food",
            "menu",
            "friend",
            "place",
            "service"
        ],
        "candidate": [
            "V8vKFvdrvhTrQrt-rxKrPA",
            "xjBvbDmbsA0VX-vA55SbAA",
            "563C7-HcjhZwZSl4fK-mfQ",
            "tD1veHsKELAH3b7wKmHsaw"
        ],
        "explanation": {
            "V8vKFvdrvhTrQrt-rxKrPA": "Known for its outstanding food quality and diverse menu options, making it a favorable choice for the user's preferences.",
            "xjBvbDmbsA0VX-vA55SbAA": "Offers a good combination of food and service, making it a great place to dine with friends.",
            "563C7-HcjhZwZSl4fK-mfQ": "While it has a nice atmosphere, the food and menu offerings are not as strong as the top two.",
            "tD1veHsKELAH3b7wKmHsaw": "Generally good, but it lacks in service and menu variety compared to the others, resulting in a lower ranking."
        }
    },
    "bwS0UtV5XH-5BnkKdflyIg": {
        "kw": [
            "food",
            "friend",
            "pastries",
            "end",
            "spices"
        ],
        "candidate": [
            "Fppy5re0jwpdHcRVRPlBOw",
            "cBHMUESPj4SNs65Xv6xWRA",
            "3hjLxqqEfnBhwL6ecave_g",
            "BmrVL3Aj5usPfpu5DE1iCg",
            "D2smJ2r0RrVoe0aGlT-2wA"
        ],
        "explanation": {
            "Fppy5re0jwpdHcRVRPlBOw": "Renowned for its creative dishes and friendly service, it also offers excellent pastries.",
            "cBHMUESPj4SNs65Xv6xWRA": "This restaurant combines flavorful spices with a warm atmosphere and has a reputation for delicious pastries.",
            "3hjLxqqEfnBhwL6ecave_g": "A good option for food and friend gatherings; however, its pastries are not as notable.",
            "BmrVL3Aj5usPfpu5DE1iCg": "Known for flavorful food but has limited offerings when it comes to pastries.",
            "D2smJ2r0RrVoe0aGlT-2wA": "While it provides decent food, the emphasis on pastries and friendly service is lacking compared to others."
        }
    },
    "aLyUjrk69wzNe8828nmwvA": {
        "kw": [
            "while",
            "menu",
            "cocktails",
            "place",
            "service"
        ],
        "candidate": [
            "QMySP-qHdwQNZY0gDba0ng",
            "pM4mWLjeaZJlcdUxut2lMg",
            "563C7-HcjhZwZSl4fK-mfQ",
            "3hjLxqqEfnBhwL6ecave_g",
            "Q0fcX_1wvdmffqEPa246rg"
        ],
        "explanation": {
            "QMySP-qHdwQNZY0gDba0ng": "High ratings for an extensive menu and innovative cocktails, plus excellent service.",
            "pM4mWLjeaZJlcdUxut2lMg": "Offers a great atmosphere with a solid menu and cocktail selection, making it a good second choice.",
            "563C7-HcjhZwZSl4fK-mfQ": "Good menu variety and service, though not as standout as the top two.",
            "3hjLxqqEfnBhwL6ecave_g": "Decent offerings, but cocktails and service lag behind the leading choices.",
            "Q0fcX_1wvdmffqEPa246rg": "While it has a nice place, the menu and cocktail options are less appealing compared to others."
        }
    },
    "mgqLOj2fYPriJwfpx1bEWA": {
        "kw": [
            "menu",
            "bit",
            "hands",
            "restaurant",
            "edinburgh"
        ],
        "candidate": [
            "S1eha-aT5c7WMk7lDLsW0A",
            "FMoKoSHgitwnt_iMWm31nQ",
            "sgawLt-htNEwUh8Wmp3hHQ",
            "xOZ7bkrttSIGS4NZm49w5Q",
            "z57omnqRcAODGwbwMHEIyw"
        ],
        "explanation": {
            "S1eha-aT5c7WMk7lDLsW0A": "Chosen for its diverse menu and interactive dining experience, perfect for those who enjoy engaging meals.",
            "FMoKoSHgitwnt_iMWm31nQ": "Ranks high due to its innovative dishes and hands-on approach to dining, aligning well with the user’s preferences.",
            "sgawLt-htNEwUh8Wmp3hHQ": "Offers a good selection of menu options and is known for its friendly atmosphere, making it a solid choice.",
            "xOZ7bkrttSIGS4NZm49w5Q": "While it has a decent menu, it doesn't quite meet the hands-on aspect as strongly as the top choices.",
            "z57omnqRcAODGwbwMHEIyw": "Although it has a unique concept, it ranks lower due to a more limited menu and less engaging dining experience."
        }
    },
    "_AkImqSimksxIDIVq4V-dA": {
        "kw": [
            "menu",
            "beef",
            "lol",
            "edinburgh",
            "place"
        ],
        "candidate": [
            "L4ivYHVCDpIE0SrPaCn0LA",
            "563C7-HcjhZwZSl4fK-mfQ",
            "e8ohWYW8rbOZWZ4pojU4zQ",
            "z57omnqRcAODGwbwMHEIyw",
            "2vOHS-_p5ylEf0BGR1dO9w"
        ],
        "explanation": {
            "L4ivYHVCDpIE0SrPaCn0LA": "This restaurant offers a diverse menu with excellent beef options and is located in Edinburgh.",
            "563C7-HcjhZwZSl4fK-mfQ": "Known for its high-quality beef dishes, it also provides a varied menu and is situated conveniently in the city.",
            "e8ohWYW8rbOZWZ4pojU4zQ": "While it features some beef options, the overall menu variety places it lower in the ranking.",
            "z57omnqRcAODGwbwMHEIyw": "This option has decent beef selections but lacks the extensive variety found in higher-ranked restaurants.",
            "2vOHS-_p5ylEf0BGR1dO9w": "Offers limited beef choices and a less appealing menu overall compared to the others."
        }
    },
    "QLecW-87QIdnwBnVH1mDBQ": {
        "kw": [
            "menu",
            "decor",
            "soup",
            "edinburgh",
            "place"
        ],
        "candidate": [
            "se9MhDAQjACYMO3LCIfT1Q",
            "563C7-HcjhZwZSl4fK-mfQ",
            "S1eha-aT5c7WMk7lDLsW0A",
            "85Y24Itl548cCCVV2d8HxQ",
            "vL44Ky9VxUtOgteyHasRIA"
        ],
        "explanation": {
            "se9MhDAQjACYMO3LCIfT1Q": "Top-ranked for its diverse menu and highly praised decor, as well as a signature soup that aligns with the user's preferences.",
            "563C7-HcjhZwZSl4fK-mfQ": "Known for its inviting atmosphere and strong soup offerings, making it a great choice for the user's taste in decor and food.",
            "S1eha-aT5c7WMk7lDLsW0A": "While it has a good menu, its decor does not stand out as much compared to the top two, placing it here.",
            "85Y24Itl548cCCVV2d8HxQ": "Offers decent soup options but lacks in decor, making it less appealing to the user's priorities.",
            "vL44Ky9VxUtOgteyHasRIA": "Ranked lowest due to limited soup offerings and decor that doesn't cater to the user's aesthetic preferences."
        }
    },
    "sZ7Yj68IqrPXVSs0hsfUJg": {
        "kw": [
            "menu",
            "meal",
            "price",
            "decor",
            "flavor"
        ],
        "candidate": [
            "z57omnqRcAODGwbwMHEIyw",
            "AUiX65HxQqwk1yvsBcbTdQ",
            "563C7-HcjhZwZSl4fK-mfQ",
            "se9MhDAQjACYMO3LCIfT1Q",
            "Q0fcX_1wvdmffqEPa246rg"
        ],
        "explanation": {
            "z57omnqRcAODGwbwMHEIyw": "This restaurant offers a diverse menu with flavorful dishes at reasonable prices, complemented by a charming decor.",
            "AUiX65HxQqwk1yvsBcbTdQ": "While slightly higher in price, the quality of meals and the appealing decor make it a strong contender for those who value flavor.",
            "563C7-HcjhZwZSl4fK-mfQ": "Offers good meals at competitive prices, although it could improve in decor to elevate the dining experience.",
            "se9MhDAQjACYMO3LCIfT1Q": "This restaurant has decent options but doesn't stand out in flavor or ambiance, ranking it lower.",
            "Q0fcX_1wvdmffqEPa246rg": "While it has a specific menu focus, it may not appeal to the user’s preference for variety and flavor, thus placed last."
        }
    },
    "Kmq1ggxmcd-gdY6imsrfww": {
        "kw": [
            "menu",
            "meal",
            "restaurant",
            "flavor",
            "edinburgh"
        ],
        "candidate": [
            "voaZjLwStQEq9-wj7hFYBQ",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "xjBvbDmbsA0VX-vA55SbAA",
            "FMoKoSHgitwnt_iMWm31nQ",
            "z57omnqRcAODGwbwMHEIyw"
        ],
        "explanation": {
            "voaZjLwStQEq9-wj7hFYBQ": "This restaurant offers a varied menu with bold flavors, making it suitable for the user's preferences.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Known for its excellent meal selection, this restaurant emphasizes local ingredients and flavors.",
            "xjBvbDmbsA0VX-vA55SbAA": "While slightly less varied, this option still offers a unique twist on traditional dishes, appealing to flavor seekers.",
            "FMoKoSHgitwnt_iMWm31nQ": "Though it has a interesting menu, it may not fully cater to the user's flavor preferences as strongly.",
            "z57omnqRcAODGwbwMHEIyw": "Ranked lowest due to its more limited offerings and flavor profile compared to the others."
        }
    },
    "ojkg8l3E_FDNnAqjKtEioQ": {
        "kw": [
            "menu",
            "quality",
            "restaurant",
            "way",
            "place"
        ],
        "candidate": [
            "ZOyBVpeSQ7sYDeZa_v0MFw",
            "Q0fcX_1wvdmffqEPa246rg",
            "8PmbCVEjWGPouD1Tst6FsQ",
            "8Haoz9Mil7ZnHGU48sgBtw",
            "xWuzWH8qYaa75REqVd9Isw"
        ],
        "explanation": {
            "ZOyBVpeSQ7sYDeZa_v0MFw": "It has a highly rated menu with diverse options and excellent quality, making it top-ranked.",
            "Q0fcX_1wvdmffqEPa246rg": "Known for its quality dishes and strong reputation, it follows closely behind.",
            "8PmbCVEjWGPouD1Tst6FsQ": "Offers a good menu but lacks the same level of quality as the top two.",
            "8Haoz9Mil7ZnHGU48sgBtw": "Provides decent food but doesn't stand out in terms of menu creativity or quality.",
            "xWuzWH8qYaa75REqVd9Isw": "While a solid choice, it has less to offer compared to the others in terms of overall dining experience."
        }
    },
    "Yt_y59nDDmf1lDepYnshtA": {
        "kw": [
            "menu",
            "meal",
            "rice",
            "restaurant",
            "edinburgh"
        ],
        "candidate": [
            "PiT0jyLL2Jwm2ODTDapOcg",
            "NW3KM7K7ywzEfqk3OR4tAQ",
            "GdzCnx5OWURyklzTjaQIPw",
            "W-kOZ946xRWBJZvxXhJ7DA",
            "vL44Ky9VxUtOgteyHasRIA"
        ],
        "explanation": {
            "PiT0jyLL2Jwm2ODTDapOcg": "Offers a diverse menu with several rice dishes, making it a strong match for the user.",
            "NW3KM7K7ywzEfqk3OR4tAQ": "Known for its excellent rice-based options and overall meal quality.",
            "GdzCnx5OWURyklzTjaQIPw": "Features a good selection of rice dishes that appeal to the user’s preferences.",
            "W-kOZ946xRWBJZvxXhJ7DA": "Provides decent meals but lacks the rice emphasis that the user enjoys.",
            "vL44Ky9VxUtOgteyHasRIA": "While a popular option, it does not focus on rice-based meals as much as the others."
        }
    },
    "ud0mbXHCpQ9mxQrQfwUemg": {
        "kw": [
            "menu",
            "restaurant",
            "edinburgh",
            "lot",
            "time"
        ],
        "candidate": [
            "Jwp4UFa93ENe-0REPo5hCQ",
            "z57omnqRcAODGwbwMHEIyw",
            "2vOHS-_p5ylEf0BGR1dO9w",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "se9MhDAQjACYMO3LCIfT1Q"
        ],
        "explanation": {
            "Jwp4UFa93ENe-0REPo5hCQ": "This restaurant is known for its diverse and appealing menu options, making it a top choice for varied tastes.",
            "z57omnqRcAODGwbwMHEIyw": "Offers a good selection of dishes with strong local influences, appealing to those who want to experience Edinburgh's culinary scene.",
            "2vOHS-_p5ylEf0BGR1dO9w": "Recognized for its unique menu offerings, this option caters well to those wanting something different.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Although slightly less diverse, this restaurant still provides a solid selection with quality ingredients.",
            "se9MhDAQjACYMO3LCIfT1Q": "This restaurant, while good, tends to focus on fewer offerings that may not meet the user’s preference for variety as strongly as the others."
        }
    },
    "7vZzu-o3eCgQaf7nPfYY5A": {
        "kw": [
            "menu",
            "restaurant",
            "town",
            "friends",
            "lots"
        ],
        "candidate": [
            "J_KI8rJa_dSwTglUbwFcdw",
            "cgEzHZQKhi2anXfyF75MQw",
            "366NwqHwhOic5pBN1DjmDQ",
            "563C7-HcjhZwZSl4fK-mfQ",
            "xWuzWH8qYaa75REqVd9Isw"
        ],
        "explanation": {
            "J_KI8rJa_dSwTglUbwFcdw": "Offers a diverse menu ideal for large groups, making it perfect for dining with friends.",
            "cgEzHZQKhi2anXfyF75MQw": "Features a good selection of dishes and is known for its spacious seating arrangements suitable for larger parties.",
            "366NwqHwhOic5pBN1DjmDQ": "Provides a decent variety of menu options, with enough space to accommodate friends comfortably.",
            "563C7-HcjhZwZSl4fK-mfQ": "While not as extensive in menu variety, it still offers a pleasant atmosphere for group dining.",
            "xWuzWH8qYaa75REqVd9Isw": "Though popular, its menu is more limited compared to the others, making it less favorable for this group dining preference."
        }
    },
    "AV17hCPp3TJckyHT21i9lw": {
        "kw": [
            "menu",
            "meal",
            "hands",
            "rice",
            "lot"
        ],
        "candidate": [
            "ZOyBVpeSQ7sYDeZa_v0MFw",
            "hz0ldhBHu5M4ri9M_mkOdQ",
            "sH-11zOhWubXobEeuMo2gg",
            "g_fGPZJlGeKGLgC-j-tj6w",
            "z57omnqRcAODGwbwMHEIyw"
        ],
        "explanation": {
            "ZOyBVpeSQ7sYDeZa_v0MFw": "This restaurant offers a varied menu that prioritizes hand-held meals and rice dishes, aligning perfectly with user preferences.",
            "hz0ldhBHu5M4ri9M_mkOdQ": "Known for its great rice options and a menu that allows for hands-on dining, it's a strong contender for the user's tastes.",
            "sH-11zOhWubXobEeuMo2gg": "While it has some good options, it doesn’t fully cater to the desired hands-on meal experience and rice-heavy dishes.",
            "g_fGPZJlGeKGLgC-j-tj6w": "This place has some rice options but lacks the overall variety and hands-on meal offerings.",
            "z57omnqRcAODGwbwMHEIyw": "It falls short on variety and hands-on meals, making it less preferred compared to the others."
        }
    },
    "-V3iXmuL568kFvfJKBXROA": {
        "kw": [
            "menu",
            "wait",
            "steak",
            "area",
            "pizzas"
        ],
        "candidate": [
            "g_fGPZJlGeKGLgC-j-tj6w",
            "47Uu-2MceSRFmohdzCOvGQ",
            "se9MhDAQjACYMO3LCIfT1Q",
            "BmrVL3Aj5usPfpu5DE1iCg",
            "xWuzWH8qYaa75REqVd9Isw"
        ],
        "explanation": {
            "g_fGPZJlGeKGLgC-j-tj6w": "Offers a diverse menu with a strong focus on steak and fast service, meeting key preferences.",
            "47Uu-2MceSRFmohdzCOvGQ": "Known for its excellent pizza and good wait times, it complements the user’s interest in varied dining options.",
            "se9MhDAQjACYMO3LCIfT1Q": "While also presenting a great menu, it ranks lower due to slightly longer wait times than preferred.",
            "BmrVL3Aj5usPfpu5DE1iCg": "Although a popular choice, it has limited steak options and longer wait times, making it less favorable.",
            "xWuzWH8qYaa75REqVd9Isw": "Despite variety, it lacks the specific emphasis on steak and pizzas that the user seeks."
        }
    },
    "KMrUM3hIAjbRJbZ_pbcUxQ": {
        "kw": [
            "door",
            "edinburgh",
            "place",
            "lot",
            "tomato"
        ],
        "candidate": [
            "KMlY-L1oAL3qMQnwQCJPhQ",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "47Uu-2MceSRFmohdzCOvGQ",
            "z57omnqRcAODGwbwMHEIyw",
            "_jNe_vwxiEh0G9JRZByc0w"
        ],
        "explanation": {
            "KMlY-L1oAL3qMQnwQCJPhQ": "This restaurant is known for its welcoming entrance and uses a lot of fresh tomatoes in its dishes, making it a top pick.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "This place is well-regarded in Edinburgh, featuring good door accessibility and various tomato-based options.",
            "47Uu-2MceSRFmohdzCOvGQ": "It offers a nice atmosphere and while it has decent dishes, it doesn't specialize in tomato options as much as the top two.",
            "z57omnqRcAODGwbwMHEIyw": "This restaurant has a good location but lacks the door appeal and fresh tomato emphasis that the user prefers.",
            "_jNe_vwxiEh0G9JRZByc0w": "Although it has good dining, it rates lowest due to limited options for tomato dishes."
        }
    },
    "_NvaWihvoqp0ZZfkhG3sig": {
        "kw": [
            "door",
            "taste",
            "fish",
            "chips",
            "town"
        ],
        "candidate": [
            "563C7-HcjhZwZSl4fK-mfQ",
            "se9MhDAQjACYMO3LCIfT1Q",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "FMoKoSHgitwnt_iMWm31nQ"
        ],
        "explanation": {
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant is highly acclaimed for its delicious fish and chips, making it a top choice for tastes aligned with the user's preferences.",
            "se9MhDAQjACYMO3LCIfT1Q": "Known for its tasty offerings, it remains relevant due to good reviews, despite not being primarily focused on fish.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "This place is decent but doesn't have as prominent a focus on fish dishes, thus it's lower on the list.",
            "FMoKoSHgitwnt_iMWm31nQ": "While it may be popular, its offerings may not be aligned with the user's specific craving for fish and chips."
        }
    },
    "mbtri0iWlGf-Qd25JQ_UBA": {
        "kw": [
            "door",
            "wait",
            "edinburgh",
            "place",
            "town"
        ],
        "candidate": [
            "nbJXmGpdCxiBnovBkBtWcA",
            "gJliACNKY4rK30BTMIzwsQ",
            "vL44Ky9VxUtOgteyHasRIA",
            "xbCNlp2vWixy2W1WsfGv8g",
            "563C7-HcjhZwZSl4fK-mfQ."
        ],
        "explanation": {
            "nbJXmGpdCxiBnovBkBtWcA": "This restaurant is conveniently located in town and has good accessibility and atmosphere.",
            "gJliACNKY4rK30BTMIzwsQ": "It has a welcoming entrance and is relatively quick on service, aligning well with user preferences.",
            "vL44Ky9VxUtOgteyHasRIA": "Although a bit out of the way, it offers a great dining experience but may have longer wait times.",
            "xbCNlp2vWixy2W1WsfGv8g": "This place is noted for its vibe but lacks the desired location within Edinburgh.",
            "563C7-HcjhZwZSl4fK-mfQ": "While it has good reviews, it is less accessible and not located in the town area as preferred."
        }
    },
    "2ROguWudHPAM-m5DNRvMPQ": {
        "kw": [
            "fried rice",
            "edinburgh",
            "dinner",
            "one",
            "byob"
        ],
        "candidate": [
            "R79Hir871EF-kRLIBPy9qg",
            "ZMcd7w-yDhFRLSwvJBV1VQ",
            "xbCNlp2vWixy2W1WsfGv8g",
            "adI5BlJCtvWq2uAwmyndXA",
            "J_KI8rJa_dSwTglUbwFcdw"
        ],
        "explanation": {
            "R79Hir871EF-kRLIBPy9qg": "Known for its excellent fried rice and it offers a BYOB option, making it ideal for dinner.",
            "ZMcd7w-yDhFRLSwvJBV1VQ": "A popular choice for Asian cuisine with good fried rice, also allowing guests to bring their own beverages.",
            "xbCNlp2vWixy2W1WsfGv8g": "Offers a variety of rice dishes and is well-rated for its ambiance, though it’s slightly less focused on fried rice.",
            "adI5BlJCtvWq2uAwmyndXA": "Suitable for dinner but does not specialize in fried rice, which affects its overall ranking based on preferences.",
            "J_KI8rJa_dSwTglUbwFcdw": "Although it has some decent offerings, it is less relevant to the specific criteria of fried rice and BYOB."
        }
    },
    "0lgr88M1Wdzy9iBQbL6L2g": {
        "kw": [
            "minutes",
            "bit",
            "price",
            "soup",
            "tea"
        ],
        "candidate": [
            "5Iin0tl6QJT_TyL1BldtyA",
            "se9MhDAQjACYMO3LCIfT1Q",
            "Q0fcX_1wvdmffqEPa246rg",
            "563C7-HcjhZwZSl4fK-mfQ",
            "2HMvoTz_hw0noLzBWmyxcA"
        ],
        "explanation": {
            "5Iin0tl6QJT_TyL1BldtyA": "This restaurant offers affordable options and specializes in soups and teas, making it a top choice for the user.",
            "se9MhDAQjACYMO3LCIfT1Q": "Known for quick service and a good selection of teas, this place ranks high for short wait times.",
            "Q0fcX_1wvdmffqEPa246rg": "While it has reasonable prices, it lacks a strong focus on soup and tea.",
            "563C7-HcjhZwZSl4fK-mfQ": "Slightly higher in price compared to others but still provides decent options; it falls lower due to lack of specialization in user favorites.",
            "2HMvoTz_hw0noLzBWmyxcA": "This restaurant does not align well with the user’s preference for quick and affordable soup and tea options."
        }
    },
    "B-edcZUr01jugv_B29plDw": {
        "kw": [
            "minutes",
            "part",
            "dishes",
            "edinburgh",
            "star"
        ],
        "candidate": [
            "sjrTFzrb7_pzzBEpC-BvpA",
            "ksP8426d2qN-mg-JDpkRVQ",
            "PiT0jyLL2Jwm2ODTDapOcg",
            "B9gUwTS1_Yzj2vajjC7Vmg",
            "BmrVL3Aj5usPfpu5DE1iCg"
        ],
        "explanation": {
            "sjrTFzrb7_pzzBEpC-BvpA": "This restaurant offers timely service and a diverse menu that resonates well with the user's preferences.",
            "ksP8426d2qN-mg-JDpkRVQ": "Known for its efficient meal preparation and quality dishes, it stands out for a quick yet satisfying dining experience.",
            "PiT0jyLL2Jwm2ODTDapOcg": "While slightly less focused on speed, it provides a unique menu that aligns with the interest in dishes specific to Edinburgh.",
            "B9gUwTS1_Yzj2vajjC7Vmg": "Provides good dishes but may not offer the best timing for the user’s needs.",
            "BmrVL3Aj5usPfpu5DE1iCg": "Although it has its strengths, it doesn't fully match the user’s quest for efficient dining in Edinburgh."
        }
    },
    "SfY0jEFqBkrqq9bVi6P31Q": {
        "kw": [
            "friend",
            "goodness",
            "place",
            "table",
            "fish"
        ],
        "candidate": [
            "3hjLxqqEfnBhwL6ecave_g",
            "AUiX65HxQqwk1yvsBcbTdQ",
            "IgicVjRYx6fB5n5z4t6xBA",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "x1bjSvpIJTN1KBFhUjOU_g"
        ],
        "explanation": {
            "3hjLxqqEfnBhwL6ecave_g": "Known for its seafood specialties and friendly service, making it an ideal choice for a pleasant dining experience.",
            "AUiX65HxQqwk1yvsBcbTdQ": "Offers a cozy ambiance and a good selection of fish dishes that would appeal to the user's taste.",
            "IgicVjRYx6fB5n5z4t6xBA": "This place has decent seafood options, but the overall atmosphere may not be as inviting as the top choices.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "While it has good food, it's not focused on seafood or a social experience, which lowers its ranking.",
            "x1bjSvpIJTN1KBFhUjOU_g": "Lacks a strong seafood offering and has a less inviting atmosphere, making it the least suitable option for the user's preferences."
        }
    },
    "T6W1v13bzNQM20vrAcTYHg": {
        "kw": [
            "friend",
            "tomato",
            "service",
            "haddock",
            "long wait"
        ],
        "candidate": [
            "366NwqHwhOic5pBN1DjmDQ",
            "KMlY-L1oAL3qMQnwQCJPhQ",
            "B9gUwTS1_Yzj2vajjC7Vmg",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "GS06uO84yKQpa7oezgVZgQ"
        ],
        "explanation": {
            "366NwqHwhOic5pBN1DjmDQ": "Known for its excellent service and friendly atmosphere, with menu options featuring tomato-based dishes.",
            "KMlY-L1oAL3qMQnwQCJPhQ": "Offers good service and has a variety of seafood, including haddock, which aligns with user preferences.",
            "B9gUwTS1_Yzj2vajjC7Vmg": "Although waits may be longer, it is still a friendlier environment with decent tomato options available.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Features a good selection of seafood but can have inconsistent service, which places it lower.",
            "GS06uO84yKQpa7oezgVZgQ": "Lowest priority due to average service and lack of specific requested dishes like haddock and tomato-focused meals."
        }
    },
    "jJ-MRytfgNEzutY8TBxJKw": {
        "kw": [
            "meal",
            "taste",
            "edinburgh",
            "place",
            "variety"
        ],
        "candidate": [
            "KMlY-L1oAL3qMQnwQCJPhQ",
            "6MR9GZjWjLAS3s39YdDXKw",
            "sH-11zOhWubXobEeuMo2gg",
            "xOZ7bkrttSIGS4NZm49w5Q",
            "l_tk3iLmyKfBUCK-6nBbHg"
        ],
        "explanation": {
            "KMlY-L1oAL3qMQnwQCJPhQ": "This restaurant is renowned for its extensive menu offering a variety of cuisines, making it a top choice for meal diversity.",
            "6MR9GZjWjLAS3s39YdDXKw": "Known for high-quality dishes and good reviews on taste, this spot also offers several options ensuring satisfaction.",
            "sH-11zOhWubXobEeuMo2gg": "Offers a decent selection of meals and is favored for its unique flavor profiles that appeal to a variety of tastes.",
            "xOZ7bkrttSIGS4NZm49w5Q": "Provides a limited but well-crafted menu with emphasis on quality, though it lacks in variety compared to the top picks.",
            "l_tk3iLmyKfBUCK-6nBbHg": "While it has a solid reputation, the variety of dishes is more limited which places it lower in the ranking."
        }
    },
    "sP_NnexHbu0eqJVmtCOZQQ": {
        "kw": [
            "meal",
            "price",
            "dishes",
            "taste",
            "chips"
        ],
        "candidate": [
            "hJNjKc4sKgWG__KitlJ1ag",
            "APN05ziH92oIox8EMxcceg",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "cgEzHZQKhi2anXfyF75MQw",
            "Q0fcX_1wvdmffqEPa246rg"
        ],
        "explanation": {
            "hJNjKc4sKgWG__KitlJ1ag": "This restaurant stands out for its exceptional taste and quality of dishes, alongside reasonable pricing.",
            "APN05ziH92oIox8EMxcceg": "Known for a diverse menu that appeals to various tastes, plus some popular chip options.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Offers good meals at economical prices, maintaining solid taste but less variety in dishes.",
            "cgEzHZQKhi2anXfyF75MQw": "While decent, it ranks lower due to higher prices and less emphasis on chips and meal variety.",
            "Q0fcX_1wvdmffqEPa246rg": "This restaurant has limited offerings which don’t align as well with the user's preferences in taste and dishes, leading to its lower ranking."
        }
    },
    "XyOlmy-Tc6DPfw5stMJ_zA": {
        "kw": [
            "meal",
            "edinburgh",
            "place",
            "chicken",
            "service"
        ],
        "candidate": [
            "Q1XCsLlyXZJU0ZjuVCcM4A",
            "563C7-HcjhZwZSl4fK-mfQ",
            "xjBvbDmbsA0VX-vA55SbAA",
            "gtx0OZnN98YXAASyMzv3hw",
            "2vOHS-_p5ylEf0BGR1dO9w"
        ],
        "explanation": {
            "Q1XCsLlyXZJU0ZjuVCcM4A": "This restaurant is known for its exceptional chicken dishes and friendly service, making it the top recommendation.",
            "563C7-HcjhZwZSl4fK-mfQ": "Offers a great variety of chicken meals with a solid reputation for its customer service.",
            "xjBvbDmbsA0VX-vA55SbAA": "While not solely focused on chicken, it serves a notable chicken dish that receives high praise alongside good service.",
            "gtx0OZnN98YXAASyMzv3hw": "This option has decent chicken offerings but is slightly lower in service ratings compared to the top choices.",
            "2vOHS-_p5ylEf0BGR1dO9w": "Although it serves chicken, the service has been reported as inconsistent, placing it at the bottom of the list."
        }
    },
    "1Xm4Nea4ikRokE0Nlt-dwg": {
        "kw": [
            "meal",
            "place",
            "end",
            "dinner",
            "steak"
        ],
        "candidate": [
            "hJNjKc4sKgWG__KitlJ1ag",
            "xOZ7bkrttSIGS4NZm49w5Q",
            "EiYE3T3hfqcpcficZ4zJzQ",
            "z57omnqRcAODGwbwMHEIyw",
            "41vgh9z4OSJfbgOy57qh0Q"
        ],
        "explanation": {
            "hJNjKc4sKgWG__KitlJ1ag": "Best offers steak-focused dinner options, ideal for the user's meal preference.",
            "xOZ7bkrttSIGS4NZm49w5Q": "A notable steakhouse with a great atmosphere for dinner, second in line for its quality.",
            "EiYE3T3hfqcpcficZ4zJzQ": "Offers decent steak meals but not as highly rated for dinner ambiance.",
            "z57omnqRcAODGwbwMHEIyw": "A non-steak-centric option that may still suit dinner but lower in steak options.",
            "41vgh9z4OSJfbgOy57qh0Q": "Last as it lacks a strong focus on steak or dedicated dinner service."
        }
    },
    "JkP7WtmnqmGctb1QFulVcw": {
        "kw": [
            "price",
            "soup",
            "edinburgh",
            "place",
            "head"
        ],
        "candidate": [
            "AUiX65HxQqwk1yvsBcbTdQ",
            "se9MhDAQjACYMO3LCIfT1Q",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "K8D_ltZWGvdXUaSE7bBiDw",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "AUiX65HxQqwk1yvsBcbTdQ": "This restaurant offers well-priced soup options and has a welcoming atmosphere, making it highly appealing in Edinburgh.",
            "se9MhDAQjACYMO3LCIfT1Q": "Known for its variety of soups and reasonable prices, it maintains a strong presence in the local dining scene.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "Although slightly higher in price, this place provides unique soup dishes that are worth the expense for their quality.",
            "K8D_ltZWGvdXUaSE7bBiDw": "A good option for those looking for value, but it lacks the soup variety that has been highlighted as a user preference.",
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant is lower in the ranking due to less emphasis on soups and less favorable pricing compared to the others."
        }
    },
    "KerXo7TQpmSSeZIv7zXxzw": {
        "kw": [
            "workers",
            "group",
            "chicken",
            "service",
            "fish"
        ],
        "candidate": [
            "adI5BlJCtvWq2uAwmyndXA",
            "W-kOZ946xRWBJZvxXhJ7DA",
            "V8vKFvdrvhTrQrt-rxKrPA",
            "563C7-HcjhZwZSl4fK-mfQ"
        ],
        "explanation": {
            "adI5BlJCtvWq2uAwmyndXA": "This restaurant is well-reviewed for its group-friendly atmosphere, great service, and diverse menu featuring both chicken and fish.",
            "W-kOZ946xRWBJZvxXhJ7DA": "Known for its good service and accommodating staff, it offers a solid selection of chicken and fish options suitable for groups.",
            "V8vKFvdrvhTrQrt-rxKrPA": "While it has good food, its menu is more focused on specific dishes with less variety for groups compared to the top choices.",
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant is less known for group accommodating and focuses more on individual dining experiences, with limited options for chicken and fish."
        }
    },
    "IpE_BSBMUl55FJfsi7-tuQ": {
        "kw": [
            "restaurant",
            "edinburgh",
            "table",
            "town",
            "chef"
        ],
        "candidate": [
            "Sagzs4cd0ruWEK_T9DaFHg",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "Q0fcX_1wvdmffqEPa246rg",
            "xWuzWH8qYaa75REqVd9Isw",
            "z57omnqRcAODGwbwMHEIyw"
        ],
        "explanation": {
            "Sagzs4cd0ruWEK_T9DaFHg": "This restaurant is known for its exceptional chef-driven menu and a strong focus on high-quality ingredients, making it ideal for the user's preference.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Offers a unique dining experience in Edinburgh with noteworthy table service and a creative chef-inspired menu.",
            "Q0fcX_1wvdmffqEPa246rg": "A solid choice with a reputation for quality dining; however, it lacks some of the chef's signature creativity.",
            "xWuzWH8qYaa75REqVd9Isw": "Great atmosphere and good food, but not as table-driven and chef-focused as the top options.",
            "z57omnqRcAODGwbwMHEIyw": "While it serves decent food, it doesn't fully meet the user's desire for an engaging chef-driven experience."
        }
    },
    "mTH7-QA2H9auoUi9no10Ww": {
        "kw": [
            "soup",
            "place",
            "town",
            "back",
            "lunch"
        ],
        "candidate": [
            "E_scgX9Vws9adbh4i_QJnQ",
            "se9MhDAQjACYMO3LCIfT1Q",
            "E7s0QreUJ2H9r0Ls1yDeiQ",
            "_jNe_vwxiEh0G9JRZByc0w",
            "KL1oif2ocGH2dJ4w-oT_Mg"
        ],
        "explanation": {
            "E_scgX9Vws9adbh4i_QJnQ": "This place is renowned for its variety of delicious soups and welcoming ambiance, perfect for lunch.",
            "se9MhDAQjACYMO3LCIfT1Q": "Offers a casual environment with great soup options that fit the user's preference for a town-like place.",
            "E7s0QreUJ2H9r0Ls1yDeiQ": "While it has good soup, the atmosphere is less town-like, making it less ideal for lunch.",
            "_jNe_vwxiEh0G9JRZByc0w": "Offers a somewhat limited lunch menu, which impacts its ranking despite good soup.",
            "KL1oif2ocGH2dJ4w-oT_Mg": "While generally a good spot, it lacks the strong focus on soup that the user prefers for lunch."
        }
    },
    "ctatGRZqs9urE-OfV1rDug": {
        "kw": [
            "dishes",
            "cocktails",
            "table",
            "service",
            "chips"
        ],
        "candidate": [
            "hz0ldhBHu5M4ri9M_mkOdQ",
            "cgEzHZQKhi2anXfyF75MQw",
            "csbBCysrsifg8N10c0eHCA",
            "qDPn14lenAGehkbnJaqnYg",
            "366NwqHwhOic5pBN1DjmDQ"
        ],
        "explanation": {
            "hz0ldhBHu5M4ri9M_mkOdQ": "Known for its exceptional dishes and cocktail selection, creating an enjoyable dining atmosphere with excellent service.",
            "cgEzHZQKhi2anXfyF75MQw": "Offers a great variety of dishes and an inviting cocktail menu, making it a solid choice for a table setting paired with attentive service.",
            "csbBCysrsifg8N10c0eHCA": "Provides good food and cocktails along with decent service, appealing to those who appreciate quality dining.",
            "qDPn14lenAGehkbnJaqnYg": "While it has some strong dishes, its cocktail offerings and service experience are less consistent than the others.",
            "366NwqHwhOic5pBN1DjmDQ": "It offers a standard menu and drinks, but lacks the standout services and atmosphere present in the higher-ranked options."
        }
    },
    "7jhPCj640UXpNKlwgZbKYA": {
        "kw": [
            "taste",
            "edinburgh",
            "service",
            "name",
            "breakfast"
        ],
        "candidate": [
            "IYdv6RxSiqz2XMsqkiTmPQ",
            "aJkxkjYvi89gHIOomnjGVQ",
            "qesu3mk5yHeak9CUO4gRdQ",
            "vL44Ky9VxUtOgteyHasRIA",
            "qmcIsZjLpxd0V4RekSozmA"
        ],
        "explanation": {
            "IYdv6RxSiqz2XMsqkiTmPQ": "Known for its exceptional breakfast options and high service quality.",
            "aJkxkjYvi89gHIOomnjGVQ": "Offers a unique taste experience and a good reputation for service, making it a solid choice.",
            "qesu3mk5yHeak9CUO4gRdQ": "Good breakfast options and decent service, positioned well for overall preference.",
            "vL44Ky9VxUtOgteyHasRIA": "Average options for breakfast and service, placed lower due to less favorable feedback.",
            "qmcIsZjLpxd0V4RekSozmA": "While it has good taste, it falls short in service and breakfast offerings compared to others."
        }
    },
    "XrLXLru68mqIire2txXD7Q": {
        "kw": [
            "edinburgh",
            "place",
            "table",
            "royal mile",
            "dinner"
        ],
        "candidate": [
            "z57omnqRcAODGwbwMHEIyw",
            "xCeiBRuvqYXDXp9Vw7gmXw",
            "gqsU03i-WiyYHcBCdwObuQ",
            "l_tk3iLmyKfBUCK-6nBbHg",
            "6Kl2SQp-zGo-nsdImLykxw"
        ],
        "explanation": {
            "z57omnqRcAODGwbwMHEIyw": "Situated near the Royal Mile, this restaurant provides an excellent dinner atmosphere and menu.",
            "xCeiBRuvqYXDXp9Vw7gmXw": "Offers a beautiful space and is also not far from the Royal Mile, making it a convenient dinner choice.",
            "gqsU03i-WiyYHcBCdwObuQ": "A good dining option but a bit further from the Royal Mile compared to the top two.",
            "l_tk3iLmyKfBUCK-6nBbHg": "While it has good reviews, it does not fit the user’s preference for location as well.",
            "6Kl2SQp-zGo-nsdImLykxw": "This place is further away and less convenient for the Royal Mile dining preference."
        }
    },
    "8b5H6tG1riOQw2mEVrO--A": {
        "kw": [
            "edinburgh",
            "great price",
            "bill",
            "quick service",
            "pizza"
        ],
        "candidate": [
            "z57omnqRcAODGwbwMHEIyw",
            "vL44Ky9VxUtOgteyHasRIA",
            "S1eha-aT5c7WMk7lDLsW0A",
            "qesu3mk5yHeak9CUO4gRdQ",
            "sH-11zOhWubXobEeuMo2gg"
        ],
        "explanation": {
            "z57omnqRcAODGwbwMHEIyw": "This restaurant offers a variety of pizzas at great prices and is known for its quick service, making it a top choice.",
            "vL44Ky9VxUtOgteyHasRIA": "A second option with reasonable prices and good pizza, though slightly slower than the first.",
            "S1eha-aT5c7WMk7lDLsW0A": "While it has decent pizza, the service is not as quick as desired, placing it lower on the list.",
            "qesu3mk5yHeak9CUO4gRdQ": "Offers pizza but is generally pricier and service can be inconsistent.",
            "sH-11zOhWubXobEeuMo2gg": "Although popular, it lacks the speedy service and affordability the user prefers."
        }
    },
    "10RpPp6zKOTkJwE6JE7Ung": {
        "kw": [
            "edinburgh",
            "dogs",
            "vouchers",
            "best sushi",
            "sushi"
        ],
        "candidate": [
            "WWKFIRzivYgCWbsSRwtIAw",
            "OvbLKXkJCg8ZMHX9L5faIA",
            "W-kOZ946xRWBJZvxXhJ7DA",
            "0XcOq9ibk5DSXGcX1d0_rA"
        ],
        "explanation": {
            "WWKFIRzivYgCWbsSRwtIAw": "Known as one of the best sushi spots, this restaurant may offer a dog-friendly policy and accept vouchers.",
            "OvbLKXkJCg8ZMHX9L5faIA": "A solid sushi option, possibly accommodating dogs, making it a good second choice.",
            "W-kOZ946xRWBJZvxXhJ7DA": "Decent sushi but less information on dog-friendliness, hence it ranks lower.",
            "0XcOq9ibk5DSXGcX1d0_rA": "Further from the user's preferences as it does not primarily serve sushi and lacks dog-friendliness."
        }
    },
    "nr3S8p-lpf7K9W58eo_mLQ": {
        "kw": [
            "servers",
            "different things",
            "oysters",
            "nice restaurant",
            "nepalese food"
        ],
        "candidate": [
            "APN05ziH92oIox8EMxcceg",
            "Q0fcX_1wvdmffqEPa246rg",
            "KL1oif2ocGH2dJ4w-oT_Mg",
            "nbJXmGpdCxiBnovBkBtWcA"
        ],
        "explanation": {
            "APN05ziH92oIox8EMxcceg": "Recognized for its outstanding servers and a diverse menu that includes fresh oysters and appealing Nepalese dishes.",
            "Q0fcX_1wvdmffqEPa246rg": "Offers a nice dining atmosphere and is well-reviewed for service, along with a creative menu that may feature unique items.",
            "KL1oif2ocGH2dJ4w-oT_Mg": "A solid choice known for good service but lacks the specific appeal of oysters or Nepalese food.",
            "nbJXmGpdCxiBnovBkBtWcA": "While it has its merits, it falls behind in terms of refined dining experience and the desired cuisines."
        }
    },
    "K1tDoNEHiaAi-k4SFhCAng": {
        "kw": [
            "tea",
            "coffee",
            "area",
            "olives",
            "afternoon"
        ],
        "candidate": [
            "563C7-HcjhZwZSl4fK-mfQ",
            "S1eha-aT5c7WMk7lDLsW0A",
            "2HMvoTz_hw0noLzBWmyxcA",
            "gONO6UIMj8kFo1IvnROuuQ"
        ],
        "explanation": {
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant is well-known for its exceptional tea and coffee offerings, making it a perfect spot for an afternoon visit.",
            "S1eha-aT5c7WMk7lDLsW0A": "Offers a pleasant atmosphere with olives as part of their afternoon menu, catering to the user's likes.",
            "2HMvoTz_hw0noLzBWmyxcA": "While not as focused on tea and coffee, it does have a nice selection of light snacks, including olives, suitable for afternoon dining.",
            "gONO6UIMj8kFo1IvnROuuQ": "Although it has its merits, this restaurant does not align as closely with the user's preference for tea and coffee in the afternoon."
        }
    },
    "0VyDSM1uIrTU8LfaFh8JdA": {
        "kw": [
            "place",
            "lot",
            "service",
            "ace",
            "castle"
        ],
        "candidate": [
            "LUhVj-r2TtmFx6cyF9ilJg",
            "BXeXS9EaNN03AptFwElvjA",
            "csbBCysrsifg8N10c0eHCA",
            "nJdNzQ5Z278gTCFJ4HQBLA"
        ],
        "explanation": {
            "LUhVj-r2TtmFx6cyF9ilJg": "This restaurant has an excellent location and a strong reputation for service, aligning well with the user's top preferences.",
            "BXeXS9EaNN03AptFwElvjA": "Offers a good atmosphere and spacious lot, making it a favorable choice for the user.",
            "csbBCysrsifg8N10c0eHCA": "While decent, it lacks some elements of service quality compared to the top two restaurants.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Although it may have some strengths, it doesn’t match the overall quality and location needed to satisfy the user's specific preferences."
        }
    },
    "TNxBN-tg_2U0vBnTw-LZKQ": {
        "kw": [
            "chicken",
            "royal mile",
            "cocktail",
            "wife",
            "break"
        ],
        "candidate": [
            "563C7-HcjhZwZSl4fK-mfQ",
            "nJdNzQ5Z278gTCFJ4HQBLA",
            "Rx85NUdD6MhrgKxHr05NlQ",
            "6Kl2SQp-zGo-nsdImLykxw"
        ],
        "explanation": {
            "563C7-HcjhZwZSl4fK-mfQ": "This restaurant specializes in chicken dishes and has a great cocktail menu, making it ideal for a relaxing meal.",
            "nJdNzQ5Z278gTCFJ4HQBLA": "Known for its welcoming atmosphere and also offers a variety of chicken options and cocktails, perfect for a casual evening out.",
            "Rx85NUdD6MhrgKxHr05NlQ": "Although it has good food, it is less focused on chicken and cocktails compared to the top two choices.",
            "6Kl2SQp-zGo-nsdImLykxw": "This place has a good selection but may not specifically cater to chicken dishes or cocktails as well as others."
        }
    }
}