{
    "H8mXfh5XgGCqmMLwVH7k5A": {
        "kw": [
            "place",
            "instagram",
            "voucher",
            "other friends",
            "shop front"
        ],
        "candidate": [
            "MPzZuWpKpeLBa833zzL9IQ",
            "SxT7tgTNxkVuk67XEl7p8g",
            "2tGFUtUrE0DhwlX59pbArA",
            "x0Pk5Uvy0y63FSzcfmxRpQ",
            "fY1IkBnRft1KR0O2tqu7pg"
        ],
        "explanation": {
            "MPzZuWpKpeLBa833zzL9IQ": "Known for aesthetically pleasing presentation, ideal for Instagram posts.",
            "SxT7tgTNxkVuk67XEl7p8g": "Has a trendy shop front that is very inviting and popular among friends.",
            "2tGFUtUrE0DhwlX59pbArA": "Good overall experience with some unique features that are nice for groups.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "Offers occasional vouchers, which could be useful but lacks strong Instagram appeal.",
            "fY1IkBnRft1KR0O2tqu7pg": "While it's a solid option, it remains lesser-known and does not offer much visual allure."
        }
    },
    "QZqj0zcaOXV63mVVVLAhhQ": {
        "kw": [
            "place",
            "bar",
            "items",
            "steak",
            "desserts"
        ],
        "candidate": [
            "vVqxGrqt5ALxQjJGnntpKQ",
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "VEy3-SnvsKgWfGM_b2irbA",
            "n2CnBRKK82cWZ9a2OjS2xQ",
            "f6SN9YUSpb9AjS4hnFgyxg"
        ],
        "explanation": {
            "vVqxGrqt5ALxQjJGnntpKQ": "This restaurant offers a vibrant bar scene, excellent steak options, and a delectable dessert menu, fitting all user preferences.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Known for its quality steaks and a cozy bar atmosphere, it ranks high but slightly below the top option due to less focus on dessert.",
            "VEy3-SnvsKgWfGM_b2irbA": "While it provides a nice bar and decent menu items, its steak offerings are not as strong, placing it lower in the ranking.",
            "n2CnBRKK82cWZ9a2OjS2xQ": "Features some bar options and a limited steak selection, making it less appealing for the user’s specific desires.",
            "f6SN9YUSpb9AjS4hnFgyxg": "Although it may have some items, its overall menu lacks focus on steak and desserts, placing it at the bottom of the list."
        }
    },
    "J-NdrqdYuaBZnD8zo9pgjg": {
        "kw": [
            "place",
            "sandwiches",
            "dinner",
            "lot",
            "batter"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "I1wArJIYbFl2txUL6unC6A",
            "_HMiq7vSET4uhNScBdOJnw"
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "It is known for its extensive sandwich menu, making it ideal for dinner and accommodating various preferences.",
            "J9rMt_V1NX49rU3YUjh_7Q": "This restaurant offers a good variety of sandwiches and a casual atmosphere for dinner.",
            "I1wArJIYbFl2txUL6unC6A": "While it serves sandwiches, its selection is limited compared to the top two.",
            "_HMiq7vSET4uhNScBdOJnw": "It has the least focus on sandwiches, making it the least favorable option for the user's preferences."
        }
    },
    "XsIVj_AszmnnsykBrKgdHw": {
        "kw": [
            "place",
            "ingredients",
            "meat",
            "desserts",
            "people"
        ],
        "candidate": [
            "NbQH02mMYJ4r1RqvG2FDBA",
            "YnnYwfMEeSru_cJ_qKeofw",
            "x44o1_Dw4QsQZRtBJgwZaA",
            "wxf-tyEbFaatpJL-43JJpQ",
            "hSEGyy0-i1_ZXGIRySbgcg"
        ],
        "explanation": {
            "NbQH02mMYJ4r1RqvG2FDBA": "Known for its fresh ingredients and wide variety of meat dishes, along with delicious desserts.",
            "YnnYwfMEeSru_cJ_qKeofw": "Offers high-quality meat options and has a strong dessert menu, attracting groups of diners.",
            "x44o1_Dw4QsQZRtBJgwZaA": "Provides a decent selection of meats and ingredients, but its dessert options aren't as strong as the top two.",
            "wxf-tyEbFaatpJL-43JJpQ": "Features a good variety but lacks the standout meat and dessert offerings found in higher-ranked restaurants.",
            "hSEGyy0-i1_ZXGIRySbgcg": "Although it has a unique theme, its ingredients and meat choices don't cater well to the user’s preferences."
        }
    },
    "ok0fpB6QHkSUpTQpO3UAfA": {
        "kw": [
            "place",
            "edge",
            "dinner",
            "dish",
            "friends"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "fqhahiKsc6gPs5Sx4mf9Vg",
            "Pv0P0vYFIOlMPPfn18Wc7Q",
            "vVqxGrqt5ALxQjJGnntpKQ"
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "This restaurant offers a vibrant atmosphere and a range of dishes ideal for sharing with friends.",
            "fqhahiKsc6gPs5Sx4mf9Vg": "Known for its unique edge in cuisine, this spot is perfect for a fun dinner outing with a group.",
            "Pv0P0vYFIOlMPPfn18Wc7Q": "While still a good place, it may not provide the same level of social ambiance as the top choices.",
            "vVqxGrqt5ALxQjJGnntpKQ": "This restaurant is solid but does not specialize in shareable dishes, making it less suitable for a friendly dinner."
        }
    },
    "gekp2Z5I4vPGf2NeFnZX2A": {
        "kw": [
            "place",
            "dinner",
            "lot",
            "dish",
            "meat"
        ],
        "candidate": [
            "3n_2L-oqqw6noFKsb3qmeg",
            "7LFdimtQU3yrgiKyE53klQ",
            "YnnYwfMEeSru_cJ_qKeofw",
            "txwpCDw5Utu9WbM0VtYJqg",
            "ZhJ59SFPifQiTW0gAddfGw"
        ],
        "explanation": {
            "3n_2L-oqqw6noFKsb3qmeg": "This restaurant offers a wide variety of meat dishes suitable for dinner, making it ideal for the user's preferences.",
            "7LFdimtQU3yrgiKyE53klQ": "Known for its hearty portions and diverse meat options, this restaurant ranks highly for providing satisfying dinner experiences.",
            "YnnYwfMEeSru_cJ_qKeofw": "Offers a good selection of meat dishes and has a cozy ambiance suitable for dinner, maintaining relevance to the user's needs.",
            "txwpCDw5Utu9WbM0VtYJqg": "While it has decent meat offerings, it lacks the extensive quantity preferred by the user for dinner.",
            "ZhJ59SFPifQiTW0gAddfGw": "This restaurant is lower on the list due to limited meat options, which may not satisfy the user's request for meat-focused dishes."
        }
    },
    "JXrx-kwCSuf1xCkwuv0Nfw": {
        "kw": [
            "place",
            "truffle oil",
            "fries",
            "side",
            "meat"
        ],
        "candidate": [
            "f6SN9YUSpb9AjS4hnFgyxg",
            "l5lEOq47ne-jWKl67VKwZA",
            "kA5pZz-koXIlPaDJALDroQ",
            "ib_206uhcdzV7lNcCpniXA",
            "ko4q1Oj4iWvYSxoamlcEgw"
        ],
        "explanation": {
            "f6SN9YUSpb9AjS4hnFgyxg": "Offers a robust menu featuring truffle oil and fries, making it a top match for meat lovers.",
            "l5lEOq47ne-jWKl67VKwZA": "Features a great variety of sides and meat options, with some dishes incorporating truffle oil.",
            "kA5pZz-koXIlPaDJALDroQ": "Known for its excellent fries and solid meat choices, although truffle oil is a less frequent feature.",
            "ib_206uhcdzV7lNcCpniXA": "While it has good meat options, it lacks side dishes and the signature truffle oil flavor.",
            "ko4q1Oj4iWvYSxoamlcEgw": "Primarily focused on unique flavors but doesn't emphasize the requested elements as much as the others."
        }
    },
    "FQZZsU3J88IGF8n5e3XYZg": {
        "kw": [
            "place",
            "dinner",
            "lot",
            "bunch",
            "dish"
        ],
        "candidate": [
            "Rl318hUrGlkPJhMmNNZizQ",
            "P-X4kr5pDqXzhPEfa6RsTQ",
            "ko4q1Oj4iWvYSxoamlcEgw",
            "_HMiq7vSET4uhNScBdOJnw",
            "I1wArJIYbFl2txUL6unC6A"
        ],
        "explanation": {
            "Rl318hUrGlkPJhMmNNZizQ": "This restaurant features a diverse menu perfect for dinner with a satisfying selection of dishes.",
            "P-X4kr5pDqXzhPEfa6RsTQ": "Known for its ample seating and variety, this place can accommodate large groups looking for a fun dinner experience.",
            "ko4q1Oj4iWvYSxoamlcEgw": "Offers a good selection of dishes, but doesn't have as much variety as the top two options.",
            "_HMiq7vSET4uhNScBdOJnw": "While it has good food, it’s less suited for large gatherings compared to those ranked higher.",
            "I1wArJIYbFl2txUL6unC6A": "This option ranks last due to its limited dish variety for dinner and smaller dining space."
        }
    },
    "UwWtpjalT2xlJyglRRITug": {
        "kw": [
            "place",
            "dinner",
            "lot",
            "dish",
            "hours"
        ],
        "candidate": [
            "BYwoAKKtdSeylSN7QV8oNw",
            "7LFdimtQU3yrgiKyE53klQ",
            "Ku333V1F3_9MVKUJ72_ZBw",
            "_HMiq7vSET4uhNScBdOJnw",
            "x44o1_Dw4QsQZRtBJgwZaA"
        ],
        "explanation": {
            "BYwoAKKtdSeylSN7QV8oNw": "This restaurant is recommended first due to its diverse dinner options and flexible hours.",
            "7LFdimtQU3yrgiKyE53klQ": "Ranked second as it offers a broad range of dishes, making it a great choice for dinner.",
            "Ku333V1F3_9MVKUJ72_ZBw": "This one is notable for its operational hours and decent selection, suitable for a casual dinner.",
            "_HMiq7vSET4uhNScBdOJnw": "Previously ranked higher, but it has narrower options for dinner, placing it lower.",
            "x44o1_Dw4QsQZRtBJgwZaA": "This restaurant offers limited hours and fewer dish varieties, making it the least preferred option."
        }
    },
    "uOTNLX7v8MyEikB1yVux3Q": {
        "kw": [
            "place",
            "dinner",
            "group",
            "friends",
            "side"
        ],
        "candidate": [
            "9R5laAm5Kv4aBLVtH1gVnA",
            "txwpCDw5Utu9WbM0VtYJqg",
            "I1wArJIYbFl2txUL6unC6A",
            "MPzZuWpKpeLBa833zzL9IQ",
            "ZSpfF89JnQN6fiS8OhBlZQ"
        ],
        "explanation": {
            "9R5laAm5Kv4aBLVtH1gVnA": "This restaurant has a vibrant atmosphere perfect for groups and offers shareable side dishes that friends can enjoy together.",
            "txwpCDw5Utu9WbM0VtYJqg": "Known for its delicious sides and group-friendly dining options, this spot allows for a relaxed dinner experience with friends.",
            "I1wArJIYbFl2txUL6unC6A": "Offers a good variety of dishes suitable for sharing, making it a great option for friends dining together.",
            "MPzZuWpKpeLBa833zzL9IQ": "While a solid choice, it may not cater as well to large groups seeking a lively dining environment.",
            "ZSpfF89JnQN6fiS8OhBlZQ": "Although it provides good food, it’s more suited for quieter meals and may lack the group-friendly atmosphere desired for dinner with friends."
        }
    },
    "sZ3mumX9WjJqp6qrjPPUBQ": {
        "kw": [
            "place",
            "bar",
            "sandwiches",
            "dinner",
            "lot"
        ],
        "candidate": [
            "lE9qVePgvolkhw6C3Cdkeg",
            "T7ekp7FiffoWDq53hbZDhg",
            "_HMiq7vSET4uhNScBdOJnw",
            "YkVRDcEa7vZK65u-tlL9tQ"
        ],
        "explanation": {
            "lE9qVePgvolkhw6C3Cdkeg": "This restaurant has a vibrant bar scene and offers a variety of sandwiches suitable for dinner.",
            "T7ekp7FiffoWDq53hbZDhg": "Known for its lively atmosphere and good selection of sandwiches, it's a great choice for a dinner outing.",
            "_HMiq7vSET4uhNScBdOJnw": "While it also caters to dinner, it lacks the bar atmosphere that enhances the dining experience.",
            "YkVRDcEa7vZK65u-tlL9tQ": "This restaurant is less focused on sandwiches and bar options compared to the others, which may not meet the user's preferences as closely."
        }
    },
    "g8VcsAZyMrak3vdrLr3b7w": {
        "kw": [
            "place",
            "dinner",
            "group",
            "friends",
            "meat"
        ],
        "candidate": [
            "JHi4LCxdbpXthg98sQiicQ",
            "rXhvV-YyZaJLjgOnz7_jkA",
            "tz8VEeIOoM5Cu1NSnC2JIQ",
            "_HMiq7vSET4uhNScBdOJnw"
        ],
        "explanation": {
            "JHi4LCxdbpXthg98sQiicQ": "This restaurant is known for its vibrant atmosphere and hearty meat options, making it ideal for a fun group dinner.",
            "rXhvV-YyZaJLjgOnz7_jkA": "Offers a diverse meat menu with ample seating, great for groups looking to enjoy different dishes together.",
            "tz8VEeIOoM5Cu1NSnC2JIQ": "Though it has good meat options, its atmosphere is slightly less suited for a lively group dinner compared to the top choices.",
            "_HMiq7vSET4uhNScBdOJnw": "While excellent for smaller gatherings, it may not accommodate larger groups as comfortably as the others."
        }
    },
    "1tQfj737uhgdKcQ-5akTdA": {
        "kw": [
            "place",
            "dinner",
            "lot",
            "dish",
            "spices"
        ],
        "candidate": [
            "M-PobdAR2gJhPyLR_WzMCQ",
            "OExxlOVjUIDh3TFjPzbSDA",
            "58PYKm0WgNunAzuS4Qu1Zg",
            "7LFdimtQU3yrgiKyE53klQ",
            "qs6gA9Y5sRzpXnm_4QaP0Q"
        ],
        "explanation": {
            "M-PobdAR2gJhPyLR_WzMCQ": "This restaurant is known for its extensive menu rich in exotic spices, making it perfect for a flavorful dinner experience.",
            "OExxlOVjUIDh3TFjPzbSDA": "A great option for a sit-down dinner with plenty of space and a diverse selection of dishes that feature bold flavors.",
            "58PYKm0WgNunAzuS4Qu1Zg": "While it offers good dishes, it doesn't provide as much variety in spices as the top two options.",
            "7LFdimtQU3yrgiKyE53klQ": "This restaurant has a cozy atmosphere but is slightly less known for its spiced offerings compared to the higher-ranked options.",
            "qs6gA9Y5sRzpXnm_4QaP0Q": "Although it has good food, the lack of a variety of spice-rich dishes makes it less suitable for the user's specific preferences."
        }
    },
    "1UZs_9wFHP4NR_62LwGD6g": {
        "kw": [
            "place",
            "shop",
            "sandwiches",
            "dinner",
            "lot"
        ],
        "candidate": [
            "MPzZuWpKpeLBa833zzL9IQ",
            "x0Pk5Uvy0y63FSzcfmxRpQ",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "_HMiq7vSET4uhNScBdOJnw",
            "_7nMWBmfFvk9S3tKG3Ip_g"
        ],
        "explanation": {
            "MPzZuWpKpeLBa833zzL9IQ": "This restaurant offers a robust selection of sandwiches suitable for dinner and has a welcoming atmosphere.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "Known for its diverse sandwich choices and casual dining experience, making it a great fit for dinner.",
            "vVqxGrqt5ALxQjJGnntpKQ": "This spot provides hearty sandwiches and is ideal for dinner with friends or family, though slightly less extensive in variety.",
            "_HMiq7vSET4uhNScBdOJnw": "Offers some sandwich options but is more limited in dinner seating, placing it lower in the ranking.",
            "_7nMWBmfFvk9S3tKG3Ip_g": "While it may have good sandwiches, it lacks the dinner vibe and variety that the user prefers."
        }
    },
    "TUAiW8Lcdla5Ii53kV6RFw": {
        "kw": [
            "place",
            "sandwiches",
            "dinner",
            "lot",
            "group"
        ],
        "candidate": [
            "VEy3-SnvsKgWfGM_b2irbA",
            "NbQH02mMYJ4r1RqvG2FDBA",
            "5LMkTnMXOxlce_LwUNhpCQ",
            "J3ijSN86u_Pg42BZjkDM_g",
            "EqdAzi9c5xuhxN9brmEaZw."
        ],
        "explanation": {
            "VEy3-SnvsKgWfGM_b2irbA": "This place offers a spacious setting perfect for groups and a variety of sandwich options for dinner.",
            "NbQH02mMYJ4r1RqvG2FDBA": "Known for its delicious sandwiches and a casual atmosphere suitable for larger gatherings during dinner time.",
            "5LMkTnMXOxlce_LwUNhpCQ": "A popular spot for sandwiches, though slightly smaller in capacity for groups compared to the top two.",
            "J3ijSN86u_Pg42BZjkDM_g": "Offers a decent sandwich selection, but lacks the atmosphere for larger groups and is better suited for smaller parties.",
            "EqdAzi9c5xuhxN9brmEaZw": "While it has good food, it's not ideal for groups during dinner as space may be limited."
        }
    },
    "ZNyfGsIwsedPlpjmoaq3Eg": {
        "kw": [
            "place",
            "instagram",
            "bar",
            "dinner",
            "lot"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "5RFNZZvtfF9uHVSUeYwzbQ",
            "txwpCDw5Utu9WbM0VtYJqg",
            "x44o1_Dw4QsQZRtBJgwZaA"
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Known for its lively atmosphere and visually appealing dishes, making it perfect for Instagram.",
            "5RFNZZvtfF9uHVSUeYwzbQ": "Offers a great bar selection with a vibrant dinner vibe, appealing to social media enthusiasts.",
            "txwpCDw5Utu9WbM0VtYJqg": "Provides a nice dinner experience but lacks the strong Instagram presence compared to the top two.",
            "x44o1_Dw4QsQZRtBJgwZaA": "While decent, it ranks lower due to less of an emphasis on bar culture and social media appeal."
        }
    },
    "Jd4LuJ2nCNBMayehLhhL4w": {
        "kw": [
            "place",
            "dinner",
            "steak",
            "dessert",
            "people"
        ],
        "candidate": [
            "P7-GGakh0UR80xIl93t07Q",
            "x44o1_Dw4QsQZRtBJgwZaA",
            "VEy3-SnvsKgWfGM_b2irbA",
            "NAsglQPCdPMJV_RkHge27A",
            "hSEGyy0-i1_ZXGIRySbgcg"
        ],
        "explanation": {
            "P7-GGakh0UR80xIl93t07Q": "This restaurant is highly rated for its steak offerings and has a reputation for excellent desserts, making it ideal for dinner with friends or family.",
            "x44o1_Dw4QsQZRtBJgwZaA": "This spot provides a fantastic steak experience and is known for its inviting atmosphere, perfect for social gatherings.",
            "VEy3-SnvsKgWfGM_b2irbA": "While it does offer great steak options, it's slightly lower on the dessert front but still a solid choice for dinner.",
            "NAsglQPCdPMJV_RkHge27A": "This restaurant is known for a good steak but is better suited for smaller groups, which may not align fully with the user's preference for a place to enjoy with more people.",
            "hSEGyy0-i1_ZXGIRySbgcg": "Although it has some decent offerings, it ranks lower due to a weaker selection of steak and dessert options compared to the others."
        }
    },
    "I0Ml519BP2Ya3-Ec5GgVgA": {
        "kw": [
            "place",
            "shop",
            "bar",
            "dinner",
            "bunch"
        ],
        "candidate": [
            "MqdAYfl1p_c1144i48k6jw",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "BYwoAKKtdSeylSN7QV8oNw",
            "xpHn6SAJ3xqJGgzZTASrSg",
            "vVqxGrqt5ALxQjJGnntpKQ"
        ],
        "explanation": {
            "MqdAYfl1p_c1144i48k6jw": "Ranked highest for its strong focus on dinner offerings, making it ideal for the user's dining preference.",
            "J9rMt_V1NX49rU3YUjh_7Q": "Also features robust dinner options, with a good atmosphere for evening meals.",
            "BYwoAKKtdSeylSN7QV8oNw": "A decent choice for dinner but slightly less appealing compared to the top two.",
            "xpHn6SAJ3xqJGgzZTASrSg": "More of a casual spot, not fully aligning with a sit-down dinner preference.",
            "vVqxGrqt5ALxQjJGnntpKQ": "Least relevant for dinner compared to others, more suited for a casual bar experience."
        }
    },
    "dpKkBNCSrXgwgqqXd5JqOw": {
        "kw": [
            "place",
            "bar",
            "lot",
            "hours",
            "waiter"
        ],
        "candidate": [
            "vVqxGrqt5ALxQjJGnntpKQ",
            "ymAw53bQVppVV7T40fNgRw",
            "ahlZC7XOKN-XJ7P4sPZrRg",
            "bjL1PC2e9dvjBVewmoXYwQ",
            "x44o1_Dw4QsQZRtBJgwZaA"
        ],
        "explanation": {
            "vVqxGrqt5ALxQjJGnntpKQ": "This restaurant has excellent parking facilities, a vibrant bar, and highly rated waitstaff.",
            "ymAw53bQVppVV7T40fNgRw": "Known for a good selection of drinks at the bar and convenient hours, it ranks high for sociability.",
            "ahlZC7XOKN-XJ7P4sPZrRg": "Offers good waiter service and decent parking, but lacks a bar, slightly lowering its rank.",
            "bjL1PC2e9dvjBVewmoXYwQ": "While it has favorable hours and service, the absence of a bar and limited parking options affect its appeal.",
            "x44o1_Dw4QsQZRtBJgwZaA": "This restaurant has the least appeal based on user preferences due to poor parking and waitstaff reviews."
        }
    },
    "cfDwnBtcWi0Bm40lQUHCMg": {
        "kw": [
            "place",
            "bar",
            "people",
            "service",
            "food"
        ],
        "candidate": [
            "ahlZC7XOKN-XJ7P4sPZrRg",
            "kA5pZz-koXIlPaDJALDroQ",
            "d3vB2tlgTEapMU_kGiXRoQ",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "pnjp8dim5eVWHIX7oYnEbQ."
        ],
        "explanation": {
            "ahlZC7XOKN-XJ7P4sPZrRg": "This restaurant is known for its vibrant bar atmosphere and exceptional service, making it a great place for social gatherings.",
            "kA5pZz-koXIlPaDJALDroQ": "While also offering a lively setting, it ranks slightly lower due to less focus on food compared to the top choice.",
            "d3vB2tlgTEapMU_kGiXRoQ": "Offers good food and service, though the atmosphere isn't as lively as the top two.",
            "J9rMt_V1NX49rU3YUjh_7Q": "Generally good service, but the ambiance and crowd are more subdued, making it less appealing for socializing.",
            "pnjp8dim5eVWHIX7oYnEbQ": "Although it has decent food, it doesn’t meet the user’s social dynamics as effectively as the others."
        }
    },
    "5GUadxRaN73Jf0fdhaVCFw": {
        "kw": [
            "place",
            "bar",
            "dinner",
            "service",
            "vegetables"
        ],
        "candidate": [
            "T7ekp7FiffoWDq53hbZDhg",
            "AQEEH7JP1DFrvFuMi6TP2Q",
            "Pv0P0vYFIOlMPPfn18Wc7Q",
            "M3L6py5NM0_WjIT7410M0Q",
            "f6SN9YUSpb9AjS4hnFgyxg"
        ],
        "explanation": {
            "T7ekp7FiffoWDq53hbZDhg": "This restaurant stands out for its vibrant bar scene and extensive vegetable-based menu, alongside excellent service.",
            "AQEEH7JP1DFrvFuMi6TP2Q": "Known for a cozy atmosphere and solid vegetable options, it has good service but is less lively than the top choice.",
            "Pv0P0vYFIOlMPPfn18Wc7Q": "A good dinner spot with decent vegetable selections and acceptable service but lacks a strong bar experience.",
            "M3L6py5NM0_WjIT7410M0Q": "While it serves a variety of dishes, the focus on vegetables is weaker, and the bar is less appealing.",
            "f6SN9YUSpb9AjS4hnFgyxg": "This place offers a limited selection of vegetables and may not meet the user's preference for a bar setting."
        }
    },
    "2zlt0VIv60yPKkCZ9TuHEg": {
        "kw": [
            "place",
            "top",
            "rice",
            "meal",
            "taste"
        ],
        "candidate": [
            "CdAmgWWCabZQoYNNWOKcEw",
            "ZhJ59SFPifQiTW0gAddfGw",
            "fY1IkBnRft1KR0O2tqu7pg",
            "KPrdWch1680ihzVe3C-s3w",
            "hSEGyy0-i1_ZXGIRySbgcg"
        ],
        "explanation": {
            "CdAmgWWCabZQoYNNWOKcEw": "This restaurant excels in flavorful rice dishes and has received high praise for its taste.",
            "ZhJ59SFPifQiTW0gAddfGw": "Known for its unique rice combinations and savory meals, this place ranks high for taste.",
            "fY1IkBnRft1KR0O2tqu7pg": "While popular, it offers a more limited rice selection compared to the top two.",
            "KPrdWch1680ihzVe3C-s3w": "This restaurant has good options but lacks the standout rice dish that others provide.",
            "hSEGyy0-i1_ZXGIRySbgcg": "Although well-rated, it prioritizes other cuisines that may not align fully with rice-focused meals."
        }
    },
    "9tliQ8H9xcGN8iVl55nx_g": {
        "kw": [
            "place",
            "instagram",
            "bar",
            "dinner",
            "lot"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "NbQH02mMYJ4r1RqvG2FDBA",
            "Pv0P0vYFIOlMPPfn18Wc7Q",
            "T7ekp7FiffoWDq53hbZDhg"
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "This restaurant offers a lively bar scene and is visually appealing for Instagram, making it ideal for your preferences.",
            "NbQH02mMYJ4r1RqvG2FDBA": "A great spot for dinner with a robust atmosphere that is also Instagram-friendly, although it might be slightly less spacious than the top choice.",
            "Pv0P0vYFIOlMPPfn18Wc7Q": "Offers decent ambiance and is a good choice for dinner but lacks the same level of Instagrammable aspects compared to the top two.",
            "T7ekp7FiffoWDq53hbZDhg": "While it has a nice setting, it does not offer the social or bar elements that align with your preferences as effectively as the others."
        }
    },
    "YUB60ublKhL0N3sMMYh6aQ": {
        "kw": [
            "place",
            "friends",
            "food",
            "great place",
            "price"
        ],
        "candidate": [
            "tRPHSd0ow1hsqMRxyMePeg",
            "AQEEH7JP1DFrvFuMi6TP2Q",
            "0UVlw30JrYGl79rT0XIEmw",
            "BYwoAKKtdSeylSN7QV8oNw",
            "I1wArJIYbFl2txUL6unC6A"
        ],
        "explanation": {
            "tRPHSd0ow1hsqMRxyMePeg": "This restaurant offers a vibrant atmosphere and a menu that is both affordable and appealing for food-sharing among friends.",
            "AQEEH7JP1DFrvFuMi6TP2Q": "A good place for groups, with reasonably priced options that are sure to please a crowd.",
            "0UVlw30JrYGl79rT0XIEmw": "While still a solid choice, it is a bit pricier compared to the top two, making it less ideal for budget-conscious group outings.",
            "BYwoAKKtdSeylSN7QV8oNw": "This place has great food but lacks the lively ambiance that enhances social dining experiences.",
            "I1wArJIYbFl2txUL6unC6A": "Although it offers good food, it is more expensive and less suitable for larger groups compared to the others."
        }
    },
    "OKbv3KDqjEmYQeADqevsnA": {
        "kw": [
            "place",
            "dinner",
            "lot",
            "dish",
            "friends"
        ],
        "candidate": [
            "i5dxKKLe2kJ8WbPUXilPGg",
            "ib_206uhcdzV7lNcCpniXA",
            "xD3L3JhNxsAfQikOHWHa4w",
            "x0Pk5Uvy0y63FSzcfmxRpQ"
        ],
        "explanation": {
            "i5dxKKLe2kJ8WbPUXilPGg": "This restaurant offers a spacious dining area ideal for groups and serves a wide variety of dishes perfect for sharing.",
            "ib_206uhcdzV7lNcCpniXA": "Known for its ample seating and diverse menu, making it great for friends enjoying dinner together.",
            "xD3L3JhNxsAfQikOHWHa4w": "While a bit smaller, it still caters well to groups and has a delightful selection of dishes.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "Though it has some good options, it lacks the space and variety needed for an ideal group dinner setting."
        }
    },
    "evIjahgjJHGsuunzD9aT1A": {
        "kw": [
            "place",
            "service",
            "food",
            "drinks",
            "menu"
        ],
        "candidate": [
            "5RFNZZvtfF9uHVSUeYwzbQ",
            "5LMkTnMXOxlce_LwUNhpCQ",
            "I1wArJIYbFl2txUL6unC6A",
            "6xx2FpMxjwabEHz_t2MiZg",
            "wyDfBs1tYSIiBO7HCPKNTg."
        ],
        "explanation": {
            "5RFNZZvtfF9uHVSUeYwzbQ": "This restaurant excels in ambiance and service, providing a great overall dining experience.",
            "5LMkTnMXOxlce_LwUNhpCQ": "Known for its unique menu and quality food, it stands out for a memorable meal.",
            "I1wArJIYbFl2txUL6unC6A": "Offers a good variety of drinks, but the food consistency is slightly less reliable.",
            "6xx2FpMxjwabEHz_t2MiZg": "Competitive in service, but lacks the menu innovation and vibe of the top choices.",
            "wyDfBs1tYSIiBO7HCPKNTg": "Provides decent food and service, but does not match the overall experience of the others."
        }
    },
    "HUodv8WGv4xo7EabaN3dqQ": {
        "kw": [
            "place",
            "sandwiches",
            "dinner",
            "items",
            "group"
        ],
        "candidate": [
            "txwpCDw5Utu9WbM0VtYJqg",
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "_HMiq7vSET4uhNScBdOJnw",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "_7nMWBmfFvk9S3tKG3Ip_g"
        ],
        "explanation": {
            "txwpCDw5Utu9WbM0VtYJqg": "This restaurant has a comprehensive sandwich menu ideal for groups and offers a vibrant place for dinner.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "It provides good sandwich options and has a suitable atmosphere for group dining, making it a strong second choice.",
            "_HMiq7vSET4uhNScBdOJnw": "Offers a decent variety of sandwiches, but the group accommodations are slightly limited compared to the top two.",
            "J9rMt_V1NX49rU3YUjh_7Q": "While it's good for dinner, the sandwich selection is less varied, making it less favorable for the user's preferences.",
            "_7nMWBmfFvk9S3tKG3Ip_g": "Although it has good items, it doesn’t specialize in sandwiches or provide the best group dining experience, placing it last."
        }
    },
    "9QDWLRxdU6uOscehvVt6Tw": {
        "kw": [
            "place",
            "items",
            "sweetness",
            "dessert",
            "service"
        ],
        "candidate": [
            "vVqxGrqt5ALxQjJGnntpKQ",
            "jLcBOqa-UT6qugFgZqjNvA",
            "IC15vAUX4EiMlWxxMehohw",
            "Rwzp59f3Ia-v2V8Ku0zZWQ"
        ],
        "explanation": {
            "vVqxGrqt5ALxQjJGnntpKQ": "This restaurant excels in providing a great place ambiance and has a diverse menu with a focus on desserts, making it a top choice.",
            "jLcBOqa-UT6qugFgZqjNvA": "Known for excellent service and a selection of sweet items, it ranks high for dessert lovers.",
            "IC15vAUX4EiMlWxxMehohw": "While it has decent items and service, it lacks the dessert variety to compete with the top two.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "It falls to the bottom as it doesn't fully meet the user's preferences concerning sweetness and a pleasant dining atmosphere."
        }
    },
    "MmJ-gKRi3hRzBlVqEUEkOg": {
        "kw": [
            "place",
            "lunch time",
            "dish",
            "friends",
            "try"
        ],
        "candidate": [
            "WdgQzBYDtTgcLahHvtiokA",
            "U3i7AaegudvpmDL23_wEmQ",
            "xD3L3JhNxsAfQikOHWHa4w",
            "58PYKm0WgNunAzuS4Qu1Zg",
            "CfFGKTJ1RgdTYpY0fj1E5w"
        ],
        "explanation": {
            "WdgQzBYDtTgcLahHvtiokA": "This restaurant offers a friendly atmosphere ideal for lunching with friends and a diverse menu.",
            "U3i7AaegudvpmDL23_wEmQ": "Known for its great lunch specials, this spot is perfect for trying out new dishes with the group.",
            "xD3L3JhNxsAfQikOHWHa4w": "A cozy place with a well-rounded menu that's perfect for a casual midday meal.",
            "58PYKm0WgNunAzuS4Qu1Zg": "While traditionally known for dinner, it does offer interesting lunch options making it worth considering.",
            "CfFGKTJ1RgdTYpY0fj1E5w": "Although a strong contender, it is more suited for dinners and may not be as lively during lunchtime for groups of friends."
        }
    },
    "j8UlPZDO6K5iI8T7LKPqEA": {
        "kw": [
            "place",
            "shop",
            "lunch time",
            "items",
            "group"
        ],
        "candidate": [
            "J9rMt_V1NX49rU3YUjh_7Q",
            "at7wfECnjgIJi5o7gL8fyQ",
            "j_aIYB4uGOR45jAXivFNZQ",
            "cEX4Cw8q2ftBrbpCvInf0w"
        ],
        "explanation": {
            "J9rMt_V1NX49rU3YUjh_7Q": "This restaurant is ideal for a large group looking for a varied lunch menu and a lively atmosphere.",
            "at7wfECnjgIJi5o7gL8fyQ": "A great choice for lunch with convenient takeout options, perfect for those short on time.",
            "j_aIYB4uGOR45jAXivFNZQ": "Offers a unique menu but is less suitable for larger groups or peak lunch times.",
            "cEX4Cw8q2ftBrbpCvInf0w": "While a solid choice overall, it doesn't cater as well to group dining compared to the higher-ranked options."
        }
    },
    "0gBy-cIXe0DQKhFjifu68Q": {
        "kw": [
            "place",
            "bar",
            "group",
            "bunch",
            "dish"
        ],
        "candidate": [
            "T7ekp7FiffoWDq53hbZDhg",
            "O79uzVop5yqobf3bdjZzQg",
            "7LFdimtQU3yrgiKyE53klQ",
            "LFknVw6uTIaL-MY_RqkN7g",
            "_HMiq7vSET4uhNScBdOJnw"
        ],
        "explanation": {
            "T7ekp7FiffoWDq53hbZDhg": "This restaurant has a lively bar scene ideal for groups and offers a diverse menu.",
            "O79uzVop5yqobf3bdjZzQg": "This place is known for its great atmosphere and variety of dishes, making it group-friendly.",
            "7LFdimtQU3yrgiKyE53klQ": "This option provides a fun bar environment, though slightly less focus on group dining compared to the top two.",
            "LFknVw6uTIaL-MY_RqkN7g": "Although good for casual dining, it lacks a vibrant bar setting for larger gatherings.",
            "_HMiq7vSET4uhNScBdOJnw": "This restaurant is less appealing for groups seeking a bar experience or extensive dish variety."
        }
    },
    "FAi3gMEwxhnh9tZRQiWwTg": {
        "kw": [
            "place",
            "group",
            "dish",
            "friends",
            "waiter"
        ],
        "candidate": [
            "I1wArJIYbFl2txUL6unC6A",
            "KmKkhD-97CqPvokq5JIoBA",
            "uQu5DtnXZZ8XVfBKldKnag",
            "x44o1_Dw4QsQZRtBJgwZaA",
            "0hGE_UiUMAcF3PABcE-M4Q"
        ],
        "explanation": {
            "I1wArJIYbFl2txUL6unC6A": "Best suited for groups with a variety of dishes and excellent service from the waitstaff.",
            "KmKkhD-97CqPvokq5JIoBA": "Offers a good atmosphere for friends and a solid dish selection, though service may vary.",
            "uQu5DtnXZZ8XVfBKldKnag": "Great for groups with a lively environment and decent dish offerings, but slightly less consistent service.",
            "x44o1_Dw4QsQZRtBJgwZaA": "While it has good dishes, it’s less ideal for larger groups and the service can be hit or miss.",
            "0hGE_UiUMAcF3PABcE-M4Q": "Typically a quieter setting with limited dish options, not as suitable for a group of friends."
        }
    },
    "fAY7S51J_9uMMZRVTO8f3w": {
        "kw": [
            "place",
            "dinner",
            "items",
            "group",
            "dish"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "_HMiq7vSET4uhNScBdOJnw",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "txwpCDw5Utu9WbM0VtYJqg"
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "This restaurant offers a diverse menu that is well-suited for groups, making it ideal for a dinner setting.",
            "_HMiq7vSET4uhNScBdOJnw": "Known for its unique and shareable dishes, this spot is perfect for a group gathering during dinner.",
            "J9rMt_V1NX49rU3YUjh_7Q": "Offers excellent dinner options but has a more limited menu, making it slightly less favorable for diverse group preferences.",
            "txwpCDw5Utu9WbM0VtYJqg": "While it has great items, it's not as group-friendly for dinner compared to the others."
        }
    },
    "a7y3gCq9Vwv89NRtUTtyJw": {
        "kw": [
            "place",
            "other friends",
            "edge",
            "shop",
            "bar"
        ],
        "candidate": [
            "J9rMt_V1NX49rU3YUjh_7Q",
            "-WRbjOIgvQQ3jlJnvKUBNA",
            "6xx2FpMxjwabEHz_t2MiZg",
            "_HMiq7vSET4uhNScBdOJnw",
            "ahlZC7XOKN-XJ7P4sPZrRg"
        ],
        "explanation": {
            "J9rMt_V1NX49rU3YUjh_7Q": "This restaurant has a vibrant bar scene, making it ideal for socializing with friends.",
            "-WRbjOIgvQQ3jlJnvKUBNA": "This place offers a trendy edge and a great atmosphere for group outings.",
            "6xx2FpMxjwabEHz_t2MiZg": "This restaurant has a chill vibe, perfect for casual meet-ups with friends.",
            "_HMiq7vSET4uhNScBdOJnw": "Although good, it lacks the lively feel desired by the user, placing it lower.",
            "ahlZC7XOKN-XJ7P4sPZrRg": "This location is better suited for a quieter experience, which does not align with the user’s preferences."
        }
    },
    "1wWXchH7yRlFCxfC4dkQnA": {
        "kw": [
            "place",
            "shop",
            "dinner",
            "lot",
            "items"
        ],
        "candidate": [
            "-U4BnQL4VC3dkRDUZL0i8Q",
            "6LgTc7CZlXCd1Pxq3BiVcw",
            "txwpCDw5Utu9WbM0VtYJqg",
            "Rwzp59f3Ia-v2V8Ku0zZWQ."
        ],
        "explanation": {
            "-U4BnQL4VC3dkRDUZL0i8Q": "This restaurant offers a spacious layout and a diverse menu, making it ideal for dinner.",
            "6LgTc7CZlXCd1Pxq3BiVcw": "This place has a good reputation for dinner options and a variety of dishes, though it is slightly smaller.",
            "txwpCDw5Utu9WbM0VtYJqg": "While it has decent options, it doesn't provide the same level of space and variety as the top two.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "This restaurant is less favorable in terms of items offered and overall space for a comfortable dining experience."
        }
    },
    "Nd-GGF74T3RKlty7PqM48A": {
        "kw": [
            "place",
            "lot",
            "try",
            "broth",
            "restaurant"
        ],
        "candidate": [
            "I1wArJIYbFl2txUL6unC6A",
            "n5vQCdHfl2Dm7r4l5FW8Cw",
            "CTYFfHq1SWFyCeJ-KyIgOQ",
            "IC15vAUX4EiMlWxxMehohw"
        ],
        "explanation": {
            "I1wArJIYbFl2txUL6unC6A": "This restaurant is known for its diverse broth options and comfortable atmosphere, making it a top choice for trying new flavors.",
            "n5vQCdHfl2Dm7r4l5FW8Cw": "Offers a solid variety of well-prepared broths and is appreciated for its spacious dining area.",
            "CTYFfHq1SWFyCeJ-KyIgOQ": "While it serves great broth, the space may not be as inviting for those who value ambiance.",
            "IC15vAUX4EiMlWxxMehohw": "This restaurant, although popular, has limited broth options compared to the others, which may not satisfy the user’s desire to try different kinds."
        }
    },
    "JxQmVUwbUBAZiji4kZtVSg": {
        "kw": [
            "place",
            "sandwiches",
            "dinner",
            "lot",
            "group"
        ],
        "candidate": [
            "sxQdEEfKRviWRymOoH9UiA",
            "JHi4LCxdbpXthg98sQiicQ",
            "_HMiq7vSET4uhNScBdOJnw",
            "BYwoAKKtdSeylSN7QV8oNw",
            "lE9qVePgvolkhw6C3Cdkeg"
        ],
        "explanation": {
            "sxQdEEfKRviWRymOoH9UiA": "This restaurant is known for its exceptional sandwiches and has ample space for groups, making it the top choice.",
            "JHi4LCxdbpXthg98sQiicQ": "A solid option that provides good sandwiches and a friendly atmosphere for dinner with friends.",
            "_HMiq7vSET4uhNScBdOJnw": "Offers a limited sandwich menu but is set up to handle larger parties well.",
            "BYwoAKKtdSeylSN7QV8oNw": "Known for quality food, but the selection of sandwiches is not as extensive as desired.",
            "lE9qVePgvolkhw6C3Cdkeg": "While it has a great ambiance, it lacks group seating and sandwich options, placing it last."
        }
    },
    "qnIyZwh99Jhww8BhsfUg_w": {
        "kw": [
            "place",
            "fries",
            "bowl",
            "price",
            "sgd"
        ],
        "candidate": [
            "new3Ny6i5ZJVn3m-i4A2Tg",
            "Eo6RtLvIXcgSge6Z4Z6fFQ",
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "EJNkmXMDWurCPjOZe_WXAg",
            "xYGH13XolFh_yiQRo7bPJQ"
        ],
        "explanation": {
            "new3Ny6i5ZJVn3m-i4A2Tg": "This restaurant offers a variety of bowls and has highly-rated fries, making it very appealing for the user's preferences.",
            "Eo6RtLvIXcgSge6Z4Z6fFQ": "Known for its great value and options for both bowls and fries, it ranks closely behind the top pick.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Offers decent meal options within budget and includes fries but is slightly lower in overall appeal.",
            "EJNkmXMDWurCPjOZe_WXAg": "While it has some bowl options, the fries are less favored, affecting its ranking negatively.",
            "xYGH13XolFh_yiQRo7bPJQ": "This place has limited offerings that align with the user’s preferences, making it the least favorable choice."
        }
    },
    "8NyAypqBJG2JiSXBu7Vlug": {
        "kw": [
            "place",
            "dinner",
            "friends",
            "service",
            "food"
        ],
        "candidate": [
            "MqdAYfl1p_c1144i48k6jw",
            "1nw-_Bm8sivTBZ7Z-uiVCA",
            "o1_iIC0rU2yuF3SZvf6IjA",
            "x0Pk5Uvy0y63FSzcfmxRpQ",
            "_HMiq7vSET4uhNScBdOJnw"
        ],
        "explanation": {
            "MqdAYfl1p_c1144i48k6jw": "Known for its outstanding food quality and inviting atmosphere, making it perfect for friends gathering.",
            "1nw-_Bm8sivTBZ7Z-uiVCA": "Offers great service and a lively environment, ideal for dinner with friends.",
            "o1_iIC0rU2yuF3SZvf6IjA": "While it has good food, it lacks some of the ambiance desired for a social dinner.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "Provides decent service but is less suited for a more intimate dinner setting.",
            "_HMiq7vSET4uhNScBdOJnw": "Overall good, but it does not stand out compared to the others in terms of food and service for a dinner experience."
        }
    },
    "HO35wso-psqx0GF--QSwGA": {
        "kw": [
            "place",
            "dinner",
            "dish",
            "ingredients",
            "people"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "ADtSvzL_abKwWPM1EL2yJw",
            "BfGgttAzEPx9v7b8Sgkedw",
            "J9rMt_V1NX49rU3YUjh_7Q"
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "This restaurant features a diverse menu, aligning well with the user's interest in specific dishes and ingredient variety.",
            "ADtSvzL_abKwWPM1EL2yJw": "Known for its inviting atmosphere and suitable for dinner gatherings, making it a great choice for social dining.",
            "BfGgttAzEPx9v7b8Sgkedw": "While it has popular dishes, it lacks variety in ingredients, placing it lower on the list.",
            "J9rMt_V1NX49rU3YUjh_7Q": "This restaurant, though previously ranked higher, does not meet the user's preferences as strongly regarding specific ingredients and dinner focus."
        }
    },
    "jVoWhV1DT0peojYuH3HbLg": {
        "kw": [
            "place",
            "sweetness",
            "meat",
            "food",
            "broth"
        ],
        "candidate": [
            "MqdAYfl1p_c1144i48k6jw",
            "dFYfZsc-SUwRpDEgJiIoXA",
            "_HMiq7vSET4uhNScBdOJnw",
            "P-X4kr5pDqXzhPEfa6RsTQ",
            "uQu5DtnXZZ8XVfBKldKnag"
        ],
        "explanation": {
            "MqdAYfl1p_c1144i48k6jw": "This restaurant offers a strong variety of meaty dishes with a well-balanced broth, aligning well with the user's preferences.",
            "dFYfZsc-SUwRpDEgJiIoXA": "Known for its sweet flavor profiles and hearty meat options, making it a perfect fit for the user's tastes.",
            "_HMiq7vSET4uhNScBdOJnw": "This place has a focus on food quality and decent broth, slightly less sweet than the top two but still satisfying.",
            "P-X4kr5pDqXzhPEfa6RsTQ": "While good, it does not emphasize sweetness as much, which is a key preference for the user.",
            "uQu5DtnXZZ8XVfBKldKnag": "Ranked lowest due to a lack of emphasis on meat and broth, making it less appealing for the user's specific preferences."
        }
    },
    "UTzUG8exwDoHDW6V0BSE2w": {
        "kw": [
            "place",
            "side",
            "singapore",
            "faces",
            "spot"
        ],
        "candidate": [
            "XuxzGu2PEr59drHseZOVCg",
            "97DdiERj19Fuk5CRpHl0Hg",
            "hinGqQYvot8HtRYxSdr6FA",
            "WFtN3VJ4Tft0hQHl6NZaAA",
            "fY1IkBnRft1KR0O2tqu7pg"
        ],
        "explanation": {
            "XuxzGu2PEr59drHseZOVCg": "This restaurant offers a dynamic atmosphere and is known for its communal dining style, which fits the \"faces\" aspect well.",
            "97DdiERj19Fuk5CRpHl0Hg": "A vibrant spot with a lively ambiance that emphasizes social interaction, ideal for the user's preferences.",
            "hinGqQYvot8HtRYxSdr6FA": "A well-reviewed restaurant with a solid reputation, though it doesn't fully capture the vibrant experience sought by the user.",
            "WFtN3VJ4Tft0hQHl6NZaAA": "A popular choice, but it lacks the engaging environment the user seems to prefer.",
            "fY1IkBnRft1KR0O2tqu7pg": "This place has great food but may fall short in offering the lively setting desired for social dining experiences."
        }
    },
    "6G3tlx3-W5IH1lmaPXBSoQ": {
        "kw": [
            "place",
            "flavour",
            "service",
            "food",
            "singapore"
        ],
        "candidate": [
            "sxQdEEfKRviWRymOoH9UiA",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "7LFdimtQU3yrgiKyE53klQ",
            "r0bjzYPVHwZo_DP66VLt4Q",
            "VWLfePKMEj7g2P77RvRDuA"
        ],
        "explanation": {
            "sxQdEEfKRviWRymOoH9UiA": "This restaurant is known for its exceptional service and unique flavours that resonate well with the local palate.",
            "J9rMt_V1NX49rU3YUjh_7Q": "Renowned for its vibrant atmosphere and diverse menu, it draws in diners looking for local Singaporean cuisine with a twist.",
            "7LFdimtQU3yrgiKyE53klQ": "While still offering good food, it lacks the standout service that other top choices provide.",
            "r0bjzYPVHwZo_DP66VLt4Q": "Although it has solid flavours, it's set in a less desirable location compared to the top options.",
            "VWLfePKMEj7g2P77RvRDuA": "Previously ranked higher, but it falls short on service and overall experience compared to the others on this list."
        }
    },
    "uSphcDFYUZW4cDBW7XPjdA": {
        "kw": [
            "place",
            "waiter",
            "people",
            "singapore",
            "price"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "KmKkhD-97CqPvokq5JIoBA",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "BYwoAKKtdSeylSN7QV8oNw",
            "ahlZC7XOKN-XJ7P4sPZrRg"
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Best suited for social dining with attentive waitstaff and good pricing.",
            "KmKkhD-97CqPvokq5JIoBA": "A close second, popular for its location and service quality.",
            "J9rMt_V1NX49rU3YUjh_7Q": "Offers a pleasant atmosphere for groups, making it ideal for social interactions.",
            "BYwoAKKtdSeylSN7QV8oNw": "Nice venue but slightly pricier, lowering its rank.",
            "ahlZC7XOKN-XJ7P4sPZrRg": "While a decent option, it lacks the ambiance and service engagement found in the top choices."
        }
    },
    "8uhSaRacb0fkPxe4re4StA": {
        "kw": [
            "place",
            "lot",
            "group",
            "meat",
            "people"
        ],
        "candidate": [
            "tz8VEeIOoM5Cu1NSnC2JIQ",
            "JHi4LCxdbpXthg98sQiicQ",
            "x0Pk5Uvy0y63FSzcfmxRpQ",
            "Lv5GFFciSK532QIX2ZLqjg",
            "_HMiq7vSET4uhNScBdOJnw"
        ],
        "explanation": {
            "tz8VEeIOoM5Cu1NSnC2JIQ": "This restaurant has ample space for groups and features a robust meat selection, making it ideal for gatherings.",
            "JHi4LCxdbpXthg98sQiicQ": "Known for its spacious layout and variety of meat dishes, this place is also well-suited for larger crowds.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "Although it offers a decent selection, it doesn't quite match the group-friendliness of the top two options.",
            "Lv5GFFciSK532QIX2ZLqjg": "This restaurant is more limited in space and meat choices, putting it lower in priority for group gatherings.",
            "_HMiq7vSET4uhNScBdOJnw": "Ranked last, it lacks both room for larger groups and a variety of meat options, making it less appealing for the user's preferences."
        }
    },
    "Z9z67ChosXkTjjNAtFmN7w": {
        "kw": [
            "place",
            "shop",
            "lot",
            "dish",
            "pulled pork"
        ],
        "candidate": [
            "_7nMWBmfFvk9S3tKG3Ip_g",
            "EJNkmXMDWurCPjOZe_WXAg",
            "qs6gA9Y5sRzpXnm_4QaP0Q",
            "vVqxGrqt5ALxQjJGnntpKQ"
        ],
        "explanation": {
            "_7nMWBmfFvk9S3tKG3Ip_g": "Known for its pulled pork offerings, making it the top choice for the user's specified dish.",
            "EJNkmXMDWurCPjOZe_WXAg": "Offers a great variety of smoked meats including pulled pork, enhancing its ranking.",
            "qs6gA9Y5sRzpXnm_4QaP0Q": "While not as focused on pulled pork, it still serves quality dishes in a good setting.",
            "vVqxGrqt5ALxQjJGnntpKQ": "Doesn't specialize in pulled pork or related dishes, placing it last in this context."
        }
    },
    "6sRkV6dUa2TigWeVi4P9FQ": {
        "kw": [
            "place",
            "pulled pork",
            "steak",
            "food",
            "friend"
        ],
        "candidate": [
            "KPrdWch1680ihzVe3C-s3w",
            "LFknVw6uTIaL-MY_RqkN7g",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "Xtr2M_mh9_jOkmpNd_CSCA",
            "6LgTc7CZlXCd1Pxq3BiVcw"
        ],
        "explanation": {
            "KPrdWch1680ihzVe3C-s3w": "Known for its exceptional steak and barbecue options, making it a top choice for meat lovers.",
            "LFknVw6uTIaL-MY_RqkN7g": "Offers great pulled pork dishes that align perfectly with user preferences for high-quality food.",
            "vVqxGrqt5ALxQjJGnntpKQ": "A solid option with good food, but slightly less focused on the pulled pork and steak.",
            "Xtr2M_mh9_jOkmpNd_CSCA": "A decent restaurant with variety, but doesn't specialize in the user's preferred meat dishes as highly as others.",
            "6LgTc7CZlXCd1Pxq3BiVcw": "Lower in rank due to less emphasis on high-quality pulled pork and steak compared to others."
        }
    },
    "sF0HEhcWb13p_txmssFotw": {
        "kw": [
            "place",
            "meal",
            "fish",
            "chips",
            "coffee"
        ],
        "candidate": [
            "U3i7AaegudvpmDL23_wEmQ",
            "vZiWYH4XIiy3fqPNy615Kg",
            "EECw-s6Jy-fyJHhkUGQhHg",
            "NCwX8t4pHpcAMzSCaC2Hww",
            "3vr42-TF3V31LrN5sAFbDQ"
        ],
        "explanation": {
            "U3i7AaegudvpmDL23_wEmQ": "This restaurant excels in serving fish and chips, has a great location for a casual meal by the water, and offers decent coffee options, making it the top choice.",
            "vZiWYH4XIiy3fqPNy615Kg": "Known for its bustling atmosphere and solid fish and chips, this place also serves good coffee, which aligns well with user preferences.",
            "EECw-s6Jy-fyJHhkUGQhHg": "Offers a robust menu featuring fish and chips, but the ambiance is slightly less favorable compared to the top two options.",
            "NCwX8t4pHpcAMzSCaC2Hww": "While they serve tasty fish and chips, the coffee selection may not be as appealing as other spots in the list.",
            "3vr42-TF3V31LrN5sAFbDQ": "This restaurant is more renowned for other dishes rather than fish and chips, placing it last in the ranking despite having a good coffee menu."
        }
    },
    "owI_FQdAKZQFY8UnkQoD8g": {
        "kw": [
            "place",
            "staff",
            "coffee",
            "point",
            "temperature"
        ],
        "candidate": [
            "Eo87r_6a9Z3L_a8f9zVoow",
            "eKctA6ndawB61VrmSF-dXw",
            "NKkh6R7i2DQbUtyd5IdG_A",
            "VZcs1K7A31sNQurNXs9gaQ"
        ],
        "explanation": {
            "Eo87r_6a9Z3L_a8f9zVoow": "This restaurant has a vibrant atmosphere, friendly staff, and highly-rated coffee, making it a top choice.",
            "eKctA6ndawB61VrmSF-dXw": "Known for its cozy ambiance and attentive service, offering a solid coffee experience as well.",
            "NKkh6R7i2DQbUtyd5IdG_A": "Although it has decent reviews, it falls slightly short in the coffee and staff friendliness compared to the top two.",
            "VZcs1K7A31sNQurNXs9gaQ": "Ranked lowest due to a less favorable environment and average service, affecting overall enjoyment."
        }
    },
    "qnXgtXUvHRn0L0_8SirnWw": {
        "kw": [
            "place",
            "sandwiches",
            "dinner",
            "group",
            "dish"
        ],
        "candidate": [
            "x44o1_Dw4QsQZRtBJgwZaA",
            "VEy3-SnvsKgWfGM_b2irbA",
            "I1wArJIYbFl2txUL6unC6A",
            "lycfBKtcR7keDQQOeMMsoA"
        ],
        "explanation": {
            "x44o1_Dw4QsQZRtBJgwZaA": "This restaurant offers a variety of sandwiches and a spacious environment perfect for groups dining together.",
            "VEy3-SnvsKgWfGM_b2irbA": "Renowned for its quality sandwiches and communal dining areas, making it an excellent group choice.",
            "I1wArJIYbFl2txUL6unC6A": "While it has good offerings, it is slightly less accommodating for groups compared to the top two rankings.",
            "lycfBKtcR7keDQQOeMMsoA": "This place focuses more on other dinner options and does not emphasize sandwiches as much, placing it at the bottom of the list."
        }
    },
    "dBBQLSNK3xyowDow3wSQLg": {
        "kw": [
            "place",
            "lunch time",
            "items",
            "facebook",
            "desserts"
        ],
        "candidate": [
            "jLcBOqa-UT6qugFgZqjNvA",
            "9R5laAm5Kv4aBLVtH1gVnA",
            "YnnYwfMEeSru_cJ_qKeofw",
            "VZcs1K7A31sNQurNXs9gaQ",
            "CTYFfHq1SWFyCeJ-KyIgOQ"
        ],
        "explanation": {
            "jLcBOqa-UT6qugFgZqjNvA": "This restaurant is highly rated for its lunch offerings and desserts, making it a top choice for the user.",
            "9R5laAm5Kv4aBLVtH1gVnA": "Known for its diverse menu and strong Facebook presence, this spot caters well to lunch diners.",
            "YnnYwfMEeSru_cJ_qKeofw": "Offers a good selection of lunch items and is recognized for its desserts, appealing to the user’s sweet tooth.",
            "VZcs1K7A31sNQurNXs9gaQ": "While it serves lunch, it has fewer dessert options compared to the top three.",
            "CTYFfHq1SWFyCeJ-KyIgOQ": "Although a popular place, it does not focus as much on dessert offerings, placing it lower in the rankings."
        }
    },
    "69BnQt-ykPsqriePrJKIqw": {
        "kw": [
            "place",
            "shop",
            "lunch time",
            "dish",
            "spices"
        ],
        "candidate": [
            "vVqxGrqt5ALxQjJGnntpKQ",
            "BYwoAKKtdSeylSN7QV8oNw",
            "HMiq7vSET4uhNScBdOJnw",
            "7LFdimtQU3yrgiKyE53klQ",
            "KPrdWch1680ihzVe3C-s3w"
        ],
        "explanation": {
            "vVqxGrqt5ALxQjJGnntpKQ": "This restaurant is known for its extensive spicy lunch menu, making it a perfect match for the user's preferences.",
            "BYwoAKKtdSeylSN7QV8oNw": "Offers a shop-like atmosphere and several dishes with a good balance of spices, suitable for lunch.",
            "HMiq7vSET4uhNScBdOJnw": "While it has some spicy dishes, the overall lunch options are less diverse than the top two.",
            "7LFdimtQU3yrgiKyE53klQ": "Features a nice lunch environment but lacks in the spice department compared to the higher-ranked options.",
            "KPrdWch1680ihzVe3C-s3w": "This restaurant focuses more on milder flavors, making it less appealing for a lunch preference that emphasizes spiciness."
        }
    },
    "w-hrD3-YJXbDUlvBwrpWtA": {
        "kw": [
            "place",
            "instagram",
            "shop",
            "dinner",
            "hours"
        ],
        "candidate": [
            "tz8VEeIOoM5Cu1NSnC2JIQ",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "cEX4Cw8q2ftBrbpCvInf0w",
            "x0Pk5Uvy0y63FSzcfmxRpQ"
        ],
        "explanation": {
            "tz8VEeIOoM5Cu1NSnC2JIQ": "This restaurant has a vibrant atmosphere ideal for Instagram, along with a dinner menu that appeals to shop-like dining.",
            "vVqxGrqt5ALxQjJGnntpKQ": "It offers a cozy place with great décor perfect for social media sharing, though it has slightly limited hours.",
            "J9rMt_V1NX49rU3YUjh_7Q": "Known for its eclectic menu, this spot has aesthetic appeal but doesn’t focus as much on a shop-like experience.",
            "cEX4Cw8q2ftBrbpCvInf0w": "While still enjoyable, it is more utilitarian and less visually appealing for Instagram.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "This restaurant ranks lowest because it lacks the ambience and charm that the user is likely seeking, plus limited evening options."
        }
    },
    "52R6YBCMU0yycOHKcnTXhA": {
        "kw": [
            "place",
            "voucher",
            "lot",
            "group",
            "dish"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "ko4q1Oj4iWvYSxoamlcEgw",
            "T7ekp7FiffoWDq53hbZDhg",
            "_HMiq7vSET4uhNScBdOJnw"
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "This restaurant offers great group dining options and has special vouchers available.",
            "ko4q1Oj4iWvYSxoamlcEgw": "Known for its spacious lot and suitable for large groups, it's a solid choice for the user's preferences.",
            "T7ekp7FiffoWDq53hbZDhg": "While still a good option, it lacks some voucher deals and isn't as conducive for larger gatherings.",
            "_HMiq7vSET4uhNScBdOJnw": "This restaurant is last due to limited dish variety and less favorable group accommodations compared to others."
        }
    },
    "Wcg633L8ajHPuLeb0AiCqg": {
        "kw": [
            "place",
            "dinner",
            "friends",
            "side",
            "desserts"
        ],
        "candidate": [
            "J9rMt_V1NX49rU3YUjh_7Q",
            "AQEEH7JP1DFrvFuMi6TP2Q",
            "KX5KY8fLlMoJMS1NAj0Pvw",
            "I1wArJIYbFl2txUL6unC6A",
            "sxQdEEfKRviWRymOoH9UiA"
        ],
        "explanation": {
            "J9rMt_V1NX49rU3YUjh_7Q": "This restaurant has a vibrant atmosphere and is known for sharing plates, making it ideal for a meal with friends.",
            "AQEEH7JP1DFrvFuMi6TP2Q": "It offers an excellent variety of desserts alongside hearty dinner options and has a welcoming setting for groups.",
            "KX5KY8fLlMoJMS1NAj0Pvw": "While it has good food, its focus is less on dessert and it might not have the best ambiance for a group dinner.",
            "I1wArJIYbFl2txUL6unC6A": "This place is decent but has limited dessert options and is better suited for smaller gatherings.",
            "sxQdEEfKRviWRymOoH9UiA": "Although it has good food, it lacks a focus on sides and desserts, which are important for this dining scenario."
        }
    },
    "6FFuvWqU2jyr7_Y7sdTsvg": {
        "kw": [
            "place",
            "food",
            "singapore",
            "birthday",
            "curry"
        ],
        "candidate": [
            "2JFWJDNeLZN3dbTXs8kNMQ",
            "ymAw53bQVppVV7T40fNgRw",
            "OExxlOVjUIDh3TFjPzbSDA",
            "7LFdimtQU3yrgiKyE53klQ",
            "U3i7AaegudvpmDL23_wEmQ."
        ],
        "explanation": {
            "2JFWJDNeLZN3dbTXs8kNMQ": "Highly recommended for its exquisite curry dishes and vibrant atmosphere, making it perfect for a birthday celebration.",
            "ymAw53bQVppVV7T40fNgRw": "Known for its authentic Singaporean curry, ideal for satisfying a craving while still offering a festive vibe.",
            "OExxlOVjUIDh3TFjPzbSDA": "Offers quality curry options and a pleasant dining environment, suitable for a casual celebration.",
            "7LFdimtQU3yrgiKyE53klQ": "While it has good food, it does not particularly specialize in curry, thus lowering its ranking for this specific preference.",
            "U3i7AaegudvpmDL23_wEmQ": "This restaurant falls short on the curry front, making it the least favorable option for the user’s birthday celebration desires."
        }
    },
    "ARHlG11NVB69dZ0Ky3HmXg": {
        "kw": [
            "place",
            "dish",
            "broth",
            "singapore",
            "rice"
        ],
        "candidate": [
            "NSjzCmaZGZAOe6i9l1lj9g",
            "ALNmvpU7JN_tOCD653vVWA",
            "4Xm4LZQjoavYm0Yjs1QgsQ",
            "PiHPVBDkXTXaJtrrnJt9QQ",
            "c7Ri-jVC0lvZbJtSPIsSEw"
        ],
        "explanation": {
            "NSjzCmaZGZAOe6i9l1lj9g": "This restaurant specializes in rice dishes that showcase authentic Singaporean broth, aligning perfectly with the user's preferences.",
            "ALNmvpU7JN_tOCD653vVWA": "Known for its flavorful rice entrees and a selection of broths, this place offers a great balance of the user's desired characteristics.",
            "4Xm4LZQjoavYm0Yjs1QgsQ": "While not primarily focused on broth, it does provide good rice options that may appeal to the user.",
            "PiHPVBDkXTXaJtrrnJt9QQ": "This restaurant is well-regarded but lacks the specific focus on rice and broth that the user prefers, resulting in a lower rank.",
            "c7Ri-jVC0lvZbJtSPIsSEw": "Although it has strong dishes, it doesn't cater specifically to the rice and broth element as required by the user."
        }
    },
    "j21GdRmmPI2vzVVxaYpKbg": {
        "kw": [
            "place",
            "lot",
            "dish",
            "sweetness",
            "dessert"
        ],
        "candidate": [
            "uQu5DtnXZZ8XVfBKldKnag",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "lJ5YkS5fxC8dcSK4FPtyYQ",
            "P-X4kr5pDqXzhPEfa6RsTQ"
        ],
        "explanation": {
            "uQu5DtnXZZ8XVfBKldKnag": "Known for its exceptional desserts and sweet dishes, making it the top choice.",
            "vVqxGrqt5ALxQjJGnntpKQ": "Offers a good balance of sweet dishes and desserts, enhancing its ranking.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Provides some sweet options but lacks a strong dessert menu.",
            "lJ5YkS5fxC8dcSK4FPtyYQ": "Moderate in sweetness but less focus on dessert choices.",
            "P-X4kr5pDqXzhPEfa6RsTQ": "Overall ranking decreased due to limited dessert and sweetness options."
        }
    },
    "BxXEXnFX8xeG7Y56-XXHZg": {
        "kw": [
            "place",
            "dinner",
            "lot",
            "lady",
            "taste"
        ],
        "candidate": [
            "NbQH02mMYJ4r1RqvG2FDBA",
            "fY1IkBnRft1KR0O2tqu7pg",
            "hinGqQYvot8HtRYxSdr6FA",
            "ZhJ59SFPifQiTW0gAddfGw",
            "fqhahiKsc6gPs5Sx4mf9Vg"
        ],
        "explanation": {
            "NbQH02mMYJ4r1RqvG2FDBA": "This restaurant excels in providing a great dining atmosphere, perfect for groups and known for its exquisite taste.",
            "fY1IkBnRft1KR0O2tqu7pg": "Offers a diverse menu and is well-regarded for its dinner service, making it a suitable choice for the user’s preferences.",
            "hinGqQYvot8HtRYxSdr6FA": "This venue has good reviews and a pleasant ambiance, though it might be a bit less spacious than the top two picks.",
            "ZhJ59SFPifQiTW0gAddfGw": "Known for its food, but the environment may be less appropriate for the user’s preference for a lady-friendly setting.",
            "fqhahiKsc6gPs5Sx4mf9Vg": "While the food is decent, it does not meet the user’s criteria for taste and ambiance as well as the others."
        }
    },
    "I9wjC0MrCfMbnXYwYvXCDw": {
        "kw": [
            "place",
            "dinner",
            "lot",
            "service",
            "food"
        ],
        "candidate": [
            "CHSOxwAtWXl4I2kvBT-sng",
            "bjL1PC2e9dvjBVewmoXYwQ",
            "YnnYwfMEeSru_cJ_qKeofw",
            "ahlZC7XOKN-XJ7P4sPZrRg",
            "CdAmgWWCabZQoYNNWOKcEw."
        ],
        "explanation": {
            "CHSOxwAtWXl4I2kvBT-sng": "This restaurant offers an excellent ambiance and top-notch service, making it ideal for dinner.",
            "bjL1PC2e9dvjBVewmoXYwQ": "Known for its delicious food and welcoming atmosphere, this place also has attentive service, enhancing the dining experience.",
            "YnnYwfMEeSru_cJ_qKeofw": "While good, its atmosphere and service don’t quite match the top two, but it remains a solid option.",
            "ahlZC7XOKN-XJ7P4sPZrRg": "A decent choice but lacks some appeal in terms of service and dining experience compared to those ranked higher.",
            "CdAmgWWCabZQoYNNWOKcEw": "This venue offers satisfactory food but does not stand out in terms of atmosphere or service, placing it last in the ranking."
        }
    },
    "J8mFTJfBBBaShBX1WV30hA": {
        "kw": [
            "place",
            "bar",
            "dinner",
            "lot",
            "friends"
        ],
        "candidate": [
            "OExxlOVjUIDh3TFjPzbSDA",
            "UPRFpMsB4I64GRjUqjRmiw",
            "MqdAYfl1p_c1144i48k6jw",
            "x44o1_Dw4QsQZRtBJgwZaA",
            "d3vB2tlgTEapMU_kGiXRoQ"
        ],
        "explanation": {
            "OExxlOVjUIDh3TFjPzbSDA": "This restaurant is known for its lively bar scene and communal dining options, making it ideal for friends looking to enjoy dinner together.",
            "UPRFpMsB4I64GRjUqjRmiw": "A good choice for dinner, it has a cozy atmosphere that still supports social interaction, but is slightly less vibrant than the top pick.",
            "MqdAYfl1p_c1144i48k6jw": "Offers a decent bar experience but lacks the same level of warmth and sociability as the top two restaurants.",
            "x44o1_Dw4QsQZRtBJgwZaA": "Good food but less focused on the bar and social dining aspect, making it less suitable for a friendly dinner.",
            "d3vB2tlgTEapMU_kGiXRoQ": "While it may provide decent food options, it is not conducive to the desired social environment for friends dining together."
        }
    },
    "SlOendilVJwP8GhRoxJX_w": {
        "kw": [
            "place",
            "people",
            "service",
            "food",
            "broth"
        ],
        "candidate": [
            "NbQH02mMYJ4r1RqvG2FDBA",
            "ADtSvzL_abKwWPM1EL2yJw",
            "4YXzFmpDWyFt8seK7DyzfQ",
            "lnC_BiucMb6YJjm392nwAQ",
            "o1_iIC0rU2yuF3SZvf6IjA"
        ],
        "explanation": {
            "NbQH02mMYJ4r1RqvG2FDBA": "High ratings in atmosphere and service, providing a great dining experience.",
            "ADtSvzL_abKwWPM1EL2yJw": "Known for its excellent food quality and flavorful broth, making it a favorite among locals.",
            "4YXzFmpDWyFt8seK7DyzfQ": "Good ambiance and decent service, but less favored for its food compared to the top two.",
            "lnC_BiucMb6YJjm392nwAQ": "Offers decent food but has been noted for average service, placing it lower in this ranking.",
            "o1_iIC0rU2yuF3SZvf6IjA": "While it has a nice place, it's less popular overall and doesn't excel in food or broth compared to others."
        }
    },
    "4m1PPtF587WIZTBlT6xh6A": {
        "kw": [
            "place",
            "edge",
            "bar",
            "lot",
            "fish taco"
        ],
        "candidate": [
            "dUUJ2-v8Vltv4FkUB55bog",
            "BXphYTodNSLUdeVDXmVnog",
            "txwpCDw5Utu9WbM0VtYJqg",
            "IC15vAUX4EiMlWxxMehohw",
            "ahlZC7XOKN-XJ7P4sPZrRg"
        ],
        "explanation": {
            "dUUJ2-v8Vltv4FkUB55bog": "Known for having the best fish tacos in the area and a fantastic outdoor bar.",
            "BXphYTodNSLUdeVDXmVnog": "Features a great bar with a cozy edge, offers good fish tacos, and has a parking lot.",
            "txwpCDw5Utu9WbM0VtYJqg": "A decent option with a bar, offers fish tacos, but doesn’t beat the top two.",
            "IC15vAUX4EiMlWxxMehohw": "While popular and has its strengths, it's missing the fish taco edge and outdoor seating.",
            "ahlZC7XOKN-XJ7P4sPZrRg": "Great place but lacks the essential fish taco feature and outdoor bar setting."
        }
    },
    "4Uf6g20S-2ZcxJSuvVIjJg": {
        "kw": [
            "place",
            "shop",
            "sandwiches",
            "lot",
            "items"
        ],
        "candidate": [
            "J9rMt_V1NX49rU3YUjh_7Q",
            "fY1IkBnRft1KR0O2tqu7pg",
            "cEX4Cw8q2ftBrbpCvInf0w",
            "txwpCDw5Utu9WbM0VtYJqg",
            "vVqxGrqt5ALxQjJGnntpKQ"
        ],
        "explanation": {
            "J9rMt_V1NX49rU3YUjh_7Q": "This restaurant has a diverse selection of sandwiches and a spacious lot, making it a top choice for the user.",
            "fY1IkBnRft1KR0O2tqu7pg": "Known for its high-quality sandwiches and a decent lot for parking, this option ranks well for the user.",
            "cEX4Cw8q2ftBrbpCvInf0w": "Offers a variety of sandwich choices but has limited space, affecting its overall ranking.",
            "txwpCDw5Utu9WbM0VtYJqg": "While it serves good sandwiches, the lack of a large lot places it lower in preference.",
            "vVqxGrqt5ALxQjJGnntpKQ": "Although it offers some sandwich options, it falls short in variety and lot space compared to the others."
        }
    },
    "CZQUtmO5NIY-bZWkCqHeJg": {
        "kw": [
            "place",
            "dish",
            "facebook",
            "service",
            "singapore"
        ],
        "candidate": [
            "lJ5YkS5fxC8dcSK4FPtyYQ",
            "uq9uIKV-lxn1bvLxkQaAow",
            "GGMka0ITgk7w_YUHUo8gqg",
            "XuxzGu2PEr59drHseZOVCg"
        ],
        "explanation": {
            "lJ5YkS5fxC8dcSK4FPtyYQ": "This restaurant offers a popular Singaporean dish and has excellent service, making it the top choice.",
            "uq9uIKV-lxn1bvLxkQaAow": "Known for its unique dish and good service, it appeals well to the user’s preferences.",
            "GGMka0ITgk7w_YUHUo8gqg": "While it has decent dishes, it lacks strong social media engagement compared to the top options.",
            "XuxzGu2PEr59drHseZOVCg": "Although a solid choice, it has the least appeal regarding service and local dish offerings."
        }
    },
    "KGDeSGEyQ_W3YSBs-X--Jg": {
        "kw": [
            "place",
            "waiter",
            "service",
            "food",
            "broth"
        ],
        "candidate": [
            "9R5laAm5Kv4aBLVtH1gVnA",
            "4ZOXsBhHx2EzrTwACILK2A",
            "xdCYUyNhjRkKPR3lzcf9_g",
            "o1_iIC0rU2yuF3SZvf6IjA"
        ],
        "explanation": {
            "9R5laAm5Kv4aBLVtH1gVnA": "This restaurant is known for its superior food quality and attentive service, making it a perfect fit for the user's focus on food and waiter interaction.",
            "4ZOXsBhHx2EzrTwACILK2A": "Offering good food and a warm atmosphere, it ranks slightly lower due to mixed reviews on service efficiency.",
            "xdCYUyNhjRkKPR3lzcf9_g": "While the food quality is decent, the service has received criticism, affecting its overall score.",
            "o1_iIC0rU2yuF3SZvf6IjA": "This location falls to the bottom as it has been noted for underwhelming food quality and inconsistent service."
        }
    },
    "1Fx3krf1zjVRDooyCS21Ug": {
        "kw": [
            "place",
            "truffle oil",
            "friends",
            "fries",
            "meat"
        ],
        "candidate": [
            "tDGDMePyQvBBn416-1SEMA",
            "ko4q1Oj4iWvYSxoamlcEgw",
            "_HMiq7vSET4uhNScBdOJnw",
            "pJWufKPuAuRFUyky_LeUMg"
        ],
        "explanation": {
            "tDGDMePyQvBBn416-1SEMA": "Renowned for its truffle oil-infused dishes and a vibrant atmosphere perfect for dining with friends.",
            "ko4q1Oj4iWvYSxoamlcEgw": "Offers a great selection of meat dishes and delicious fries, appealing to the group dining experience.",
            "_HMiq7vSET4uhNScBdOJnw": "While decent, it lacks the strong focus on truffle oil and meat that the user prefers.",
            "pJWufKPuAuRFUyky_LeUMg": "This place has lower suitability regarding the preferred flavors and dining experience for friends."
        }
    },
    "SdBE9XluzgQZ9Xiy70MnGw": {
        "kw": [
            "place",
            "arab street",
            "dinner",
            "dish",
            "flavour"
        ],
        "candidate": [
            "U3i7AaegudvpmDL23_wEmQ",
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "YzYNEpi9JU34yJRqCxb9ag"
        ],
        "explanation": {
            "U3i7AaegudvpmDL23_wEmQ": "This restaurant is highly rated for its diverse and flavorful dinner options, conveniently located near Arab Street.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Known for its authentic cuisine, it offers a cozy atmosphere and dishes that reflect rich flavors, making it an ideal dinner spot.",
            "J9rMt_V1NX49rU3YUjh_7Q": "While still a good choice, it is slightly farther from Arab Street compared to the top two options, which cater more directly to the user's preference.",
            "YzYNEpi9JU34yJRqCxb9ag": "This restaurant has fewer flavorful dinner options and is not as conveniently located, which is why it has been placed last in the ranking."
        }
    },
    "SO5B0U096RjupQIHOnzRXA": {
        "kw": [
            "place",
            "lunch time",
            "waiter",
            "service",
            "stars"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "BYwoAKKtdSeylSN7QV8oNw",
            "new3Ny6i5ZJVn3m-i4A2Tg",
            "7LFdimtQU3yrgiKyE53klQ"
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "This restaurant has high ratings for lunch service and waitstaff efficiency, making it a prime choice for the user's preferences.",
            "BYwoAKKtdSeylSN7QV8oNw": "Offers a good lunchtime atmosphere and attentive service, earning it a strong position in the ranking.",
            "new3Ny6i5ZJVn3m-i4A2Tg": "While it has decent reviews, its location may not be as convenient for lunch as the top two choices.",
            "7LFdimtQU3yrgiKyE53klQ": "This restaurant has lower star ratings and service quality compared to others, placing it at the bottom of the list."
        }
    },
    "hC1HjO-Tye6dar3Bg0aZMw": {
        "kw": [
            "place",
            "shop",
            "dinner",
            "lot",
            "items"
        ],
        "candidate": [
            "cEX4Cw8q2ftBrbpCvInf0w",
            "6LgTc7CZlXCd1Pxq3BiVcw",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "CdAmgWWCabZQoYNNWOKcEw"
        ],
        "explanation": {
            "cEX4Cw8q2ftBrbpCvInf0w": "This restaurant provides a large menu with plenty of dining options and has ample space for guests.",
            "6LgTc7CZlXCd1Pxq3BiVcw": "A good option as it offers a variety of items and a comfortable setting for a dinner gathering.",
            "vVqxGrqt5ALxQjJGnntpKQ": "While it has decent options, it may not provide as much room or variety as the top two selections.",
            "CdAmgWWCabZQoYNNWOKcEw": "This place has limited items and a more compact space compared to the others, making it less appealing for group dinners."
        }
    },
    "gZdpDc208Ehm9k5MymZKKw": {
        "kw": [
            "place",
            "sandwiches",
            "dinner",
            "dish",
            "spices"
        ],
        "candidate": [
            "KPrdWch1680ihzVe3C-s3w",
            "f1kFik39vZHPEt3z7ZWu4g",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "_HMiq7vSET4uhNScBdOJnw",
            "7LFdimtQU3yrgiKyE53klQ"
        ],
        "explanation": {
            "KPrdWch1680ihzVe3C-s3w": "Known for its gourmet sandwiches with a variety of spices and unique flavor combinations ideal for dinner.",
            "f1kFik39vZHPEt3z7ZWu4g": "Offers a strong sandwich menu featuring robust spices that appeal to those seeking a flavorful dinner option.",
            "vVqxGrqt5ALxQjJGnntpKQ": "While more casual, it serves sandwiches that are well-seasoned and satisfying, suitable for an informal dinner.",
            "_HMiq7vSET4uhNScBdOJnw": "This venue provides a diverse menu but focuses less on sandwiches, making it a less favorable choice for this specific preference.",
            "7LFdimtQU3yrgiKyE53klQ": "Although popular, it falls short in the sandwich category and doesn’t emphasize spiced dishes for dinner."
        }
    },
    "co76qOLbbjeG2A9LZymtjQ": {
        "kw": [
            "place",
            "instagram",
            "batter",
            "sweetness",
            "friends"
        ],
        "candidate": [
            "MPzZuWpKpeLBa833zzL9IQ",
            "UPRFpMsB4I64GRjUqjRmiw",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "Rwzp59f3Ia-v2V8Ku0zZWQ"
        ],
        "explanation": {
            "MPzZuWpKpeLBa833zzL9IQ": "This restaurant offers a visually stunning atmosphere perfect for Instagram and features dishes with the right sweetness and batter texture.",
            "UPRFpMsB4I64GRjUqjRmiw": "Known for its excellent batter and sweet offerings, it's also a great place for friends to gather and enjoy.",
            "vVqxGrqt5ALxQjJGnntpKQ": "While not as Instagrammable as the top two, it still has good flavor profiles that cater to sweetness and batter preferences.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "This falls last due to a lesser focus on the visually appealing aspects and a batter that doesn't quite match up to the others."
        }
    },
    "AWPy2uveUH8ZLgNF9toO7g": {
        "kw": [
            "place",
            "bar",
            "items",
            "flavour",
            "friends"
        ],
        "candidate": [
            "i5dxKKLe2kJ8WbPUXilPGg",
            "YkVRDcEa7vZK65u-tlL9tQ",
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "at7wfECnjgIJi5o7gL8fyQ"
        ],
        "explanation": {
            "i5dxKKLe2kJ8WbPUXilPGg": "This restaurant offers a vibrant bar scene and a variety of flavorful dishes that are perfect for enjoying with friends.",
            "YkVRDcEa7vZK65u-tlL9tQ": "Known for its nice atmosphere and good drink selection, it ranks high for a place to enjoy with friends, though food variety may be slightly less extensive.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "While it has good food items, the bar experience is not as lively, making it less suited for the user’s preference for socializing.",
            "at7wfECnjgIJi5o7gL8fyQ": "Although it offers decent dishes, it lacks a bar atmosphere and isn't ideal for groups, placing it last in the ranking."
        }
    },
    "ENdY-5f8v4-xwZ9cTQYsLw": {
        "kw": [
            "place",
            "lot",
            "ingredients",
            "gelato",
            "food"
        ],
        "candidate": [
            "MPzZuWpKpeLBa833zzL9IQ",
            "3hxwHzQ432UL3rQAWJG5TA",
            "hinGqQYvot8HtRYxSdr6FA",
            "cEX4Cw8q2ftBrbpCvInf0w",
            "Lv5GFFciSK532QIX2ZLqjg"
        ],
        "explanation": {
            "MPzZuWpKpeLBa833zzL9IQ": "Renowned for its fresh ingredients and offers a standout gelato selection.",
            "3hxwHzQ432UL3rQAWJG5TA": "Known for its quality dishes and pleasant ambiance, making it a great place to enjoy meals.",
            "hinGqQYvot8HtRYxSdr6FA": "Good ingredient sourcing but slightly less emphasis on gelato than the top two.",
            "cEX4Cw8q2ftBrbpCvInf0w": "Solid food offerings but lacks gelato options, placing it lower.",
            "Lv5GFFciSK532QIX2ZLqjg": "Offers the least appealing combination of factors for the user’s specified preferences."
        }
    },
    "1ziEzn7BoXTfOQ4YBkdz1Q": {
        "kw": [
            "place",
            "lot",
            "items",
            "cooks",
            "people"
        ],
        "candidate": [
            "NbQH02mMYJ4r1RqvG2FDBA",
            "VEy3-SnvsKgWfGM_b2irbA",
            "5RFNZZvtfF9uHVSUeYwzbQ",
            "lycfBKtcR7keDQQOeMMsoA",
            "nCwEzk4Z1lX5PvLEYpbBHw"
        ],
        "explanation": {
            "NbQH02mMYJ4r1RqvG2FDBA": "This restaurant offers a spacious environment with attentive cooks and a diverse menu, catering well to the user's preferences.",
            "VEy3-SnvsKgWfGM_b2irbA": "Known for its well-prepared food and friendly staff, this place also has ample seating, making it a comfortable choice for social gatherings.",
            "5RFNZZvtfF9uHVSUeYwzbQ": "While it has a nice ambiance, the variety of items is slightly limited compared to the top two, placing it lower in ranking.",
            "lycfBKtcR7keDQQOeMMsoA": "This option has good food but can be crowded, making it less ideal for a relaxed dining experience.",
            "nCwEzk4Z1lX5PvLEYpbBHw": "Although it has decent cooks, the overall atmosphere and limited lot space detract from the dining experience."
        }
    },
    "2HchhLgGj16aITZGVy0hqA": {
        "kw": [
            "place",
            "dish",
            "spices",
            "sweetness",
            "meat"
        ],
        "candidate": [
            "M-PobdAR2gJhPyLR_WzMCQ",
            "6LgTc7CZlXCd1Pxq3BiVcw",
            "gPmD_yz_3DK6q8gmCfjpOA",
            "AQEEH7JP1DFrvFuMi6TP2Q",
            "TzKx4KbFOzLX0v7F31cSpw."
        ],
        "explanation": {
            "M-PobdAR2gJhPyLR_WzMCQ": "This restaurant is known for its highly spiced meat dishes that cater to the user’s preference for robust flavors.",
            "6LgTc7CZlXCd1Pxq3BiVcw": "Offers a well-balanced menu with a good mix of spices and sweetness, making it appealing for the user's taste.",
            "gPmD_yz_3DK6q8gmCfjpOA": "This spot provides solid meat options, but the dishes may lack the desired level of spice and sweetness.",
            "AQEEH7JP1DFrvFuMi6TP2Q": "While featuring some good meat dishes, it doesn’t emphasize spices and sweetness as much as preferred.",
            "TzKx4KbFOzLX0v7F31cSpw": "Although it has its merits, this restaurant has less variety in meat and spice levels, making it the least aligned with the user’s preferences."
        }
    },
    "J3mRNNw5CpKX2bmTpbkaSQ": {
        "kw": [
            "place",
            "food",
            "drinks",
            "staff",
            "spot"
        ],
        "candidate": [
            "CHSOxwAtWXl4I2kvBT-sng",
            "I1wArJIYbFl2txUL6unC6A",
            "xqniVNVNvAE1E9Qzf8b_Bw",
            "pnjp8dim5eVWHIX7oYnEbQ",
            "ib_206uhcdzV7lNcCpniXA"
        ],
        "explanation": {
            "CHSOxwAtWXl4I2kvBT-sng": "This restaurant excels in both food quality and a vibrant atmosphere, making it the best choice for the user.",
            "I1wArJIYbFl2txUL6unC6A": "Offers a great combination of delicious dishes and attentive staff, which enhances the overall dining experience.",
            "xqniVNVNvAE1E9Qzf8b_Bw": "Known for its good drink options and nice ambiance, this place ranks well for a relaxed outing.",
            "pnjp8dim5eVWHIX7oYnEbQ": "While it has decent food, the service is less consistent, placing it lower in the ranking.",
            "ib_206uhcdzV7lNcCpniXA": "Although it has some redeeming qualities, it falls short on atmosphere and drink offerings compared to the others."
        }
    },
    "CgvT48Iewm-pd20IZNNORw": {
        "kw": [
            "place",
            "sweetness",
            "friends",
            "try",
            "people"
        ],
        "candidate": [
            "XuxzGu2PEr59drHseZOVCg",
            "UPRFpMsB4I64GRjUqjRmiw",
            "fY1IkBnRft1KR0O2tqu7pg",
            "NAsglQPCdPMJV_RkHge27A",
            "dFYfZsc-SUwRpDEgJiIoXA."
        ],
        "explanation": {
            "XuxzGu2PEr59drHseZOVCg": "This restaurant has a vibrant atmosphere and a diverse menu that caters to sweet tastes, making it perfect for groups.",
            "UPRFpMsB4I64GRjUqjRmiw": "Known for its sweet desserts and relaxed setting, it's an ideal spot for friends to try new dishes together.",
            "fY1IkBnRft1KR0O2tqu7pg": "Offers a balance of savory and sweet options, suitable for socializing but slightly less lively than the top two.",
            "NAsglQPCdPMJV_RkHge27A": "While having great food, the ambiance is more laid-back, which might not be as engaging for a group outing.",
            "dFYfZsc-SUwRpDEgJiIoXA": "Though it has good food, it lacks the social element and sweetness that the user prioritizes."
        }
    },
    "wZPOBFPNbFP_Z40ewPGlOw": {
        "kw": [
            "place",
            "sandwiches",
            "facebook",
            "people",
            "service"
        ],
        "candidate": [
            "9R5laAm5Kv4aBLVtH1gVnA",
            "kA5pZz-koXIlPaDJALDroQ",
            "XAMUaVFO2y5Vf1Uz_rYA1Q",
            "J9rMt_V1NX49rU3YUjh_7Q"
        ],
        "explanation": {
            "9R5laAm5Kv4aBLVtH1gVnA": "This restaurant is well-known for its excellent sandwiches and has a lively atmosphere that attracts people.",
            "kA5pZz-koXIlPaDJALDroQ": "It offers a great selection of sandwiches and has a reputation for good service and a welcoming environment.",
            "XAMUaVFO2y5Vf1Uz_rYA1Q": "While it has decent sandwiches, the service and ambiance are less notable compared to the top two.",
            "J9rMt_V1NX49rU3YUjh_7Q": "This restaurant is the least favored for sandwiches and lacks the vibrant social atmosphere preferred by the user."
        }
    },
    "NRXW5s7FvDVN21Ey3ve4fA": {
        "kw": [
            "place",
            "dinner",
            "lot",
            "dish",
            "ingredients"
        ],
        "candidate": [
            "LFknVw6uTIaL-MY_RqkN7g",
            "NbQH02mMYJ4r1RqvG2FDBA",
            "BfGgttAzEPx9v7b8Sgkedw",
            "Pv0P0vYFIOlMPPfn18Wc7Q",
            "x0Pk5Uvy0y63FSzcfmxRpQ"
        ],
        "explanation": {
            "LFknVw6uTIaL-MY_RqkN7g": "This restaurant is spacious and offers a fantastic dinner menu with a focus on fresh, high-quality ingredients.",
            "NbQH02mMYJ4r1RqvG2FDBA": "Known for its substantial portions and diverse dishes, this restaurant is ideal for users seeking hearty meals.",
            "BfGgttAzEPx9v7b8Sgkedw": "Although smaller, it has unique dishes that emphasize fresh ingredients and a delightful atmosphere for dinner.",
            "Pv0P0vYFIOlMPPfn18Wc7Q": "Offers an enjoyable dining experience but is less spacious compared to the others, hence lower in the ranking.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "While it has good dishes, it lacks the ambiance and variety that the top restaurants provide."
        }
    },
    "Ve9COknMqJRgoJ1VN9OH_A": {
        "kw": [
            "place",
            "people",
            "drinks",
            "spot",
            "chicken"
        ],
        "candidate": [
            "JHi4LCxdbpXthg98sQiicQ",
            "BYwoAKKtdSeylSN7QV8oNw",
            "fY1IkBnRft1KR0O2tqu7pg",
            "dFYfZsc-SUwRpDEgJiIoXA",
            "pKNDz1tzC5llbengNUz_7w"
        ],
        "explanation": {
            "JHi4LCxdbpXthg98sQiicQ": "This restaurant offers a vibrant atmosphere ideal for social gatherings and is known for its excellent chicken dishes.",
            "BYwoAKKtdSeylSN7QV8oNw": "A great spot for drinks, it has a lively vibe and also serves delicious chicken, making it a favorite for groups.",
            "fY1IkBnRft1KR0O2tqu7pg": "Known for its trendy location, it has a solid drink menu and decent chicken options, appealing to the user’s preferences.",
            "dFYfZsc-SUwRpDEgJiIoXA": "While it is a good spot, it doesn't excel in drinks or chicken compared to others, placing it a bit lower.",
            "pKNDz1tzC5llbengNUz_7w": "Although it has its merits, it's less focused on the communal and drink elements valued by the user, impacting its ranking."
        }
    },
    "bHBlJiNESfIssh4qFUvVPA": {
        "kw": [
            "place",
            "lot",
            "dish",
            "side",
            "meat"
        ],
        "candidate": [
            "SNO_rcpzRL8b2EB9QuntTQ",
            "BUB9WyngpND8oiQ7DXiS-g",
            "U3i7AaegudvpmDL23_wEmQ",
            "Rl318hUrGlkPJhMmNNZizQ",
            "5p2AWrPlYJM5hh54HcyA3g"
        ],
        "explanation": {
            "SNO_rcpzRL8b2EB9QuntTQ": "This restaurant has a great ambiance and offers a wide variety of meat dishes that align well with the user's preferences.",
            "BUB9WyngpND8oiQ7DXiS-g": "Known for its unique side dishes and quality meat options, this restaurant provides an appealing lot for diners.",
            "U3i7AaegudvpmDL23_wEmQ": "While still a strong option, it slightly falls short compared to the top two in terms of dish variety and overall place preference.",
            "Rl318hUrGlkPJhMmNNZizQ": "This restaurant offers decent options but lacks in the side variety preferred by the user, placing it lower.",
            "5p2AWrPlYJM5hh54HcyA3g": "This restaurant ranks last as it does not align as closely with the user's meat and dish preferences compared to others."
        }
    },
    "aUbs0HchxTaVBFR_cHdC9w": {
        "kw": [
            "place",
            "instagram",
            "group",
            "dish",
            "spices"
        ],
        "candidate": [
            "BYwoAKKtdSeylSN7QV8oNw",
            "lycfBKtcR7keDQQOeMMsoA",
            "x44o1_Dw4QsQZRtBJgwZaA",
            "_HMiq7vSET4uhNScBdOJnw",
            "2qw1-Q_sVbo9QHWDlmznsw"
        ],
        "explanation": {
            "BYwoAKKtdSeylSN7QV8oNw": "This restaurant is known for its vibrant atmosphere and highly photogenic dishes, making it ideal for Instagram-worthy experiences.",
            "lycfBKtcR7keDQQOeMMsoA": "Offers a variety of group-friendly dishes with a diverse range of spices, appealing to those who enjoy robust flavors.",
            "x44o1_Dw4QsQZRtBJgwZaA": "While still a good choice, it lacks some of the visual appeal and group-friendly menu options compared to the top picks.",
            "_HMiq7vSET4uhNScBdOJnw": "This option is known for its spicy dishes but may not be as visually appealing in a group setting.",
            "2qw1-Q_sVbo9QHWDlmznsw": "Although it has solid dishes, it doesn't align as well with the need for a group-friendly environment or Instagram aesthetics."
        }
    },
    "Wz3F688OvXo5mjv3TmQO7w": {
        "kw": [
            "place",
            "dish",
            "desserts",
            "service",
            "food"
        ],
        "candidate": [
            "UDXIJd-jPiVXp2ZoQwJt8g",
            "Csr5OTkr0JX6Ho6Rm3b9qA",
            "vZiWYH4XIiy3fqPNy615Kg",
            "eCrnMk8-7not5ZjSfjQJ2g",
            "ukt4MFLf8IpsI420CJCMkA"
        ],
        "explanation": {
            "UDXIJd-jPiVXp2ZoQwJt8g": "This restaurant excels in service and has a diverse menu that matches the user's dish preferences.",
            "Csr5OTkr0JX6Ho6Rm3b9qA": "Offers high-quality food and delicious desserts, making it a strong contender based on the user's interests.",
            "vZiWYH4XIiy3fqPNy615Kg": "Provides a good experience in food variety though slightly less attention to desserts compared to the top two.",
            "eCrnMk8-7not5ZjSfjQJ2g": "Known for its ambiance and service but falls short on dessert options, affecting its overall score.",
            "ukt4MFLf8IpsI420CJCMkA": "Good for food, but overall experience lags in terms of service and dessert offerings."
        }
    },
    "ykj_bzOhA4qt6p-8HAHoaA": {
        "kw": [
            "place",
            "friends",
            "dessert",
            "people",
            "food"
        ],
        "candidate": [
            "f0XsCt81O34aR6BEo7GyQg",
            "2FLfIQ9u3PJKg2iLhkl91A",
            "ahlZC7XOKN-XJ7P4sPZrRg",
            "7LFdimtQU3yrgiKyE53klQ"
        ],
        "explanation": {
            "f0XsCt81O34aR6BEo7GyQg": "This restaurant provides a vibrant atmosphere perfect for groups and is known for its excellent dessert options.",
            "2FLfIQ9u3PJKg2iLhkl91A": "This place is popular among friends for its delicious food and offers a cozy environment for social gatherings.",
            "ahlZC7XOKN-XJ7P4sPZrRg": "While it has good food, the ambiance is slightly less suited for large groups and lacks standout dessert items.",
            "7LFdimtQU3yrgiKyE53klQ": "This restaurant offers decent food but has a more subdued atmosphere, making it less ideal for a lively outing with friends."
        }
    },
    "jkr3YVCEoRNKkxinUZpW6A": {
        "kw": [
            "place",
            "bar",
            "dinner",
            "lot",
            "items"
        ],
        "candidate": [
            "VEy3-SnvsKgWfGM_b2irbA",
            "6LgTc7CZlXCd1Pxq3BiVcw",
            "rAy5tizRpmTpZBg_0aTlKg",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "i5dxKKLe2kJ8WbPUXilPGg."
        ],
        "explanation": {
            "VEy3-SnvsKgWfGM_b2irbA": "This restaurant features a vibrant bar atmosphere and offers a great selection for dinner, satisfying the user's top preferences.",
            "6LgTc7CZlXCd1Pxq3BiVcw": "Known for its parking availability and dinner menu, it follows closely after the top choice.",
            "rAy5tizRpmTpZBg_0aTlKg": "This place is a good option for dinner and has a decent bar, but lacks somewhat in parking space.",
            "vVqxGrqt5ALxQjJGnntpKQ": "While it offers a nice dinner setting, the parking and bar experience may not be as favorable.",
            "i5dxKKLe2kJ8WbPUXilPGg": "This restaurant is less ideal regarding a bar atmosphere and does not quite meet the parking needs as well as the others."
        }
    },
    "kw4Q3Qfj_8WxjTNExSi1hw": {
        "kw": [
            "place",
            "people",
            "food",
            "singapore",
            "rice"
        ],
        "candidate": [
            "fqhahiKsc6gPs5Sx4mf9Vg",
            "hSEGyy0-i1_ZXGIRySbgcg",
            "7LFdimtQU3yrgiKyE53klQ",
            "fY1IkBnRft1KR0O2tqu7pg",
            "K0jxSR_b1Bm4vmjCeSx9qA"
        ],
        "explanation": {
            "fqhahiKsc6gPs5Sx4mf9Vg": "Known for its excellent variety of rice-based dishes and vibrant atmosphere where people often dine together.",
            "hSEGyy0-i1_ZXGIRySbgcg": "Offers a popular local rice dish that is frequently enjoyed by groups, making it a great choice for communal meals.",
            "7LFdimtQU3yrgiKyE53klQ": "Features rice in its menu but may not have as strong a social dining aspect as the top two.",
            "fY1IkBnRft1KR0O2tqu7pg": "While it has some rice options, it's less focused on local cuisine, which may not be as appealing to the user.",
            "K0jxSR_b1Bm4vmjCeSx9qA": "Offers limited rice options and lacks a strong connection to the local dining culture in Singapore."
        }
    },
    "XuCbLgo9j1q5dDh9251vkg": {
        "kw": [
            "place",
            "lot",
            "dish",
            "friends",
            "side"
        ],
        "candidate": [
            "CdAmgWWCabZQoYNNWOKcEw",
            "7LFdimtQU3yrgiKyE53klQ",
            "MuaIn9h_YOAmZxHxtQXAAw",
            "x0Pk5Uvy0y63FSzcfmxRpQ"
        ],
        "explanation": {
            "CdAmgWWCabZQoYNNWOKcEw": "Offers a lively atmosphere perfect for dining with friends and provides excellent shareable dishes.",
            "7LFdimtQU3yrgiKyE53klQ": "Features a spacious lot and great side options, ideal for friend gatherings and convenient parking.",
            "MuaIn9h_YOAmZxHxtQXAAw": "Known for standout main dishes but slightly less social atmosphere compared to the top picks.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "While it has good food, it lacks the social vibe and side variety important for this group dining preference."
        }
    },
    "IFkSQLXXTMACoWirAYI1jw": {
        "kw": [
            "place",
            "dish",
            "spices",
            "try",
            "singapore"
        ],
        "candidate": [
            "U3i7AaegudvpmDL23_wEmQ",
            "2qw1-Q_sVbo9QHWDlmznsw",
            "fY1IkBnRft1KR0O2tqu7pg",
            "bjL1PC2e9dvjBVewmoXYwQ",
            "ADtSvzL_abKwWPM1EL2yJw"
        ],
        "explanation": {
            "U3i7AaegudvpmDL23_wEmQ": "This restaurant excels in authentic Singaporean dishes rich in spices, making it a top choice to experience local flavors.",
            "2qw1-Q_sVbo9QHWDlmznsw": "Known for its vibrant dishes and emphasis on fresh ingredients, this place is perfect for trying new tastes.",
            "fY1IkBnRft1KR0O2tqu7pg": "This establishment offers a blend of traditional and modern Singaporean cuisine, appealing to those looking to try something different.",
            "bjL1PC2e9dvjBVewmoXYwQ": "While decent, it doesn’t quite match the other options in terms of local authenticity and spice level.",
            "ADtSvzL_abKwWPM1EL2yJw": "This restaurant is more generic and lacks the distinctive flavors that define Singaporean cuisine, making it the least favorable option for trying new dishes."
        }
    },
    "1Sxapu-7u6YpmmhVPsLuKQ": {
        "kw": [
            "place",
            "shop",
            "dinner",
            "lot",
            "fries"
        ],
        "candidate": [
            "BYwoAKKtdSeylSN7QV8oNw",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "HALtXIDS54MBLYD3VRyJ8A",
            "Rl318hUrGlkPJhMmNNZizQ",
            "fqhahiKsc6gPs5Sx4mf9Vg"
        ],
        "explanation": {
            "BYwoAKKtdSeylSN7QV8oNw": "This place best fits the casual dining vibe with ample space and is known for its excellent fries.",
            "vVqxGrqt5ALxQjJGnntpKQ": "A good option that provides a shop atmosphere, though it may be slightly more crowded.",
            "HALtXIDS54MBLYD3VRyJ8A": "Convenient for a dinner stop, but lacks the casual shop feel and space compared to the top two.",
            "Rl318hUrGlkPJhMmNNZizQ": "This spot is okay for dinner but does not emphasize fries as much as the higher-ranked places.",
            "fqhahiKsc6gPs5Sx4mf9Vg": "While it has a lot of space, its food offerings aren't particularly memorable, especially in terms of fries."
        }
    },
    "u0LXt3Uea_GidxRW1xcsfg": {
        "kw": [
            "place",
            "people",
            "service",
            "rice",
            "one"
        ],
        "candidate": [
            "4ZOXsBhHx2EzrTwACILK2A",
            "DbvK2HkM-wxbEQxlmczAlQ",
            "bjL1PC2e9dvjBVewmoXYwQ",
            "CdAmgWWCabZQoYNNWOKcEw",
            "x0Pk5Uvy0y63FSzcfmxRpQ."
        ],
        "explanation": {
            "4ZOXsBhHx2EzrTwACILK2A": "Known for its inviting atmosphere and excellent service, making it a great choice for a pleasant dining experience.",
            "DbvK2HkM-wxbEQxlmczAlQ": "Offers a diverse selection of rice-based dishes and warm, attentive service.",
            "bjL1PC2e9dvjBVewmoXYwQ": "A solid choice with decent rice options, though customer service may vary.",
            "CdAmgWWCabZQoYNNWOKcEw": "Has good food but not as well regarded for service or ambiance as the top choices.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "While popular, it lacks the atmosphere and consistent service the user is likely seeking."
        }
    },
    "mPOk4zvDocFVTjoGiPkQtA": {
        "kw": [
            "place",
            "singapore",
            "restaurant",
            "soup",
            "list"
        ],
        "candidate": [
            "CMaUuuEC9wmUeZK9L-885Q",
            "_HMiq7vSET4uhNScBdOJnw",
            "fY1IkBnRft1KR0O2tqu7pg",
            "lJ5YkS5fxC8dcSK4FPtyYQ"
        ],
        "explanation": {
            "CMaUuuEC9wmUeZK9L-885Q": "This restaurant is highly recommended for its signature soup dishes, making it a top choice for soup lovers in Singapore.",
            "_HMiq7vSET4uhNScBdOJnw": "Known for its rich flavors and variety, this spot specializes in traditional soups that capture local culinary heritage.",
            "fY1IkBnRft1KR0O2tqu7pg": "Offers a good selection of soups, but not as well-ranked for their focus compared to the first two.",
            "lJ5YkS5fxC8dcSK4FPtyYQ": "While it serves some soups, the overall menu is more diverse and might not align as closely with a soup-centric preference."
        }
    },
    "PMMcGelLIQEF_7mILSBkJA": {
        "kw": [
            "place",
            "hours",
            "meat",
            "waiter",
            "people"
        ],
        "candidate": [
            "Yp3CLIf55i9sY7tVAO6a3Q",
            "IC15vAUX4EiMlWxxMehohw",
            "om14ZRoz5wTmPzie1V-zmA",
            "CdAmgWWCabZQoYNNWOKcEw",
            "x0Pk5Uvy0y63FSzcfmxRpQ"
        ],
        "explanation": {
            "Yp3CLIf55i9sY7tVAO6a3Q": "Noted for its vibrant atmosphere and excellent meat dishes, making it ideal for social dining.",
            "IC15vAUX4EiMlWxxMehohw": "Offers a good selection of meat options and has more favorable hours for dinner.",
            "om14ZRoz5wTmPzie1V-zmA": "While it has good food, it may not be as focused on meat or the preferred experience.",
            "CdAmgWWCabZQoYNNWOKcEw": "Provides a decent dining experience but is less focused on meat compared to the top ranks.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "Though a solid option, it rated lower due to less favorable operating hours and fewer meat-focused choices."
        }
    },
    "mSIHzvUKXiCtPBxywY7Xsg": {
        "kw": [
            "place",
            "dish",
            "try",
            "service",
            "food"
        ],
        "candidate": [
            "LPtMf4KcWYD_T6vI8kA34A",
            "CtKk2tB1I0QNui996NR2pg",
            "3hxwHzQ432UL3rQAWJG5TA",
            "2tGFUtUrE0DhwlX59pbArA",
            "r2L533c9lFGpjcuUJKY2PA"
        ],
        "explanation": {
            "LPtMf4KcWYD_T6vI8kA34A": "This restaurant excels in both service and food quality, making it a strong favorite.",
            "CtKk2tB1I0QNui996NR2pg": "Known for its unique dishes and excellent ambiance, this spot is a must-try.",
            "3hxwHzQ432UL3rQAWJG5TA": "Offers good food and a pleasant place but slightly lacks in service compared to the top two.",
            "2tGFUtUrE0DhwlX59pbArA": "While it has decent food, it's overshadowed by more favored options in terms of overall experience.",
            "r2L533c9lFGpjcuUJKY2PA": "Ranks lowest due to average service and less appealing dish options relative to others."
        }
    },
    "4MeyfdyeJ38A_wOKLapRMQ": {
        "kw": [
            "place",
            "desserts",
            "dessert",
            "service",
            "food"
        ],
        "candidate": [
            "I1wArJIYbFl2txUL6unC6A",
            "t88UJ1i5c2HxbWQTV440mg",
            "JG3Yw6z48y6Eyi0DnN19tQ",
            "kA5pZz-koXIlPaDJALDroQ",
            "dFYfZsc-SUwRpDEgJiIoXA"
        ],
        "explanation": {
            "I1wArJIYbFl2txUL6unC6A": "This restaurant is known for its exceptional desserts and attentive service, making it a top choice for dessert lovers.",
            "t88UJ1i5c2HxbWQTV440mg": "Renowned for both its dessert selection and quality food, it offers a satisfying experience across preferences.",
            "JG3Yw6z48y6Eyi0DnN19tQ": "While it has good food, its dessert options are slightly less impressive compared to the top two.",
            "kA5pZz-koXIlPaDJALDroQ": "This spot provides decent food and service but lacks standout dessert offerings.",
            "dFYfZsc-SUwRpDEgJiIoXA": "Although it's well-rated, it falls lower due to average dessert options and service compared to the others listed."
        }
    },
    "neY6_AqAzhp11oRfViMgjg": {
        "kw": [
            "place",
            "dinner",
            "dish",
            "side",
            "meat"
        ],
        "candidate": [
            "J9rMt_V1NX49rU3YUjh_7Q",
            "EqdAzi9c5xuhxN9brmEaZw",
            "cEX4Cw8q2ftBrbpCvInf0w",
            "i5dxKKLe2kJ8WbPUXilPGg"
        ],
        "explanation": {
            "J9rMt_V1NX49rU3YUjh_7Q": "Known for its extensive dinner menu featuring high-quality meat options and complementary sides.",
            "EqdAzi9c5xuhxN9brmEaZw": "Offers a strong selection of meat dishes with a focus on unique preparations and popular side choices.",
            "cEX4Cw8q2ftBrbpCvInf0w": "While this restaurant has decent meat offerings, it is slightly less favored due to limited side options compared to the top two.",
            "i5dxKKLe2kJ8WbPUXilPGg": "This restaurant ranks lower as it specializes more in vegetarian options and may not cater adequately to meat-centric preferences."
        }
    },
    "BIGlirQ2B5zErr9CdQZC0A": {
        "kw": [
            "place",
            "food",
            "singapore",
            "great place",
            "location"
        ],
        "candidate": [
            "KX5KY8fLlMoJMS1NAj0Pvw",
            "7LFdimtQU3yrgiKyE53klQ",
            "I1wArJIYbFl2txUL6unC6A",
            "tRPHSd0ow1hsqMRxyMePeg",
            "i5dxKKLe2kJ8WbPUXilPGg"
        ],
        "explanation": {
            "KX5KY8fLlMoJMS1NAj0Pvw": "Known for its superb location and excellent food, making it a top choice for a great dining experience.",
            "7LFdimtQU3yrgiKyE53klQ": "Offers a well-regarded menu and a pleasant atmosphere that aligns with the user's desire for a great place.",
            "I1wArJIYbFl2txUL6unC6A": "Popular with locals for its food quality, although slightly less prominent in location than the top two.",
            "tRPHSd0ow1hsqMRxyMePeg": "Good food but may not have the ideal location compared to others on the list.",
            "i5dxKKLe2kJ8WbPUXilPGg": "While it has its merits, it ranks lower due to less favorable feedback on location and dining experience compared to the others."
        }
    },
    "-R30cfDhWG9-_8sfHU1IHw": {
        "kw": [
            "place",
            "free flow",
            "vegetables",
            "soup",
            "space"
        ],
        "candidate": [
            "GqZlZ412ixwUxU9GfxStgQ",
            "69-vLz9AF84FsJmX3cpU9g",
            "ZhJ59SFPifQiTW0gAddfGw",
            "x0Pk5Uvy0y63FSzcfmxRpQ",
            "fY1IkBnRft1KR0O2tqu7pg"
        ],
        "explanation": {
            "GqZlZ412ixwUxU9GfxStgQ": "This restaurant offers a spacious setting and has a variety of soup options along with a good selection of vegetables in their free-flow menu.",
            "69-vLz9AF84FsJmX3cpU9g": "It provides a free flow concept with ample space and choices emphasizing fresh vegetables, making it suitable for the user's preferences.",
            "ZhJ59SFPifQiTW0gAddfGw": "While it has a decent space, it excels more in traditional dishes than the specific preference for soup and a free-flow setup.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "This option is good for ambiance but lacks the free-flow concept and variety of soups or vegetables compared to the top choices.",
            "fY1IkBnRft1KR0O2tqu7pg": "This restaurant has a limited selection of options overall, which makes it less desirable for someone seeking a diverse, vegetable-rich free flow experience."
        }
    },
    "HRogYuuae1e-Z6EMVQsReg": {
        "kw": [
            "place",
            "bar",
            "fries",
            "side",
            "people"
        ],
        "candidate": [
            "J9rMt_V1NX49rU3YUjh_7Q",
            "NbQH02mMYJ4r1RqvG2FDBA",
            "YkVRDcEa7vZK65u-tlL9tQ",
            "7LFdimtQU3yrgiKyE53klQ"
        ],
        "explanation": {
            "J9rMt_V1NX49rU3YUjh_7Q": "This restaurant offers a great bar atmosphere and a reputation for excellent fries, making it a favored spot for socializing.",
            "NbQH02mMYJ4r1RqvG2FDBA": "Known for its lively environment, it also serves good sides which complements the dining experience.",
            "YkVRDcEa7vZK65u-tlL9tQ": "While it has a decent menu, the interaction level and fries are not as strong as the top two.",
            "7LFdimtQU3yrgiKyE53klQ": "This venue lacks a notable bar and social atmosphere, making it less appealing for the user's specified preferences."
        }
    },
    "buhaawsNr-41s2rdT3dJ5Q": {
        "kw": [
            "place",
            "dinner",
            "group",
            "fries",
            "desserts"
        ],
        "candidate": [
            "_HMiq7vSET4uhNScBdOJnw",
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "7LFdimtQU3yrgiKyE53klQ",
            "JHi4LCxdbpXthg98sQiicQ",
            "lE9qVePgvolkhw6C3Cdkeg"
        ],
        "explanation": {
            "_HMiq7vSET4uhNScBdOJnw": "This restaurant has a variety of shareable plates and is known for its delicious fries, making it ideal for a group.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Offers a solid menu with good dessert options and accommodates larger parties well.",
            "7LFdimtQU3yrgiKyE53klQ": "Known for great fries but slightly less accommodating for larger groups compared to the top two.",
            "JHi4LCxdbpXthg98sQiicQ": "Good overall, but less focus on desserts compared to higher-ranked options, which might be a drawback for the user.",
            "lE9qVePgvolkhw6C3Cdkeg": "While it has quality offerings, it is not as suited for group dining and has fewer dessert selections."
        }
    },
    "3A5qOhQOj2zHWMYgWtkkGQ": {
        "kw": [
            "place",
            "service",
            "food",
            "singapore",
            "great place"
        ],
        "candidate": [
            "_HMiq7vSET4uhNScBdOJnw",
            "I1wArJIYbFl2txUL6unC6A",
            "EGoCGAhJMivxr_C7H0hoKw",
            "bjL1PC2e9dvjBVewmoXYwQ"
        ],
        "explanation": {
            "_HMiq7vSET4uhNScBdOJnw": "This restaurant offers a unique ambiance and excellent service, making it a top choice for a great dining experience in Singapore.",
            "I1wArJIYbFl2txUL6unC6A": "Known for its high-quality food and attentive service, this place provides a delightful experience.",
            "EGoCGAhJMivxr_C7H0hoKw": "While it has good food, the service can be inconsistent, placing it slightly lower than others.",
            "bjL1PC2e9dvjBVewmoXYwQ": "This restaurant has decent offerings, but it lacks the overall experience and atmosphere that the other options provide."
        }
    },
    "wyNQqEbMfOgXr5rIfVr9Rg": {
        "kw": [
            "place",
            "people",
            "food",
            "singapore",
            "restaurant"
        ],
        "candidate": [
            "0OxNWfWooOChGVdRmCm9JQ",
            "fY1IkBnRft1KR0O2tqu7pg",
            "pKNDz1tzC5llbengNUz_7w",
            "4Xm4LZQjoavYm0Yjs1QgsQ",
            "f_7AwdIzdiAbAlL2u--BaQ"
        ],
        "explanation": {
            "0OxNWfWooOChGVdRmCm9JQ": "This restaurant is popular for its authentic local dishes and has a lively ambiance, making it ideal for socializing.",
            "fY1IkBnRft1KR0O2tqu7pg": "Known for its delicious food and excellent service, it attracts a good crowd, enhancing the dining experience.",
            "pKNDz1tzC5llbengNUz_7w": "Offers a nice blend of quality food and a pleasant atmosphere, perfect for enjoying meals with friends or family.",
            "4Xm4LZQjoavYm0Yjs1QgsQ": "While still a great choice, it ranks lower as it may not have the same level of ambiance as the top three.",
            "f_7AwdIzdiAbAlL2u--BaQ": "This place is recognized for its food but lacks the vibrant setting that the user prefers for a social dining experience."
        }
    },
    "lShwcacIvs5i2MYsQHPzMQ": {
        "kw": [
            "place",
            "lot",
            "squid",
            "people",
            "service"
        ],
        "candidate": [
            "fY1IkBnRft1KR0O2tqu7pg",
            "HrKm3MNLH4ubrYdM7rD_Fw",
            "cEX4Cw8q2ftBrbpCvInf0w",
            "lnC_BiucMb6YJjm392nwAQ",
            "ZhJ59SFPifQiTW0gAddfGw"
        ],
        "explanation": {
            "fY1IkBnRft1KR0O2tqu7pg": "Known for its great squid dishes and excellent service, it also has a welcoming atmosphere that suits social gatherings.",
            "HrKm3MNLH4ubrYdM7rD_Fw": "Offers a spacious lot for parking and a comfortable ambiance, along with good service and decent seafood options.",
            "cEX4Cw8q2ftBrbpCvInf0w": "A solid choice for fresh seafood, though it has a less vibrant social atmosphere compared to those ranked higher.",
            "lnC_BiucMb6YJjm392nwAQ": "While it has a unique place aspect, it lags in squid offerings and overall service experience.",
            "ZhJ59SFPifQiTW0gAddfGw": "Although it has a loyal following, it does not prioritize squid dishes or service quality as highly as the other options."
        }
    },
    "Ww-VExe53555lkzZAauCGQ": {
        "kw": [
            "place",
            "bar",
            "steak",
            "service",
            "food"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "7LFdimtQU3yrgiKyE53klQ",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "ahlZC7XOKN-XJ7P4sPZrRg",
            "x44o1_Dw4QsQZRtBJgwZaA"
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "This restaurant offers high-quality steaks and an elegant bar atmosphere, making it the top choice.",
            "7LFdimtQU3yrgiKyE53klQ": "Known for its excellent service and tasty food, it ranks close due to its strong offerings in both steak and overall dining experience.",
            "vVqxGrqt5ALxQjJGnntpKQ": "This venue provides good steak options and a decent bar scene, suitable for this ranking position.",
            "ahlZC7XOKN-XJ7P4sPZrRg": "Although it has good food, its steak options are limited compared to those ranked higher, hence it falls in this position.",
            "x44o1_Dw4QsQZRtBJgwZaA": "It has lower ratings in terms of both service and steak quality, placing it at the bottom of the ranking."
        }
    },
    "spcWkD16-UyUCdeyePYQCA": {
        "kw": [
            "place",
            "try",
            "singapore",
            "restaurant",
            "meal"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "fY1IkBnRft1KR0O2tqu7pg",
            "NbQH02mMYJ4r1RqvG2FDBA",
            "KPrdWch1680ihzVe3C-s3w",
            "at7wfECnjgIJi5o7gL8fyQ"
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "This restaurant offers a unique local dining experience that showcases the best of Singaporean cuisine.",
            "fY1IkBnRft1KR0O2tqu7pg": "Its innovative menu and excellent reviews make it a must-try for anyone looking for memorable meals.",
            "NbQH02mMYJ4r1RqvG2FDBA": "Known for its vibrant atmosphere and consistent quality, it's a solid choice for enjoying local flavors.",
            "KPrdWch1680ihzVe3C-s3w": "Offers a great mix of traditional and modern dishes, appealing to both locals and visitors.",
            "at7wfECnjgIJi5o7gL8fyQ": "While still a good restaurant, it falls slightly behind the others in terms of culinary uniqueness and overall experience."
        }
    },
    "N7mseQyyeKdl57CEld0liw": {
        "kw": [
            "place",
            "friends",
            "food",
            "location",
            "friend"
        ],
        "candidate": [
            "6LgTc7CZlXCd1Pxq3BiVcw",
            "QxT3goSTkSGWqq4ecId_AQ",
            "CdAmgWWCabZQoYNNWOKcEw",
            "ZhJ59SFPifQiTW0gAddfGw",
            "i5dxKKLe2kJ8WbPUXilPGg"
        ],
        "explanation": {
            "6LgTc7CZlXCd1Pxq3BiVcw": "This restaurant is well-known for its vibrant atmosphere, making it ideal for dining out with friends.",
            "QxT3goSTkSGWqq4ecId_AQ": "This place offers great food options and is conveniently located, perfect for a casual get-together.",
            "CdAmgWWCabZQoYNNWOKcEw": "While it has good food, it may lack some of the lively atmosphere suitable for larger groups.",
            "ZhJ59SFPifQiTW0gAddfGw": "This restaurant is decent, but could be more suitable for quieter gatherings rather than a fun night out with friends.",
            "i5dxKKLe2kJ8WbPUXilPGg": "Despite some good reviews, this restaurant does not fully align with the group's dynamics or desired location."
        }
    },
    "9qH59jbkeu8NxL1DamklHg": {
        "kw": [
            "place",
            "shop",
            "lunch time",
            "food",
            "bowl"
        ],
        "candidate": [
            "Lv5GFFciSK532QIX2ZLqjg",
            "fY1IkBnRft1KR0O2tqu7pg",
            "71aipxvzUEEAd245w61o7A",
            "x0Pk5Uvy0y63FSzcfmxRpQ"
        ],
        "explanation": {
            "Lv5GFFciSK532QIX2ZLqjg": "This restaurant offers a variety of bowl options, making it ideal for a quick and satisfying lunch.",
            "fY1IkBnRft1KR0O2tqu7pg": "Known for its casual atmosphere and bowl-based meals, it complements lunch preferences perfectly.",
            "71aipxvzUEEAd245w61o7A": "While still a good choice, it didn't focus specifically on bowls, thus ranking lower.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "Although popular, it is less suited to the quick lunch and bowl-focused dining the user prefers."
        }
    },
    "WqMa1BLU2sgt16wnK1CblA": {
        "kw": [
            "place",
            "steak",
            "service",
            "food",
            "singapore"
        ],
        "candidate": [
            "KmKkhD-97CqPvokq5JIoBA",
            "7LFdimtQU3yrgiKyE53klQ",
            "ib_206uhcdzV7lNcCpniXA",
            "LFknVw6uTIaL-MY_RqkN7g"
        ],
        "explanation": {
            "KmKkhD-97CqPvokq5JIoBA": "Known for its high-quality steak and excellent service, this place stands out for food enthusiasts seeking a great dining experience in Singapore.",
            "7LFdimtQU3yrgiKyE53klQ": "Offers a solid menu with good steak options and a pleasant atmosphere, making it a reliable choice for enjoyable meals.",
            "ib_206uhcdzV7lNcCpniXA": "While it provides decent steak and service, it falls slightly behind in overall dining ambiance compared to the top two.",
            "LFknVw6uTIaL-MY_RqkN7g": "Although it has some good offerings, it does not match up to the others in terms of steak quality and service excellence."
        }
    },
    "MS54OoXe9O5O05JYQm2rBA": {
        "kw": [
            "place",
            "food",
            "restaurant",
            "free flow",
            "kind"
        ],
        "candidate": [
            "uQu5DtnXZZ8XVfBKldKnag",
            "J3ijSN86u_Pg42BZjkDM_g",
            "I1wArJIYbFl2txUL6unC6A",
            "Lv5GFFciSK532QIX2ZLqjg"
        ],
        "explanation": {
            "uQu5DtnXZZ8XVfBKldKnag": "This restaurant is known for its extensive and varied menu, perfect for someone who enjoys trying different dishes.",
            "J3ijSN86u_Pg42BZjkDM_g": "Offers a pleasant dining experience with attentive service and a good selection of free-flow options.",
            "I1wArJIYbFl2txUL6unC6A": "While it has decent food, the limited variety doesn’t fully meet the user's desire for expansive choices.",
            "Lv5GFFciSK532QIX2ZLqjg": "Though popular, it lacks the free-flow concept and diverse menu that align better with the user’s preferences."
        }
    },
    "PSiioYMqJ1r0On_RijpQaA": {
        "kw": [
            "place",
            "sandwiches",
            "meat",
            "dessert",
            "people"
        ],
        "candidate": [
            "_HMiq7vSET4uhNScBdOJnw",
            "hfP5UJGaCQBEaBx-uabkDA",
            "U3i7AaegudvpmDL23_wEmQ",
            "EECw-s6Jy-fyJHhkUGQhHg"
        ],
        "explanation": {
            "_HMiq7vSET4uhNScBdOJnw": "Known for its delicious sandwiches with quality meats, making it ideal for the user's preferences.",
            "hfP5UJGaCQBEaBx-uabkDA": "Offers a great selection of meat-based dishes and has a dessert menu that appeals to the user.",
            "U3i7AaegudvpmDL23_wEmQ": "While it has decent sandwiches, it ranks lower because it does not focus as much on dessert options.",
            "EECw-s6Jy-fyJHhkUGQhHg": "Primarily known for its atmosphere rather than the food quality, particularly in sandwiches and meat options, making it the least favorable option for the user."
        }
    },
    "9lkdbd_YX03kIY39WFS1ng": {
        "kw": [
            "place",
            "lot",
            "try",
            "dessert",
            "people"
        ],
        "candidate": [
            "I1wArJIYbFl2txUL6unC6A",
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "bjL1PC2e9dvjBVewmoXYwQ"
        ],
        "explanation": {
            "I1wArJIYbFl2txUL6unC6A": "This restaurant offers an inviting place with ample lot space and a variety of desserts, making it ideal for social dining.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "A good choice for its location and a decent dessert menu, although it may not have as much space for larger groups.",
            "bjL1PC2e9dvjBVewmoXYwQ": "While still a quality option, it ranks lower due to lesser dessert offerings and potentially less space for gathering people."
        }
    },
    "BcsJIPPBET8lJLQXR20t9w": {
        "kw": [
            "place",
            "dinner",
            "friends",
            "waiter",
            "service"
        ],
        "candidate": [
            "ib_206uhcdzV7lNcCpniXA",
            "3FgE99Li6EI2yTF5md0Z0g",
            "sxQdEEfKRviWRymOoH9UiA",
            "i5dxKKLe2kJ8WbPUXilPGg",
            "xD3L3JhNxsAfQikOHWHa4w"
        ],
        "explanation": {
            "ib_206uhcdzV7lNcCpniXA": "This restaurant has a vibrant atmosphere ideal for gatherings with friends and is praised for exceptional waiter service.",
            "3FgE99Li6EI2yTF5md0Z0g": "Known for its welcoming environment and attentive staff, making it a great choice for dinner with friends.",
            "sxQdEEfKRviWRymOoH9UiA": "Offers a balance of good food and a casual atmosphere, though service can be slightly varied.",
            "i5dxKKLe2kJ8WbPUXilPGg": "Known for quality but might offer a quieter environment that is less ideal for a lively dinner with friends.",
            "xD3L3JhNxsAfQikOHWHa4w": "While it has good food, it tends to be more formal, which may not suit the social dinner vibe preferred for friends."
        }
    },
    "Fsl7fnXttgugpoyuCJ0zkg": {
        "kw": [
            "place",
            "flavour",
            "meat",
            "food",
            "clams"
        ],
        "candidate": [
            "eawsC19ruMWUv0FsPMR3QA",
            "Bf5g9rQo8G1e_4Eu4diZJQ",
            "VWLfePKMEj7g2P77RvRDuA",
            "Lv5GFFciSK532QIX2ZLqjg",
            "mlnucLO7hYxKoH77FEHh2g"
        ],
        "explanation": {
            "eawsC19ruMWUv0FsPMR3QA": "This restaurant offers a diverse menu rich in flavour, with a strong emphasis on meat dishes and excellent clam options.",
            "Bf5g9rQo8G1e_4Eu4diZJQ": "Known for its vibrant atmosphere and flavorful food, this restaurant specializes in seafood, including clams, while also providing hearty meat selections.",
            "VWLfePKMEj7g2P77RvRDuA": "This spot excels in its meaty offerings and is particularly acclaimed for its unique flavour combinations and clam preparations.",
            "Lv5GFFciSK532QIX2ZLqjg": "Featuring a good variety of dishes including meat, this restaurant has decent clam options but is not as flavour-forward or specialized.",
            "mlnucLO7hYxKoH77FEHh2g": "While it serves excellent food, it lacks the strong focus on clams and meat that the user prefers."
        }
    },
    "iVwVq297778VCSDazsLEKg": {
        "kw": [
            "place",
            "lunch time",
            "cooks",
            "meat",
            "service"
        ],
        "candidate": [
            "gPmD_yz_3DK6q8gmCfjpOA",
            "LPtMf4KcWYD_T6vI8kA34A",
            "fY1IkBnRft1KR0O2tqu7pg",
            "4l9M9C96HW6JpwrQPJGMNQ"
        ],
        "explanation": {
            "gPmD_yz_3DK6q8gmCfjpOA": "This restaurant is known for its excellent lunch options with high-quality meat and attentive service, making it the top choice.",
            "LPtMf4KcWYD_T6vI8kA34A": "This venue also offers great meat dishes and is a good place for lunch, but slightly less impressive than the top spot in terms of service.",
            "fY1IkBnRft1KR0O2tqu7pg": "While providing good food, this restaurant is better suited for dinner and lacks the quick service ideal for lunch.",
            "4l9M9C96HW6JpwrQPJGMNQ": "This place offers decent food but has a reputation for slower service and is less focused on meat dishes for lunch."
        }
    },
    "0nOIH8qIMnmZdLCTemnRsw": {
        "kw": [
            "place",
            "broth",
            "location",
            "night",
            "lunch"
        ],
        "candidate": [
            "7LFdimtQU3yrgiKyE53klQ",
            "CdAmgWWCabZQoYNNWOKcEw",
            "_HMiq7vSET4uhNScBdOJnw",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "3hxwHzQ432UL3rQAWJG5TA"
        ],
        "explanation": {
            "7LFdimtQU3yrgiKyE53klQ": "This restaurant excels in broth flavor, making it a standout choice for both lunch and dinner.",
            "CdAmgWWCabZQoYNNWOKcEw": "Known for its convenient location and good quality broth, it ranks high for accessibility and taste.",
            "_HMiq7vSET4uhNScBdOJnw": "Offers a solid menu with good lunch options, though slightly less impressive in broth compared to the top two.",
            "J9rMt_V1NX49rU3YUjh_7Q": "Presents decent options but lacks distinction in broth flavor, putting it lower in preference.",
            "3hxwHzQ432UL3rQAWJG5TA": "While it has a loyal following, its broth and overall offerings don’t align as closely with the user's preferences as others."
        }
    },
    "leLFG88-47YklIbOY9E9Sg": {
        "kw": [
            "place",
            "meat",
            "sauce",
            "egg",
            "skin"
        ],
        "candidate": [
            "gQVBGe7A45rXgV6NL7X_mg",
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "avrJOt2Kzk7fUpe4D4_DAQ",
            "BYwoAKKtdSeylSN7QV8oNw",
            "vZiWYH4XIiy3fqPNy615Kg"
        ],
        "explanation": {
            "gQVBGe7A45rXgV6NL7X_mg": "This restaurant is praised for its flavorful meat dishes paired with luscious sauces, fulfilling the user's preference for meat and sauce.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Known for its unique meat and egg combinations, it also offers dishes with crispy skin that enhance flavor and texture.",
            "avrJOt2Kzk7fUpe4D4_DAQ": "It provides quality meat options and often features rich sauces that pair well with various dishes, appealing to the user's tastes.",
            "BYwoAKKtdSeylSN7QV8oNw": "While it serves good meat, it does not emphasize sauce and egg dishes as strongly, placing it slightly lower in preference.",
            "vZiWYH4XIiy3fqPNy615Kg": "Though it has solid offerings, it is less focused on meat and sauces which are critical for the user's satisfaction."
        }
    },
    "0rFbt0d33MTX6qQo-4YmSA": {
        "kw": [
            "place",
            "food",
            "staff",
            "bacon",
            "coffee"
        ],
        "candidate": [
            "NKkh6R7i2DQbUtyd5IdG_A",
            "fo5BCGsrqxe7gZd8Fv1n4g",
            "NRrWbjN1X1X7Z1z_u5bFKQ",
            "5LMkTnMXOxlce_LwUNhpCQ",
            "zo92mzQ7NBlazYi1F0KHMw."
        ],
        "explanation": {
            "NKkh6R7i2DQbUtyd5IdG_A": "This restaurant is known for its superior coffee selection and bacon dishes, making it a top choice.",
            "fo5BCGsrqxe7gZd8Fv1n4g": "Newly ranked, this place has excellent staff and a unique menu that features multiple bacon options.",
            "NRrWbjN1X1X7Z1z_u5bFKQ": "Good food and decent staff, but less emphasis on coffee and bacon compared to the top places.",
            "5LMkTnMXOxlce_LwUNhpCQ": "Offers solid dishes and good service, but didn't stand out as much in bacon or coffee choices.",
            "zo92mzQ7NBlazYi1F0KHMw": "Last in the ranking due to a lack of notable specialties in bacon or coffee, though overall service is acceptable."
        }
    },
    "2Kq0rEgkla7UX0Q3dqQBJA": {
        "kw": [
            "place",
            "lot",
            "items",
            "waiter",
            "people"
        ],
        "candidate": [
            "CTYFfHq1SWFyCeJ-KyIgOQ",
            "YnnYwfMEeSru_cJ_qKeofw",
            "i5dxKKLe2kJ8WbPUXilPGg",
            "ymAw53bQVppVV7T40fNgRw",
            "bjL1PC2e9dvjBVewmoXYwQ"
        ],
        "explanation": {
            "CTYFfHq1SWFyCeJ-KyIgOQ": "This restaurant offers an inviting atmosphere and attentive service, aligning well with the user’s preference for a pleasant dining experience.",
            "YnnYwfMEeSru_cJ_qKeofw": "Known for its spacious setting and quality items, this restaurant enhances the overall dining experience and comes in second.",
            "i5dxKKLe2kJ8WbPUXilPGg": "While it has good items, it lacks some of the atmosphere and service quality that the user values.",
            "ymAw53bQVppVV7T40fNgRw": "This venue has a decent selection but does not provide a memorable experience in terms of waiter interaction or ambiance.",
            "bjL1PC2e9dvjBVewmoXYwQ": "Although it ranks lowest, it remains a reliable option but does not meet the user’s refined preferences."
        }
    },
    "BNgs67ayYRDqdmrYNREnsg": {
        "kw": [
            "place",
            "items",
            "dish",
            "service",
            "food"
        ],
        "candidate": [
            "Ku333V1F3_9MVKUJ72_ZBw",
            "-U4BnQL4VC3dkRDUZL0i8Q",
            "ymAw53bQVppVV7T40fNgRw",
            "_7nMWBmfFvk9S3tKG3Ip_g",
            "GGMka0ITgk7w_YUHUo8gqg"
        ],
        "explanation": {
            "Ku333V1F3_9MVKUJ72_ZBw": "This restaurant is known for excellent service, a diverse menu, and high food quality, making it the top choice.",
            "-U4BnQL4VC3dkRDUZL0i8Q": "It offers great dishes and reliable service, which aligns well with user preferences.",
            "ymAw53bQVppVV7T40fNgRw": "This place has a decent selection of items and consistent food quality, placing it next in the ranking.",
            "_7nMWBmfFvk9S3tKG3Ip_g": "While it has good food, the service and dish variety are lacking, leading to a lower ranking.",
            "GGMka0ITgk7w_YUHUo8gqg": "Although it is popular, the food and service do not meet the user's expectations as strongly as the others."
        }
    },
    "DhLkzLT23zK7uFUP5MtP3Q": {
        "kw": [
            "place",
            "dinner",
            "try",
            "people",
            "public holiday"
        ],
        "candidate": [
            "r4fKOExeR6lvb6C-YFsv0Q",
            "ADtSvzL_abKwWPM1EL2yJw",
            "Lv5GFFciSK532QIX2ZLqjg",
            "OuU88_AEU5lo-t_XQpTyKg"
        ],
        "explanation": {
            "r4fKOExeR6lvb6C-YFsv0Q": "This restaurant has a vibrant ambiance and is known for accommodating large groups, making it perfect for a festive holiday dinner.",
            "ADtSvzL_abKwWPM1EL2yJw": "A popular choice for dinner that offers a variety of dishes, ensuring there's something for everyone in the group.",
            "Lv5GFFciSK532QIX2ZLqjg": "This restaurant features a cozy setting ideal for dinner, but might be a little quieter, which could appeal to some.",
            "OuU88_AEU5lo-t_XQpTyKg": "While it has great food, it's less suitable for larger groups or the festive atmosphere typically desired on public holidays."
        }
    },
    "DvcAC_nlKaTDsHcA8Slagw": {
        "kw": [
            "place",
            "dinner",
            "lot",
            "items",
            "cents"
        ],
        "candidate": [
            "V6ZbbgJMenh5XCQ1H4hrYw",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "P-X4kr5pDqXzhPEfa6RsTQ",
            "6LgTc7CZlXCd1Pxq3BiVcw",
            "Rwzp59f3Ia-v2V8Ku0zZWQ"
        ],
        "explanation": {
            "V6ZbbgJMenh5XCQ1H4hrYw": "Offers a spacious environment and extensive dinner menu options.",
            "vVqxGrqt5ALxQjJGnntpKQ": "Known for affordable prices and a good selection of items.",
            "P-X4kr5pDqXzhPEfa6RsTQ": "Provides a decent variety of dishes for dinner but is slightly less spacious.",
            "6LgTc7CZlXCd1Pxq3BiVcw": "Smaller than preferred but offers good quality food at reasonable costs.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Limited menu options and space make it the least favorable for the user's dinner preference."
        }
    },
    "Q_xp4HJSPvyv7AOnetmjfw": {
        "kw": [
            "place",
            "bunch",
            "meat",
            "people",
            "food"
        ],
        "candidate": [
            "YPbSFZSoIMuGu2LD6WPllQ",
            "fY1IkBnRft1KR0O2tqu7pg",
            "lycfBKtcR7keDQQOeMMsoA",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "lJ5YkS5fxC8dcSK4FPtyYQ"
        ],
        "explanation": {
            "YPbSFZSoIMuGu2LD6WPllQ": "Best suited for groups with a variety of meat-focused dishes and a lively atmosphere.",
            "fY1IkBnRft1KR0O2tqu7pg": "Offers great meat options and is known for its bustling environment, making it perfect for social gatherings.",
            "lycfBKtcR7keDQQOeMMsoA": "A solid choice for meat lovers, although it may not have the same energetic vibe as the top two.",
            "vVqxGrqt5ALxQjJGnntpKQ": "While it has good food, it’s less ideal for larger groups compared to the others.",
            "lJ5YkS5fxC8dcSK4FPtyYQ": "Known for small plates, but it doesn't focus on meat or a group-friendly atmosphere as much as the higher-ranked options."
        }
    },
    "Cdf3Rf4WD-iTEQYIzSZ_AQ": {
        "kw": [
            "place",
            "lunch time",
            "dish",
            "flavour",
            "desserts"
        ],
        "candidate": [
            "XuxzGu2PEr59drHseZOVCg",
            "Zz8xPKC4RDGJCB49R_w9hQ",
            "cEX4Cw8q2ftBrbpCvInf0w",
            "XLa3iW4hkLyImtZAx61lSg"
        ],
        "explanation": {
            "XuxzGu2PEr59drHseZOVCg": "This restaurant is ideal for lunch, offering flavorful dishes and a variety of desserts that align with user preferences.",
            "Zz8xPKC4RDGJCB49R_w9hQ": "Recommended for its lunch menu options and delightful dessert selection, making it a strong second choice.",
            "cEX4Cw8q2ftBrbpCvInf0w": "While it has a decent menu, it lacks the dessert variety and lunch flexibility of the top two.",
            "XLa3iW4hkLyImtZAx61lSg": "This restaurant ranks lower due to limited lunch offerings and less focus on desserts, not meeting user preferences as well."
        }
    },
    "8ndGgI6Fhgm1kWvMdOzp_Q": {
        "kw": [
            "place",
            "dish",
            "food",
            "singapore",
            "restaurant"
        ],
        "candidate": [
            "bjL1PC2e9dvjBVewmoXYwQ",
            "4xrZmZJGrLY2kHL2ylM1uQ",
            "ul_m-XnIMAmddgqOpv5-aQ",
            "ukt4MFLf8IpsI420CJCMkA"
        ],
        "explanation": {
            "bjL1PC2e9dvjBVewmoXYwQ": "This restaurant is renowned for its authentic Singaporean dishes and has received rave reviews for its consistency and flavor.",
            "4xrZmZJGrLY2kHL2ylM1uQ": "Known for a unique signature dish that embodies local flavors, this spot offers a memorable dining experience.",
            "ul_m-XnIMAmddgqOpv5-aQ": "While popular, its overall dining experience does not meet the higher standards set by the top two, making it fall slightly lower.",
            "ukt4MFLf8IpsI420CJCMkA": "Although it has its merits, this restaurant lacks the distinctiveness and popularity of the others in the ranking."
        }
    },
    "pbFIcKknRHjLj1aKi6WAhg": {
        "kw": [
            "place",
            "friends",
            "fries",
            "steak",
            "ingredients"
        ],
        "candidate": [
            "OGIf_bb_QFY7hbYy4AlT0g",
            "NbQH02mMYJ4r1RqvG2FDBA",
            "VZcs1K7A31sNQurNXs9gaQ",
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "7LFdimtQU3yrgiKyE53klQ"
        ],
        "explanation": {
            "OGIf_bb_QFY7hbYy4AlT0g": "This restaurant stands out for its excellent steak options and renowned fries, making it a perfect fit for a friend gathering.",
            "NbQH02mMYJ4r1RqvG2FDBA": "Known for its fresh ingredients and a varied menu including great steak and fries, it ranks high for quality dining with friends.",
            "VZcs1K7A31sNQurNXs9gaQ": "Offers a decent selection of fries and steak, suitable for a casual outing but not as strong in quality compared to the top two.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "While popular, this restaurant does not focus heavily on fries or steak, resulting in a lower ranking.",
            "7LFdimtQU3yrgiKyE53klQ": "Although it has good offerings, it doesn't align as closely with the user's specific culinary preferences for high-quality fries and steak."
        }
    },
    "4aKBSZVBUSq1nfTrOHlAvQ": {
        "kw": [
            "place",
            "lunch time",
            "food",
            "singapore",
            "fish"
        ],
        "candidate": [
            "WFtN3VJ4Tft0hQHl6NZaAA",
            "gCTgjlUH5JQk0r-RZ7Gg_Q",
            "MvdRWrf33EkVW-2dzTuNyg",
            "CTYFfHq1SWFyCeJ-KyIgOQ",
            "xpHn6SAJ3xqJGgzZTASrSg"
        ],
        "explanation": {
            "WFtN3VJ4Tft0hQHl6NZaAA": "This restaurant is known for its fresh fish preparations, making it ideal for lunch in Singapore.",
            "gCTgjlUH5JQk0r-RZ7Gg_Q": "This place offers a variety of fish dishes tailored for the lunch crowd, enhancing its appeal.",
            "MvdRWrf33EkVW-2dzTuNyg": "Although less fish-centric, it still serves good options for a fish lunch in a local context.",
            "CTYFfHq1SWFyCeJ-KyIgOQ": "It has decent fish offerings but is better known for its overall dining experience rather than just fish.",
            "xpHn6SAJ3xqJGgzZTASrSg": "This option primarily focuses on different cuisines, with fish not being the highlight of the menu, thus placed last."
        }
    },
    "sby-fi2OMMU51PEHXInHKQ": {
        "kw": [
            "place",
            "friends",
            "people",
            "service",
            "food"
        ],
        "candidate": [
            "LFknVw6uTIaL-MY_RqkN7g",
            "5hhXqp01AKzysqWLM6apGg",
            "d3vB2tlgTEapMU_kGiXRoQ",
            "f0XsCt81O34aR6BEo7GyQg",
            "lE9qVePgvolkhw6C3Cdkeg"
        ],
        "explanation": {
            "LFknVw6uTIaL-MY_RqkN7g": "This restaurant is known for its vibrant atmosphere, making it ideal for enjoying good food with friends.",
            "5hhXqp01AKzysqWLM6apGg": "Offers excellent service and is a popular gathering spot, ensuring a lively experience when dining with a group.",
            "d3vB2tlgTEapMU_kGiXRoQ": "While it has good food, the atmosphere is more subdued, which might not fully meet the preference for a dynamic dining experience.",
            "f0XsCt81O34aR6BEo7GyQg": "This restaurant has decent food but can be hit or miss regarding service and ambiance for larger groups.",
            "lE9qVePgvolkhw6C3Cdkeg": "Though it has consistently good food, it lacks an exciting environment and is more suited for quieter meals."
        }
    },
    "O4sAznBNs3wrHaePq55S0w": {
        "kw": [
            "place",
            "service",
            "food",
            "singapore",
            "price"
        ],
        "candidate": [
            "wVwShEOsjRyN4W6CXduAlQ",
            "6LgTc7CZlXCd1Pxq3BiVcw",
            "uQu5DtnXZZ8XVfBKldKnag",
            "ZhJ59SFPifQiTW0gAddfGw",
            "lJ5YkS5fxC8dcSK4FPtyYQ."
        ],
        "explanation": {
            "wVwShEOsjRyN4W6CXduAlQ": "This restaurant offers a great location, excellent service, and is known for its high-quality food at reasonable prices, making it the top choice.",
            "6LgTc7CZlXCd1Pxq3BiVcw": "Positioned well in terms of ambiance and customer experience, this venue provides solid food options at a fair price, thus ranking second.",
            "uQu5DtnXZZ8XVfBKldKnag": "A popular spot with good service and decent food but slightly higher prices compared to the top two options, placing it in third.",
            "ZhJ59SFPifQiTW0gAddfGw": "Although this restaurant offers good food, its location and service are not as strong as the previous entries, landing it in fourth place.",
            "lJ5YkS5fxC8dcSK4FPtyYQ": "This restaurant is less favored due to its overall experience and higher prices relative to the quality of food and service it provides, thus ranking last."
        }
    },
    "OmUOyRV3sC1mG_yxKHXV8g": {
        "kw": [
            "place",
            "singapore",
            "great place",
            "fish head",
            "menu"
        ],
        "candidate": [
            "BYwoAKKtdSeylSN7QV8oNw",
            "XLa3iW4hkLyImtZAx61lSg",
            "tRPHSd0ow1hsqMRxyMePeg",
            "U3i7AaegudvpmDL23_wEmQ",
            "pJWufKPuAuRFUyky_LeUMg"
        ],
        "explanation": {
            "BYwoAKKtdSeylSN7QV8oNw": "Known for its specialty in fish head dishes, making it an ideal choice for the user.",
            "XLa3iW4hkLyImtZAx61lSg": "Offers a variety of seafood, including fish head options, and is well-rated for its ambiance.",
            "tRPHSd0ow1hsqMRxyMePeg": "A popular spot that serves good fish, though not exclusively fish head-focused.",
            "U3i7AaegudvpmDL23_wEmQ": "While it has a diverse menu, it ranks lower due to less emphasis on fish head dishes.",
            "pJWufKPuAuRFUyky_LeUMg": "Offers a more casual dining experience with limited fish head options, thus it is placed last."
        }
    },
    "XPFP9OVQFKqFg2E0YYK_FQ": {
        "kw": [
            "place",
            "dish",
            "service",
            "singapore",
            "rice"
        ],
        "candidate": [
            "NbNk81ze4wftHA9hoXik7A",
            "DHtvncPCxHKnuMgobG4inw",
            "r1W_Co451x1A1GCMkukMNw",
            "7gpa5X8YUlebQH7NiNkHbg",
            "ZhJ59SFPifQiTW0gAddfGw"
        ],
        "explanation": {
            "NbNk81ze4wftHA9hoXik7A": "Recognized for its exceptional rice dishes that cater to local tastes and offers outstanding service.",
            "DHtvncPCxHKnuMgobG4inw": "Popular choice in Singapore, known for delicious rice-based meals and attentive service.",
            "r1W_Co451x1A1GCMkukMNw": "Offers a variety of rice dishes in a convenient location with good service.",
            "7gpa5X8YUlebQH7NiNkHbg": "Provides decent rice options, but the overall experience is less memorable compared to the top three.",
            "ZhJ59SFPifQiTW0gAddfGw": "While it has good dishes, its focus isn't primarily on rice and service may vary."
        }
    },
    "S5ja_V3Igio4nZDxDH7TJA": {
        "kw": [
            "place",
            "waiter",
            "food",
            "ambience",
            "restaurant"
        ],
        "candidate": [
            "xD3L3JhNxsAfQikOHWHa4w",
            "ib_206uhcdzV7lNcCpniXA",
            "ZSpfF89JnQN6fiS8OhBlZQ",
            "pKrcWHvmxT2pIAhInIUj3w",
            "EECw-s6Jy-fyJHhkUGQhHg"
        ],
        "explanation": {
            "xD3L3JhNxsAfQikOHWHa4w": "This restaurant offers excellent food and a warm ambience, which aligns well with the user's preferences.",
            "ib_206uhcdzV7lNcCpniXA": "Known for its attentive waitstaff and great place, it provides a solid dining experience that appeals to the user.",
            "ZSpfF89JnQN6fiS8OhBlZQ": "While the food is decent, the ambience and service could be better; hence its ranking here.",
            "pKrcWHvmxT2pIAhInIUj3w": "This restaurant has good food but lacks in ambience and service quality, placing it lower in the ranking.",
            "EECw-s6Jy-fyJHhkUGQhHg": "Although popular, it was found to rank lower due to average experiences in all categories preferred by the user."
        }
    },
    "03RJcIDcNwH4WQmqjIvwIw": {
        "kw": [
            "place",
            "food",
            "singapore",
            "rice",
            "meal"
        ],
        "candidate": [
            "pKNDz1tzC5llbengNUz_7w",
            "XuxzGu2PEr59drHseZOVCg",
            "U3i7AaegudvpmDL23_wEmQ",
            "hSEGyy0-i1_ZXGIRySbgcg",
            "vZiWYH4XIiy3fqPNy615Kg"
        ],
        "explanation": {
            "pKNDz1tzC5llbengNUz_7w": "Known for its excellent rice-based dishes that capture the essence of Singaporean cuisine.",
            "XuxzGu2PEr59drHseZOVCg": "Offers a variety of meals centered around rice, making it a popular choice for a fulfilling lunch.",
            "U3i7AaegudvpmDL23_wEmQ": "Features a good selection of rice meals that reflect local flavors.",
            "hSEGyy0-i1_ZXGIRySbgcg": "Although less focused on rice, it still provides tasty options appealing to local tastes.",
            "vZiWYH4XIiy3fqPNy615Kg": "While it may have unique offerings, it does not specialize in rice dishes, making it the least suitable choice."
        }
    },
    "reui1h17m_2_7NcCS-w_Cw": {
        "kw": [
            "shop",
            "front counter",
            "items",
            "dish",
            "friends"
        ],
        "candidate": [
            "J9rMt_V1NX49rU3YUjh_7Q",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "0UVlw30JrYGl79rT0XIEmw",
            "-U4BnQL4VC3dkRDUZL0i8Q",
            "_7nMWBmfFvk9S3tKG3Ip_g."
        ],
        "explanation": {
            "J9rMt_V1NX49rU3YUjh_7Q": "This restaurant offers a vibrant front counter experience with a variety of shareable items, ideal for dining with friends.",
            "vVqxGrqt5ALxQjJGnntpKQ": "A casual spot with a good selection of dishes suitable for quick eats, maintaining a social atmosphere.",
            "0UVlw30JrYGl79rT0XIEmw": "While it has a great menu, it’s slightly less social in setup but still provides quality items.",
            "-U4BnQL4VC3dkRDUZL0i8Q": "A solid choice for quick bites, but not as conducive for a friendly dining experience compared to the top spots.",
            "_7nMWBmfFvk9S3tKG3Ip_g": "Though popular, it lacks a front counter style that fits the user's preferences for a more casual and friendly dining approach."
        }
    },
    "-0D44Oa5eolEFmaIM4MbWA": {
        "kw": [
            "bar",
            "dinner",
            "lot",
            "flavour",
            "potato"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "LFknVw6uTIaL-MY_RqkN7g",
            "VEy3-SnvsKgWfGM_b2irbA",
            "7LFdimtQU3yrgiKyE53klQ."
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "This restaurant offers a vibrant bar atmosphere with a strong dinner menu focused on flavor, specifically featuring innovative potato dishes.",
            "LFknVw6uTIaL-MY_RqkN7g": "Known for its diverse flavor profiles and a solid selection of potato items, this spot complements the bar experience well for a dinner outing.",
            "VEy3-SnvsKgWfGM_b2irbA": "A casual bar dining option with decent flavor but less focus on potatoes compared to the top choices.",
            "7LFdimtQU3yrgiKyE53klQ": "A good bar, but its dinner offerings and flavor variety are more limited, placing it last on the list."
        }
    },
    "WaxgrE1Uawl2Tqs_CbAHLQ": {
        "kw": [
            "bar",
            "side",
            "dessert",
            "people",
            "food"
        ],
        "candidate": [
            "i5dxKKLe2kJ8WbPUXilPGg",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "Rl318hUrGlkPJhMmNNZizQ",
            "U3i7AaegudvpmDL23_wEmQ",
            "2qw1-Q_sVbo9QHWDlmznsw"
        ],
        "explanation": {
            "i5dxKKLe2kJ8WbPUXilPGg": "This spot excels in providing a vibrant bar scene and offers delicious sides and desserts that enhance the dining experience.",
            "J9rMt_V1NX49rU3YUjh_7Q": "Known for its fantastic food options and a friendly atmosphere, it also serves appealing sides and desserts that align with user preferences.",
            "Rl318hUrGlkPJhMmNNZizQ": "While it has a decent bar selection, it is more focused on food, but still has enough desserts to satisfy.",
            "U3i7AaegudvpmDL23_wEmQ": "This establishment offers good food but lacks the strong bar vibe and dessert options that the user prefers.",
            "2qw1-Q_sVbo9QHWDlmznsw": "Although it is a solid choice, it falls short in terms of bar options and dessert variety compared to the others."
        }
    },
    "Lya-IFg6T-vNpNp1kRFQjw": {
        "kw": [
            "bar",
            "lot",
            "people",
            "singapore",
            "rice"
        ],
        "candidate": [
            "UPRFpMsB4I64GRjUqjRmiw",
            "NbQH02mMYJ4r1RqvG2FDBA",
            "fY1IkBnRft1KR0O2tqu7pg",
            "7LFdimtQU3yrgiKyE53klQ"
        ],
        "explanation": {
            "UPRFpMsB4I64GRjUqjRmiw": "This restaurant is a popular bar in Singapore known for its vibrant atmosphere and rice-based dishes, making it top-ranked.",
            "NbQH02mMYJ4r1RqvG2FDBA": "A good option with a casual vibe and offers rice dishes, but not as lively as the top choice.",
            "fY1IkBnRft1KR0O2tqu7pg": "This establishment has decent bar features but less focus on rice offerings compared to higher-ranked options.",
            "7LFdimtQU3yrgiKyE53klQ": "While it has some bar elements, it does not strongly align with the user's specific preference for rice dishes."
        }
    },
    "frthTngbBHgSdk4j85HmEQ": {
        "kw": [
            "bar",
            "desserts",
            "dessert",
            "service",
            "food"
        ],
        "candidate": [
            "MPzZuWpKpeLBa833zzL9IQ",
            "OExxlOVjUIDh3TFjPzbSDA",
            "kA5pZz-koXIlPaDJALDroQ",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "_HMiq7vSET4uhNScBdOJnw"
        ],
        "explanation": {
            "MPzZuWpKpeLBa833zzL9IQ": "This restaurant has a fantastic dessert menu and is known for excellent service, making it a top choice.",
            "OExxlOVjUIDh3TFjPzbSDA": "Renowned for its bar ambiance and dessert offerings, this place caters well to the user's preference for both aspects.",
            "kA5pZz-koXIlPaDJALDroQ": "Good food and decent desserts keep it in the middle rankings, but it lacks in bar service compared to the top two.",
            "vVqxGrqt5ALxQjJGnntpKQ": "While it offers solid options, it didn't stand out in desserts or bar service, placing it lower.",
            "_HMiq7vSET4uhNScBdOJnw": "This restaurant was rated the lowest due to average dessert options and service levels."
        }
    },
    "C64vnYvvV1pXLJn0MJ_IJw": {
        "kw": [
            "sandwiches",
            "lot",
            "desserts",
            "waiter",
            "service"
        ],
        "candidate": [
            "5LMkTnMXOxlce_LwUNhpCQ",
            "EJNkmXMDWurCPjOZe_WXAg",
            "7LFdimtQU3yrgiKyE53klQ",
            "XAMUaVFO2y5Vf1Uz_rYA1Q",
            "xD3L3JhNxsAfQikOHWHa4w"
        ],
        "explanation": {
            "5LMkTnMXOxlce_LwUNhpCQ": "Known for its variety of sandwiches and a robust dessert menu, along with excellent service.",
            "EJNkmXMDWurCPjOZe_WXAg": "Offers a great selection of sandwiches and is highly rated for attentive waiter service.",
            "7LFdimtQU3yrgiKyE53klQ": "Features tasty sandwiches but slightly less focus on desserts compared to top spots.",
            "XAMUaVFO2y5Vf1Uz_rYA1Q": "Good sandwiches but not as strong in the dessert category and has variable service.",
            "xD3L3JhNxsAfQikOHWHa4w": "Although decent, it ranks lower due to limited dessert options and average service."
        }
    },
    "W6w9AZKCKBo9m8iPr2hQyg": {
        "kw": [
            "sandwiches",
            "dinner",
            "dish",
            "fries",
            "desserts"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "LFknVw6uTIaL-MY_RqkN7g",
            "YzYNEpi9JU34yJRqCxb9ag",
            "_HMiq7vSET4uhNScBdOJnw",
            "lE9qVePgvolkhw6C3Cdkeg"
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Known for its gourmet sandwiches and a diverse dinner menu that resonates well with the user's preferences.",
            "LFknVw6uTIaL-MY_RqkN7g": "Offers a strong selection of sandwiches along with delicious fries and desserts, making it a solid choice for dinner.",
            "YzYNEpi9JU34yJRqCxb9ag": "While it has a great dinner menu, its sandwich options are less diverse than the top two.",
            "_HMiq7vSET4uhNScBdOJnw": "Provides sandwiches but lacks some of the sought-after dinner options and dessert variety.",
            "lE9qVePgvolkhw6C3Cdkeg": "Offers limited choices for sandwiches and dinner, making it less appealing compared to the others."
        }
    },
    "2lwizmnZ8INb-6nDpgE0Kg": {
        "kw": [
            "dinner",
            "fries",
            "medium",
            "side",
            "service"
        ],
        "candidate": [
            "NbQH02mMYJ4r1RqvG2FDBA",
            "7LFdimtQU3yrgiKyE53klQ",
            "ko4q1Oj4iWvYSxoamlcEgw",
            "T7ekp7FiffoWDq53hbZDhg",
            "ZhJ59SFPifQiTW0gAddfGw"
        ],
        "explanation": {
            "NbQH02mMYJ4r1RqvG2FDBA": "This restaurant excels in providing fries as a side and has a reputation for excellent service.",
            "7LFdimtQU3yrgiKyE53klQ": "Known for solid medium portion options and good sides complementing their dinner menu.",
            "ko4q1Oj4iWvYSxoamlcEgw": "Offers decent service and a varied menu, but slightly lower in fry options.",
            "T7ekp7FiffoWDq53hbZDhg": "While it has good dinner options, fries aren't a specialty here, affecting its ranking.",
            "ZhJ59SFPifQiTW0gAddfGw": "This restaurant has limited fry options and lower service ratings compared to others."
        }
    },
    "L_jIXFcx9ivqUAZqWnulyQ": {
        "kw": [
            "dinner",
            "service",
            "singapore",
            "location",
            "soup"
        ],
        "candidate": [
            "4Xm4LZQjoavYm0Yjs1QgsQ",
            "UfORGWnRhrWoBEJwj8ivhA",
            "HkZyV6SIVzdFpC5GRYlMkA",
            "eNuJkqMjbGRbY-T01JsTXA",
            "4l9M9C96HW6JpwrQPJGMNQ"
        ],
        "explanation": {
            "4Xm4LZQjoavYm0Yjs1QgsQ": "Known for exceptional dinner service and a variety of soups that reflect local flavors.",
            "UfORGWnRhrWoBEJwj8ivhA": "Offers a good selection of hearty soups and is well-rated for attentive service, suitable for dinner.",
            "HkZyV6SIVzdFpC5GRYlMkA": "While not specializing in soup, the dinner menu is popular and the service is commendable.",
            "eNuJkqMjbGRbY-T01JsTXA": "Features a decent dinner experience but lacks strong soup options.",
            "4l9M9C96HW6JpwrQPJGMNQ": "Primarily focuses on non-soup dishes and has variable service quality, making it less favorable for the user’s preferences."
        }
    },
    "0TKbsw2xVBBV8gk4UwTsQg": {
        "kw": [
            "dinner",
            "friends",
            "waiter",
            "restaurant",
            "staff"
        ],
        "candidate": [
            "BYwoAKKtdSeylSN7QV8oNw",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "M3L6py5NM0_WjIT7410M0Q",
            "5RFNZZvtfF9uHVSUeYwzbQ",
            "0UVlw30JrYGl79rT0XIEmw"
        ],
        "explanation": {
            "BYwoAKKtdSeylSN7QV8oNw": "This restaurant is known for its friendly waitstaff and great atmosphere, ideal for a fun dinner with friends.",
            "J9rMt_V1NX49rU3YUjh_7Q": "Offers excellent service and a vibrant setting that enhances the dining experience with friends.",
            "M3L6py5NM0_WjIT7410M0Q": "While it provides good service, the atmosphere is slightly more relaxed, making it suitable for casual dinners.",
            "5RFNZZvtfF9uHVSUeYwzbQ": "Known for its quality food but the service can be hit or miss, placing it lower on the list.",
            "0UVlw30JrYGl79rT0XIEmw": "Offers a decent experience but lacks the vibrancy and attentiveness needed for a lively dinner out."
        }
    },
    "cwZ64E_XT92XesWkQh85YQ": {
        "kw": [
            "dinner",
            "lunch time",
            "lot",
            "items",
            "steak"
        ],
        "candidate": [
            "7LFdimtQU3yrgiKyE53klQ",
            "Yrf16fjGs2rUir4slN9i2g",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "lycfBKtcR7keDQQOeMMsoA",
            "cEX4Cw8q2ftBrbpCvInf0w"
        ],
        "explanation": {
            "7LFdimtQU3yrgiKyE53klQ": "Offers an extensive menu with a strong emphasis on steak and variety, perfect for both lunch and dinner.",
            "Yrf16fjGs2rUir4slN9i2g": "Known for its quality steak dishes and diverse options that appeal to lunch and dinner crowds alike.",
            "vVqxGrqt5ALxQjJGnntpKQ": "Provides solid meal options including steak, while also catering to a variety of other preferences.",
            "lycfBKtcR7keDQQOeMMsoA": "Offers decent steak but has a more limited variety compared to the top-ranked options.",
            "cEX4Cw8q2ftBrbpCvInf0w": "Although it has some good items, it ranks lower due to fewer steak-focused choices and variety."
        }
    },
    "BIkivGwMblK3_r2N0pSE8A": {
        "kw": [
            "dinner",
            "group",
            "friends",
            "dessert",
            "service"
        ],
        "candidate": [
            "uQu5DtnXZZ8XVfBKldKnag",
            "I1wArJIYbFl2txUL6unC6A",
            "x44o1_Dw4QsQZRtBJgwZaA",
            "0W5UWAcjwGuCJOv8rXGMqw",
            "lE9qVePgvolkhw6C3Cdkeg"
        ],
        "explanation": {
            "uQu5DtnXZZ8XVfBKldKnag": "This restaurant is known for excellent dessert options and attentive service, making it ideal for a fun dinner with friends.",
            "I1wArJIYbFl2txUL6unC6A": "This place has a great atmosphere for groups and serves tasty desserts, enhancing the dining experience.",
            "x44o1_Dw4QsQZRtBJgwZaA": "While it offers decent food, its dessert menu and service are not as strong as the top two.",
            "0W5UWAcjwGuCJOv8rXGMqw": "Good food but limited dessert selection, which detracts from the overall dining experience for friends.",
            "lE9qVePgvolkhw6C3Cdkeg": "Although it provides satisfactory service, it lacks a compelling dessert menu and isn't ideal for larger groups."
        }
    },
    "x7ykv2z_d0aIawhvEraRuQ": {
        "kw": [
            "dinner",
            "friends",
            "food",
            "singapore",
            "restaurant"
        ],
        "candidate": [
            "2JFWJDNeLZN3dbTXs8kNMQ",
            "DHtvncPCxHKnuMgobG4inw",
            "LdpItBAPRrIVIkIP4PZb1A",
            "pvgfvEwMJmtWkKBjEkGonQ"
        ],
        "explanation": {
            "2JFWJDNeLZN3dbTXs8kNMQ": "Best suited for group dining with a lively atmosphere and diverse menu options.",
            "DHtvncPCxHKnuMgobG4inw": "Offers a great dining experience for casual gatherings with friends and a well-rated food selection.",
            "LdpItBAPRrIVIkIP4PZb1A": "While still a good option, it’s less focused on a social dining environment compared to the top two.",
            "pvgfvEwMJmtWkKBjEkGonQ": "The ambiance and menu may not appeal as much to a group dining experience as the others do."
        }
    },
    "e6Q9Km6Ve4B9lSRkL75M3w": {
        "kw": [
            "dinner",
            "group",
            "batter",
            "fries",
            "side"
        ],
        "candidate": [
            "YzYNEpi9JU34yJRqCxb9ag",
            "sxQdEEfKRviWRymOoH9UiA",
            "BYwoAKKtdSeylSN7QV8oNw",
            "ymAw53bQVppVV7T40fNgRw"
        ],
        "explanation": {
            "YzYNEpi9JU34yJRqCxb9ag": "This restaurant is known for its excellent batter options and variety of sides, making it perfect for group dinners.",
            "sxQdEEfKRviWRymOoH9UiA": "Offers a decent selection of fries and sides that are well-suited for sharing among a group.",
            "BYwoAKKtdSeylSN7QV8oNw": "While it has some good options, it lacks the variety in batter and size that the top choices provide.",
            "ymAw53bQVppVV7T40fNgRw": "This restaurant is rated lowest as it does not specialize in the user’s preferred items for a group dinner."
        }
    },
    "EcBIMqc1zZTY_X0Y0Kq1sg": {
        "kw": [
            "dinner",
            "friends",
            "service",
            "food",
            "singapore"
        ],
        "candidate": [
            "U3i7AaegudvpmDL23_wEmQ",
            "97DdiERj19Fuk5CRpHl0Hg",
            "aFiCaAyKxBB6PI3hyV3cRQ",
            "LFknVw6uTIaL-MY_RqkN7g",
            "J9rMt_V1NX49rU3YUjh_7Q"
        ],
        "explanation": {
            "U3i7AaegudvpmDL23_wEmQ": "Known for a vibrant atmosphere and exceptional service, perfect for a night out with friends.",
            "97DdiERj19Fuk5CRpHl0Hg": "Offers a great balance of delicious food and attentive service, making it ideal for group dinners.",
            "aFiCaAyKxBB6PI3hyV3cRQ": "Good food and a lively environment, suitable for social gatherings but slightly less focused on service.",
            "LFknVw6uTIaL-MY_RqkN7g": "While the food is decent, the service has room for improvement, making it less favorable for dining with friends.",
            "J9rMt_V1NX49rU3YUjh_7Q": "Though it has some good options, it lacks the social atmosphere and service quality preferred for a group dinner."
        }
    },
    "rjLuqTeEFE3TQo9IHyCr3Q": {
        "kw": [
            "dinner",
            "fries",
            "food",
            "price",
            "quality"
        ],
        "candidate": [
            "ko4q1Oj4iWvYSxoamlcEgw",
            "7LFdimtQU3yrgiKyE53klQ",
            "LFknVw6uTIaL-MY_RqkN7g",
            "BeZMzvfxRWy-oqA_bX8xog",
            "ib_206uhcdzV7lNcCpniXA"
        ],
        "explanation": {
            "ko4q1Oj4iWvYSxoamlcEgw": "This spot offers delicious dinner options and a variety of fries, catering perfectly to user preferences for quality and flavor.",
            "7LFdimtQU3yrgiKyE53klQ": "Known for its great food quality and reasonable prices, this restaurant provides a solid dining experience with fries that users love.",
            "LFknVw6uTIaL-MY_RqkN7g": "A reliable choice for dinner, though slightly less focused on fries compared to the top spots, still maintains good quality.",
            "BeZMzvfxRWy-oqA_bX8xog": "Offers decent food at a fair price but lacks some of the quality that the top-ranked places deliver, especially in terms of fries.",
            "ib_206uhcdzV7lNcCpniXA": "While it may have unique offerings, it falls short in quality and dinner options relative to others, making it the least favorable in the new ranking."
        }
    },
    "aEUGzkqPWS3SjghraZ5nMw": {
        "kw": [
            "dinner",
            "batter",
            "dish",
            "friends",
            "service"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "ymAw53bQVppVV7T40fNgRw",
            "sxQdEEfKRviWRymOoH9UiA",
            "Zztv1vtQ2AjOSUc_12-2pQ"
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "This restaurant is known for its excellent batter dishes that are great for sharing, making it ideal for a friendly dinner.",
            "ymAw53bQVppVV7T40fNgRw": "Offers a good variety of options and has received positive feedback on service and atmosphere for group dining.",
            "sxQdEEfKRviWRymOoH9UiA": "While still a solid choice, it focuses less on batter dishes and may not cater as well to the user’s preference for sharing with friends.",
            "Zztv1vtQ2AjOSUc_12-2pQ": "Ranked lower as it does not align as closely with dinner settings or the emphasis on batter dishes."
        }
    },
    "NvbhMp84EtWVFIwVuOs2_w": {
        "kw": [
            "lunch time",
            "singapore",
            "one",
            "quality",
            "japan"
        ],
        "candidate": [
            "XuxzGu2PEr59drHseZOVCg",
            "fY1IkBnRft1KR0O2tqu7pg",
            "wyDfBs1tYSIiBO7HCPKNTg",
            "mlnucLO7hYxKoH77FEHh2g",
            "bjL1PC2e9dvjBVewmoXYwQ"
        ],
        "explanation": {
            "XuxzGu2PEr59drHseZOVCg": "Known for its authentic and high-quality Japanese dishes, making it the best fit for the user's preferences.",
            "fY1IkBnRft1KR0O2tqu7pg": "Offers good quality Japanese cuisine suitable for a quick and satisfying lunch.",
            "wyDfBs1tYSIiBO7HCPKNTg": "While not solely Japanese, it features Japanese options that maintain quality.",
            "mlnucLO7hYxKoH77FEHh2g": "Past rankings suggest decent quality, but it may not specialize in Japanese food as well.",
            "bjL1PC2e9dvjBVewmoXYwQ": "Lowest quality and relevance to Japanese dining, hence placed at the end of the ranking."
        }
    },
    "mvIPL_QTv5Y63pJl60zjCA": {
        "kw": [
            "lunch time",
            "friends",
            "service",
            "food",
            "singapore"
        ],
        "candidate": [
            "vZiWYH4XIiy3fqPNy615Kg",
            "hSEGyy0-i1_ZXGIRySbgcg",
            "dFYfZsc-SUwRpDEgJiIoXA",
            "NAsglQPCdPMJV_RkHge27A",
            "fY1IkBnRft1KR0O2tqu7pg"
        ],
        "explanation": {
            "vZiWYH4XIiy3fqPNy615Kg": "Known for its vibrant atmosphere and exceptional service, making it perfect for a fun lunch with friends.",
            "hSEGyy0-i1_ZXGIRySbgcg": "Offers a diverse menu and typically high-quality food, which aligns with the group's dining preferences.",
            "dFYfZsc-SUwRpDEgJiIoXA": "A solid choice for lunch that balances atmosphere and good food, appealing to casual dining with friends.",
            "NAsglQPCdPMJV_RkHge27A": "While good, it ranks lower due to slightly less emphasis on group-friendly dining.",
            "fY1IkBnRft1KR0O2tqu7pg": "Although it has a good reputation, it may not provide the same level of service or group dining experience compared to the other options."
        }
    },
    "tAr3zFVXoM1K2PrbyCdcTA": {
        "kw": [
            "lot",
            "dish",
            "hours",
            "friends",
            "fries"
        ],
        "candidate": [
            "j_aIYB4uGOR45jAXivFNZQ",
            "tDGDMePyQvBBn416-1SEMA",
            "LFknVw6uTIaL-MY_RqkN7g",
            "NbQH02mMYJ4r1RqvG2FDBA"
        ],
        "explanation": {
            "j_aIYB4uGOR45jAXivFNZQ": "This restaurant has a diverse menu, good portion sizes, and operates late, making it great for friends looking for a filling meal.",
            "tDGDMePyQvBBn416-1SEMA": "Known for its delicious fries and social atmosphere, it’s a solid choice for a casual hanging out with friends.",
            "LFknVw6uTIaL-MY_RqkN7g": "While it has a good menu, the hours may not be as accommodating for late-night dining, so it’s placed lower.",
            "NbQH02mMYJ4r1RqvG2FDBA": "This restaurant is still good, but it lacks the variety in dishes and the late-night options that the others provide."
        }
    },
    "hR9d6ds2TVNpqDOXICXHJA": {
        "kw": [
            "lot",
            "group",
            "friends",
            "fries",
            "people"
        ],
        "candidate": [
            "JHi4LCxdbpXthg98sQiicQ",
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "_HMiq7vSET4uhNScBdOJnw",
            "MuaIn9h_YOAmZxHxtQXAAw",
            "xAJfM-dMPOHFH35Adgi10w"
        ],
        "explanation": {
            "JHi4LCxdbpXthg98sQiicQ": "Best for group dining with a lively atmosphere and great shareable fries options.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Offers a spacious setting suitable for friends gathering, along with a popular fries selection.",
            "_HMiq7vSET4uhNScBdOJnw": "Provides a casual vibe ideal for larger parties, plus tasty fries as a staple menu item.",
            "MuaIn9h_YOAmZxHxtQXAAw": "Good for group dining, with decent fries, but not as spacious as the top picks.",
            "xAJfM-dMPOHFH35Adgi10w": "While it has good food options, it's less suited for large gatherings, making it last on this list."
        }
    },
    "SMesVaPTVNRJz-Ztj6jYHA": {
        "kw": [
            "items",
            "dish",
            "service",
            "food",
            "singapore"
        ],
        "candidate": [
            "5p2AWrPlYJM5hh54HcyA3g",
            "5RFNZZvtfF9uHVSUeYwzbQ",
            "0UVlw30JrYGl79rT0XIEmw",
            "at7wfECnjgIJi5o7gL8fyQ",
            "3vr42-TF3V31LrN5sAFbDQ."
        ],
        "explanation": {
            "5p2AWrPlYJM5hh54HcyA3g": "This restaurant ranks highest due to its exceptional dish quality and renowned service that aligns perfectly with Singapore's culinary standards.",
            "5RFNZZvtfF9uHVSUeYwzbQ": "Placed second, it offers a diverse menu and consistently good food, making it a favorite among locals.",
            "0UVlw30JrYGl79rT0XIEmw": "This restaurant is known for its unique dishes that capture Singaporean flavors well, hence it's positioned third.",
            "at7wfECnjgIJi5o7gL8fyQ": "Ranked fourth, it provides decent service and food, but may lack the variety found in higher-ranked options.",
            "3vr42-TF3V31LrN5sAFbDQ": "Although it has good reviews, it falls to last place due to less attention to detail in service and dish execution, compared to the others."
        }
    },
    "m2qgPrlJ4lYkgSlju65PIA": {
        "kw": [
            "items",
            "singapore",
            "rice",
            "fish",
            "pot"
        ],
        "candidate": [
            "UGidvGF4aXsl7aVvPLmO4Q",
            "TzKx4KbFOzLX0v7F31cSpw",
            "j02fdPWz9L-et3yjzHnhuw",
            "J9rMt_V1NX49rU3YUjh_7Q"
        ],
        "explanation": {
            "UGidvGF4aXsl7aVvPLmO4Q": "This restaurant is known for its excellent rice-based dishes and fresh fish options.",
            "TzKx4KbFOzLX0v7F31cSpw": "Offers a good variety of pot dishes featuring both rice and fish, making it a strong contender.",
            "j02fdPWz9L-et3yjzHnhuw": "While it does have fish dishes, its rice options are less expansive compared to the higher-ranked restaurants.",
            "J9rMt_V1NX49rU3YUjh_7Q": "This restaurant has fewer offerings that directly meet the user’s preferences for rice and fish."
        }
    },
    "ZzUCh_n7uzibDY6wEFZ8KA": {
        "kw": [
            "squid",
            "dish",
            "dessert",
            "food",
            "curry"
        ],
        "candidate": [
            "BfGgttAzEPx9v7b8Sgkedw",
            "yUEReMN5fFo8qO2ZSMI3OQ",
            "gzBoOo4E1ornEHYod52uew",
            "n5vQCdHfl2Dm7r4l5FW8Cw"
        ],
        "explanation": {
            "BfGgttAzEPx9v7b8Sgkedw": "This restaurant is known for its squid dishes and has excellent curry options that the user enjoys.",
            "yUEReMN5fFo8qO2ZSMI3OQ": "Offers a variety of food including good desserts and some squid dishes, making it a solid choice.",
            "gzBoOo4E1ornEHYod52uew": "While it has decent food options, it lacks strong squid and dessert offerings compared to the top choices.",
            "n5vQCdHfl2Dm7r4l5FW8Cw": "This restaurant did not prominently feature squid or curry, pushing it further down the ranking."
        }
    },
    "HM2U0MlWrnDa9XIEPxa66g": {
        "kw": [
            "dish",
            "sweetness",
            "comment",
            "steak",
            "meat"
        ],
        "candidate": [
            "ko4q1Oj4iWvYSxoamlcEgw",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "6LgTc7CZlXCd1Pxq3BiVcw",
            "7LFdimtQU3yrgiKyE53klQ",
            "Zz8xPKC4RDGJCB49R_w9hQ"
        ],
        "explanation": {
            "ko4q1Oj4iWvYSxoamlcEgw": "This restaurant is renowned for its flavorful steak dishes that appeal to the meat preference.",
            "vVqxGrqt5ALxQjJGnntpKQ": "Known for a perfect balance of flavors, this spot emphasizes quality meats with a hint of sweetness in some sauces.",
            "6LgTc7CZlXCd1Pxq3BiVcw": "Offers a range of meat options but lacks the standout qualities present in the top choices.",
            "7LFdimtQU3yrgiKyE53klQ": "While it has good meat dishes, it doesn't excel in the sweetness aspect as much as the others above.",
            "Zz8xPKC4RDGJCB49R_w9hQ": "Although not lacking in quality, it focuses less on steak and more on other types of dishes, making it the least preferred."
        }
    },
    "WtZyXabdl1bP1XJ7vQRG-A": {
        "kw": [
            "dish",
            "people",
            "singapore",
            "rice",
            "fish"
        ],
        "candidate": [
            "U3i7AaegudvpmDL23_wEmQ",
            "rz8khUD2Amv1lBoIiwpEWw",
            "NbQH02mMYJ4r1RqvG2FDBA",
            "hSEGyy0-i1_ZXGIRySbgcg",
            "0UVlw30JrYGl79rT0XIEmw."
        ],
        "explanation": {
            "U3i7AaegudvpmDL23_wEmQ": "Known for its exceptional rice and fish specialties, making it ideal for the user's preferences.",
            "rz8khUD2Amv1lBoIiwpEWw": "Offers a variety of dishes with high-quality fish, perfect for a group dining experience.",
            "NbQH02mMYJ4r1RqvG2FDBA": "Features rice dishes that include fish options, appealing to the user's taste.",
            "hSEGyy0-i1_ZXGIRySbgcg": "Although not focused mainly on fish, it provides some rice dishes that might still interest the user.",
            "0UVlw30JrYGl79rT0XIEmw": "While a solid choice, it ranks lower due to less variety in preferred dishes compared to others."
        }
    },
    "IZXO5FHilspTMpsXm6sfpQ": {
        "kw": [
            "dish",
            "friends",
            "side",
            "desserts",
            "service"
        ],
        "candidate": [
            "ZSpfF89JnQN6fiS8OhBlZQ",
            "hSEGyy0-i1_ZXGIRySbgcg",
            "7LFdimtQU3yrgiKyE53klQ",
            "sxQdEEfKRviWRymOoH9UiA",
            "dFYfZsc-SUwRpDEgJiIoXA."
        ],
        "explanation": {
            "ZSpfF89JnQN6fiS8OhBlZQ": "Known for its excellent dishes and great service, making it ideal for dining with friends.",
            "hSEGyy0-i1_ZXGIRySbgcg": "Offers a variety of sides and desserts, enhancing the shared dining experience.",
            "7LFdimtQU3yrgiKyE53klQ": "Good selection of dishes but slightly less focus on dessert options compared to the top choices.",
            "sxQdEEfKRviWRymOoH9UiA": "Has decent service and a variety of dishes but lacks standout desserts.",
            "dFYfZsc-SUwRpDEgJiIoXA": "While it has nice sides, it ranks lower overall due to less favorable service and dessert options."
        }
    },
    "A-lAfDshBVUUPzftplUn0A": {
        "kw": [
            "dish",
            "friends",
            "food",
            "ambience",
            "fish"
        ],
        "candidate": [
            "AQEEH7JP1DFrvFuMi6TP2Q",
            "pKrcWHvmxT2pIAhInIUj3w",
            "ib_206uhcdzV7lNcCpniXA",
            "2FLfIQ9u3PJKg2iLhkl91A",
            "dFYfZsc-SUwRpDEgJiIoXA"
        ],
        "explanation": {
            "AQEEH7JP1DFrvFuMi6TP2Q": "Offers a wide selection of fish dishes and has a vibrant ambience perfect for dining with friends.",
            "pKrcWHvmxT2pIAhInIUj3w": "Known for its fresh seafood options and a casual atmosphere that encourages socializing.",
            "ib_206uhcdzV7lNcCpniXA": "Has diverse menu alternatives including fish, making it a solid choice for friends who enjoy variety.",
            "2FLfIQ9u3PJKg2iLhkl91A": "While not as focused on fish, it provides a good overall dining experience with friends and a pleasant vibe.",
            "dFYfZsc-SUwRpDEgJiIoXA": "Ranks lowest as it may not meet the user's specific interest in fish and has a less inviting atmosphere for friend gatherings."
        }
    },
    "T-LRWeaTW3Ib3wtzO3_gvg": {
        "kw": [
            "dish",
            "side",
            "ingredients",
            "broth",
            "singapore"
        ],
        "candidate": [
            "YL9NENDJeMAqxT8sI3_PZg",
            "x0Pk5Uvy0y63FSzcfmxRpQ",
            "71aipxvzUEEAd245w61o7A",
            "k9w2tAgGlD-lwQue7KP5qA",
            "XuxzGu2PEr59drHseZOVCg"
        ],
        "explanation": {
            "YL9NENDJeMAqxT8sI3_PZg": "Offers authentic Singaporean dishes with a variety of sides and a rich broth that align with the user's preferences.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "Features popular Singaporean ingredients and dishes known for their bold flavors, making it a strong contender.",
            "71aipxvzUEEAd245w61o7A": "Known for its delicious side dishes that complement the main offerings, reflecting local culinary influences.",
            "k9w2tAgGlD-lwQue7KP5qA": "Has some elements of Singaporean cuisine but doesn't offer as many authentic dishes or rich broth options as higher-ranked places.",
            "XuxzGu2PEr59drHseZOVCg": "Although it provides a variety of dishes, it lacks authenticity and depth in both the broth and ingredients compared to the top-ranked options."
        }
    },
    "6KnuE2ft-M2vWig6EpXndQ": {
        "kw": [
            "dish",
            "service",
            "food",
            "birthday",
            "ambience"
        ],
        "candidate": [
            "l5lEOq47ne-jWKl67VKwZA",
            "AQEEH7JP1DFrvFuMi6TP2Q",
            "rz8khUD2Amv1lBoIiwpEWw",
            "j02fdPWz9L-et3yjzHnhuw"
        ],
        "explanation": {
            "l5lEOq47ne-jWKl67VKwZA": "This restaurant excels in all the preferred categories, providing an outstanding experience for birthdays with a great ambiance.",
            "AQEEH7JP1DFrvFuMi6TP2Q": "Good food quality and service, making it a solid choice for celebrations.",
            "rz8khUD2Amv1lBoIiwpEWw": "Offers decent dishes and service, but lacks the special touch for memorable celebrations.",
            "j02fdPWz9L-et3yjzHnhuw": "While it has its merits, it doesn't quite meet the preferences as strongly as the others in terms of ambience and service for a birthday setting."
        }
    },
    "Zp_Vg_UVA9Mcd2WSTXC9hg": {
        "kw": [
            "dish",
            "friends",
            "birthday",
            "restaurant",
            "drinks"
        ],
        "candidate": [
            "OExxlOVjUIDh3TFjPzbSDA",
            "LFknVw6uTIaL-MY_RqkN7g",
            "jLcBOqa-UT6qugFgZqjNvA",
            "pJWufKPuAuRFUyky_LeUMg",
            "xD3L3JhNxsAfQikOHWHa4w"
        ],
        "explanation": {
            "OExxlOVjUIDh3TFjPzbSDA": "This restaurant offers a vibrant atmosphere ideal for birthday celebrations, with a great selection of drinks to share with friends.",
            "LFknVw6uTIaL-MY_RqkN7g": "Known for its good food and friendly service, this place caters well to groups looking to celebrate special occasions like birthdays.",
            "jLcBOqa-UT6qugFgZqjNvA": "While it has a solid dining experience, its less festive environment makes it less suitable for a celebratory gathering.",
            "pJWufKPuAuRFUyky_LeUMg": "This restaurant is decent but may not have the lively ambiance sought after for a birthday celebration compared to others.",
            "xD3L3JhNxsAfQikOHWHa4w": "Although it has good food, it lacks the necessary atmosphere and drink selections for a fun birthday outing."
        }
    },
    "Pbd9NIYgxMXbf2I6Grsf7g": {
        "kw": [
            "dish",
            "location",
            "rice",
            "taste",
            "fried rice"
        ],
        "candidate": [
            "7LFdimtQU3yrgiKyE53klQ",
            "bjL1PC2e9dvjBVewmoXYwQ",
            "MfaSpGas4-qV_v5hfIQ09g",
            "NbQH02mMYJ4r1RqvG2FDBA",
            "1nw-_Bm8sivTBZ7Z-uiVCA"
        ],
        "explanation": {
            "7LFdimtQU3yrgiKyE53klQ": "Known for its excellent fried rice options and strong flavors.",
            "bjL1PC2e9dvjBVewmoXYwQ": "Offers a variety of rice dishes with a focus on local tastes that appeal to the user.",
            "MfaSpGas4-qV_v5hfIQ09g": "Provides good rice options, though not as focused on fried rice as the top two.",
            "NbQH02mMYJ4r1RqvG2FDBA": "General offerings are decent but lack a distinct specialty in fried rice.",
            "1nw-_Bm8sivTBZ7Z-uiVCA": "Offers diverse dishes but does not specialize in rice or fried rice, making it the least favorable for the user's preferences."
        }
    },
    "d3o5QmzTZm-FmJlt_QsK5w": {
        "kw": [
            "pulled pork",
            "service",
            "food",
            "drinks",
            "one"
        ],
        "candidate": [
            "NbQH02mMYJ4r1RqvG2FDBA",
            "J3ijSN86u_Pg42BZjkDM_g",
            "ib_206uhcdzV7lNcCpniXA",
            "hSEGyy0-i1_ZXGIRySbgcg",
            "0W5UWAcjwGuCJOv8rXGMqw."
        ],
        "explanation": {
            "NbQH02mMYJ4r1RqvG2FDBA": "Known for its exceptional pulled pork and outstanding customer service, making it a top choice for the user.",
            "J3ijSN86u_Pg42BZjkDM_g": "Offers a great pulled pork dish and a solid drink menu, along with good service.",
            "ib_206uhcdzV7lNcCpniXA": "A well-rounded option with decent pulled pork, but less emphasis on drinks compared to the top two.",
            "hSEGyy0-i1_ZXGIRySbgcg": "Average pulled pork and service, which places it lower in the ranking.",
            "0W5UWAcjwGuCJOv8rXGMqw": "Lacks a focus on preferred dishes and overall experience, hence the lowest rank."
        }
    },
    "5lEhYKYMEuTAH6CZGUcpaQ": {
        "kw": [
            "hours",
            "medium",
            "meat",
            "service",
            "food"
        ],
        "candidate": [
            "NbQH02mMYJ4r1RqvG2FDBA",
            "O79uzVop5yqobf3bdjZzQg",
            "tDGDMePyQvBBn416-1SEMA",
            "txwpCDw5Utu9WbM0VtYJqg",
            "Yp3CLIf55i9sY7tVAO6a3Q"
        ],
        "explanation": {
            "NbQH02mMYJ4r1RqvG2FDBA": "This restaurant offers extensive hours, a variety of medium meat options, and consistently high service ratings.",
            "O79uzVop5yqobf3bdjZzQg": "Well-rated for food quality and service, particularly for their meat dishes, but less flexible on hours.",
            "tDGDMePyQvBBn416-1SEMA": "Good selection of medium meat options and decent service but with slightly limited hours.",
            "txwpCDw5Utu9WbM0VtYJqg": "Offers decent food and service, but does not excel in any preference area compared to those ranked higher.",
            "Yp3CLIf55i9sY7tVAO6a3Q": "Although it has some great reviews, it lacks variety in medium meat and has limited hours, making it less preferable."
        }
    },
    "m2qesI3CkiGm7XEs740lkg": {
        "kw": [
            "hours",
            "friends",
            "fries",
            "people",
            "food"
        ],
        "candidate": [
            "meUD8jqkG4uy0ERdqcZI6g",
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "Rl318hUrGlkPJhMmNNZizQ",
            "vVqxGrqt5ALxQjJGnntpKQ"
        ],
        "explanation": {
            "meUD8jqkG4uy0ERdqcZI6g": "Offers great food, a vibrant atmosphere perfect for groups, and tasty fries.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Good hours and a solid menu with fries, making it suitable for diners who enjoy late-night outings with friends.",
            "Rl318hUrGlkPJhMmNNZizQ": "Decent food but less suitable for larger groups compared to the top two.",
            "vVqxGrqt5ALxQjJGnntpKQ": "While it has good food, it lacks the social atmosphere preferred for dining with friends."
        }
    },
    "89GyeB4ryMRzpzKslR3onA": {
        "kw": [
            "lotus root",
            "friends",
            "waiter",
            "service",
            "food"
        ],
        "candidate": [
            "QxT3goSTkSGWqq4ecId_AQ",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "I1wArJIYbFl2txUL6unC6A",
            "ib_206uhcdzV7lNcCpniXA",
            "Zztv1vtQ2AjOSUc_12-2pQ"
        ],
        "explanation": {
            "QxT3goSTkSGWqq4ecId_AQ": "Known for its exceptional service and a variety of dishes that include lotus root, ideal for a friendly gathering.",
            "J9rMt_V1NX49rU3YUjh_7Q": "Offers a welcoming atmosphere and good service, with options that cater to lotus root lovers.",
            "I1wArJIYbFl2txUL6unC6A": "Provides decent service and some dishes with lotus root, but slightly less focus on it compared to the top two.",
            "ib_206uhcdzV7lNcCpniXA": "Offers a variety of food but falls short on service quality, making it less appealing for a group dining experience.",
            "Zztv1vtQ2AjOSUc_12-2pQ": "Has limited options for lotus root and service tends to be inconsistent, putting it at the bottom."
        }
    },
    "7XTmpN6INyLuuWAP6FF9sQ": {
        "kw": [
            "fries",
            "try",
            "ingredients",
            "service",
            "food"
        ],
        "candidate": [
            "NbQH02mMYJ4r1RqvG2FDBA",
            "LFknVw6uTIaL-MY_RqkN7g",
            "_7nMWBmfFvk9S3tKG3Ip_g",
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "at7wfECnjgIJi5o7gL8fyQ."
        ],
        "explanation": {
            "NbQH02mMYJ4r1RqvG2FDBA": "This restaurant is renowned for its delectable fries and focus on quality ingredients, perfectly matching user preferences.",
            "LFknVw6uTIaL-MY_RqkN7g": "Offers great service and some popular dishes that include fries, making it a solid choice for the user.",
            "_7nMWBmfFvk9S3tKG3Ip_g": "While it has good food, it’s slightly less focused on fries compared to the top contenders.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Known for decent ingredients, but the fries are not a highlight and service can be inconsistent.",
            "at7wfECnjgIJi5o7gL8fyQ": "Offers a variety of dishes but doesn’t excel in any area relating to the user’s preferences."
        }
    },
    "RgHz5ipSdr2YvUN7JbXLSg": {
        "kw": [
            "nett",
            "service",
            "food",
            "price",
            "things"
        ],
        "candidate": [
            "Eo6RtLvIXcgSge6Z4Z6fFQ",
            "9gkO3xa7P3U4aLdg3hws6g",
            "NAsglQPCdPMJV_RkHge27A",
            "EECw-s6Jy-fyJHhkUGQhHg",
            "Xtr2M_mh9_jOkmpNd_CSCA"
        ],
        "explanation": {
            "Eo6RtLvIXcgSge6Z4Z6fFQ": "This restaurant excels in both food quality and service, making it the top choice for satisfying the user's preferences.",
            "9gkO3xa7P3U4aLdg3hws6g": "Offers a good balance of value for price and quality of food, appealing well to the user's criteria.",
            "NAsglQPCdPMJV_RkHge27A": "While decent in service, it doesn't consistently match up to the food quality of higher-ranked options.",
            "EECw-s6Jy-fyJHhkUGQhHg": "Known for good food, but the service has been rated lower than desired.",
            "Xtr2M_mh9_jOkmpNd_CSCA": "Struggles with both service and overall food experience, making it the least favorable option based on user preferences."
        }
    },
    "h5-5MnItAJx6x35kXkq54g": {
        "kw": [
            "medium",
            "food",
            "meal",
            "money",
            "pizza"
        ],
        "candidate": [
            "Zztv1vtQ2AjOSUc_12-2pQ",
            "ZhJ59SFPifQiTW0gAddfGw",
            "lgfG_hQos2l6TSku7ThJIA",
            "Rwzp59f3Ia-v2V8Ku0zZWQ"
        ],
        "explanation": {
            "Zztv1vtQ2AjOSUc_12-2pQ": "This restaurant is known for its affordable and delicious medium-sized pizzas, making it a great fit for the user.",
            "ZhJ59SFPifQiTW0gAddfGw": "This option offers a variety of medium pizzas at reasonable prices, appealing to the user's preferences.",
            "lgfG_hQos2l6TSku7ThJIA": "While it has good pizza, it is slightly higher in price which might not be ideal based on the budget aspect.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Though this restaurant offers pizza, it did not match as closely with the user's preferences for medium pricing and meal focus."
        }
    },
    "7HTWYD8pEjHcYTvK9yoVwQ": {
        "kw": [
            "ingredients",
            "desserts",
            "dessert",
            "people",
            "service"
        ],
        "candidate": [
            "AQEEH7JP1DFrvFuMi6TP2Q",
            "LFknVw6uTIaL-MY_RqkN7g",
            "hSEGyy0-i1_ZXGIRySbgcg",
            "jLcBOqa-UT6qugFgZqjNvA",
            "I1wArJIYbFl2txUL6unC6A"
        ],
        "explanation": {
            "AQEEH7JP1DFrvFuMi6TP2Q": "Known for outstanding ingredients and a dessert menu that consistently impresses customers.",
            "LFknVw6uTIaL-MY_RqkN7g": "Offers high-quality dishes with a focus on fresh, local ingredients alongside delicious desserts.",
            "hSEGyy0-i1_ZXGIRySbgcg": "Good service and a decent dessert selection, making it a solid choice but not the top.",
            "jLcBOqa-UT6qugFgZqjNvA": "Has average dessert options and ingredient quality, placing it lower in the ranking.",
            "I1wArJIYbFl2txUL6unC6A": "Lacks the appeal in both ingredients and dessert compared to the others, resulting in the lowest ranking."
        }
    },
    "8zXgNCkusOHMwh5Tj_8yCQ": {
        "kw": [
            "meat",
            "food",
            "broth",
            "first visit",
            "rice"
        ],
        "candidate": [
            "ALNmvpU7JN_tOCD653vVWA",
            "4l9M9C96HW6JpwrQPJGMNQ",
            "1AEbuCjMRS18fhpXAQozTQ",
            "CdAmgWWCabZQoYNNWOKcEw",
            "71aipxvzUEEAd245w61o7A."
        ],
        "explanation": {
            "ALNmvpU7JN_tOCD653vVWA": "Renowned for its meat-based dishes and flavorful broth, making it an excellent first choice.",
            "4l9M9C96HW6JpwrQPJGMNQ": "Offers a rich selection of rice dishes paired with meaty broths, appealing to the user's preferences.",
            "1AEbuCjMRS18fhpXAQozTQ": "Features a variety of meat options, though it lacks the depth in broth compared to others.",
            "CdAmgWWCabZQoYNNWOKcEw": "While it has solid meat choices, it focuses less on broth and rice dishes.",
            "71aipxvzUEEAd245w61o7A": "Offers a more limited selection that does not align as closely with the user’s specified interests."
        }
    },
    "YhkMLyEsQd2-nG4BLkUs6w": {
        "kw": [
            "meat",
            "one",
            "sauce",
            "must",
            "breakfast"
        ],
        "candidate": [
            "EJNkmXMDWurCPjOZe_WXAg",
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "BYwoAKKtdSeylSN7QV8oNw",
            "NbQH02mMYJ4r1RqvG2FDBA",
            "_HMiq7vSET4uhNScBdOJnw"
        ],
        "explanation": {
            "EJNkmXMDWurCPjOZe_WXAg": "Offers a variety of meat-laden breakfast options with rich sauces, aligning perfectly with user preferences.",
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Known for its hearty breakfast plates that include sauces and meats, making it a solid choice.",
            "BYwoAKKtdSeylSN7QV8oNw": "Features substantial meat-based breakfast dishes, although slightly less variety in sauces than desired.",
            "NbQH02mMYJ4r1RqvG2FDBA": "Has some breakfast items with meat, but lacks strong sauce options compared to others.",
            "_HMiq7vSET4uhNScBdOJnw": "Primarily offers lighter breakfast choices that do not emphasize meat or sauce as highly as the others."
        }
    },
    "EWPk6-PeaOt2k6GcJ0JKjg": {
        "kw": [
            "meat",
            "singapore",
            "great place",
            "restaurant",
            "favourites"
        ],
        "candidate": [
            "ko4q1Oj4iWvYSxoamlcEgw",
            "txwpCDw5Utu9WbM0VtYJqg",
            "CdAmgWWCabZQoYNNWOKcEw",
            "dFYfZsc-SUwRpDEgJiIoXA"
        ],
        "explanation": {
            "ko4q1Oj4iWvYSxoamlcEgw": "This restaurant specializes in meat dishes that are popular in Singapore, making it a strong favorite for the user.",
            "txwpCDw5Utu9WbM0VtYJqg": "Known for its great atmosphere and variety of meat options, this place aligns well with the user's preferences.",
            "CdAmgWWCabZQoYNNWOKcEw": "Although still a good option, it is less focused on meat offerings compared to the top two.",
            "dFYfZsc-SUwRpDEgJiIoXA": "This restaurant ranks lowest as it may not have as strong a reputation for meat dishes or a notable ambiance in Singapore."
        }
    },
    "zXqCvcijJQNeUuyKjGtXpQ": {
        "kw": [
            "meat",
            "service",
            "singapore",
            "center",
            "restaurant"
        ],
        "candidate": [
            "mcFT96dzIsrtGdd9JNmIzw",
            "O9bHfze9mllbK8FeGKcnSA",
            "EqdAzi9c5xuhxN9brmEaZw",
            "Egkl60a0DcH7n87Pr9neqg",
            "x0Pk5Uvy0y63FSzcfmxRpQ."
        ],
        "explanation": {
            "mcFT96dzIsrtGdd9JNmIzw": "This restaurant offers a renowned selection of meat dishes coupled with outstanding service, making it a top choice for carnivores.",
            "O9bHfze9mllbK8FeGKcnSA": "Known for its flavorful meat options and quality service, it ranks high but slightly lower than the top choice.",
            "EqdAzi9c5xuhxN9brmEaZw": "This venue provides decent meat dishes and attentive service, fitting the user’s location preferences.",
            "Egkl60a0DcH7n87Pr9neqg": "While it offers some meat options, it lacks the same level of service as the top three contenders.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "Focused more on a varied menu with limited meat options, this restaurant falls last due to less emphasis on the user's primary preferences."
        }
    },
    "DQsfkUeLoOLD3zjRIWoRVg": {
        "kw": [
            "desserts",
            "people",
            "service",
            "food",
            "location"
        ],
        "candidate": [
            "mnaTW8Wm0ESJXf4qqDtS9A",
            "6LgTc7CZlXCd1Pxq3BiVcw",
            "-WRbjOIgvQQ3jlJnvKUBNA",
            "ib_206uhcdzV7lNcCpniXA."
        ],
        "explanation": {
            "mnaTW8Wm0ESJXf4qqDtS9A": "Ranked highest for its outstanding dessert menu and attentive service, making it a favorite for customers who enjoy a lively atmosphere.",
            "6LgTc7CZlXCd1Pxq3BiVcw": "Offers excellent food and a good variety of desserts, along with a decent social environment.",
            "-WRbjOIgvQQ3jlJnvKUBNA": "Known for decent food and service, but dessert options are limited compared to higher-ranked choices.",
            "ib_206uhcdzV7lNcCpniXA": "While it has solid food offerings, it excels least in desserts and the overall dining experience relative to other selections."
        }
    },
    "XQ6VtlcqPthCjWJUCFa8Zw": {
        "kw": [
            "desserts",
            "fruits",
            "course",
            "coffee",
            "loads"
        ],
        "candidate": [
            "_HMiq7vSET4uhNScBdOJnw",
            "vZiWYH4XIiy3fqPNy615Kg",
            "_kuDz_Uf6JbARZEfNpkl8Q"
        ],
        "explanation": {
            "_HMiq7vSET4uhNScBdOJnw": "This restaurant offers a wide variety of high-quality desserts and coffee, making it the top choice for the user.",
            "vZiWYH4XIiy3fqPNy615Kg": "Known for its delightful fruit-based desserts and good coffee, this place is a solid second pick.",
            "_kuDz_Uf6JbARZEfNpkl8Q": "Although it has good offerings, it falls short in dessert and fruit variety compared to the others."
        }
    },
    "HSzr1NvgKdUfZoMJs6Ra3w": {
        "kw": [
            "dessert",
            "food",
            "menu",
            "other dishes",
            "egg"
        ],
        "candidate": [
            "U3i7AaegudvpmDL23_wEmQ",
            "x44o1_Dw4QsQZRtBJgwZaA",
            "rz8khUD2Amv1lBoIiwpEWw",
            "I1wArJIYbFl2txUL6unC6A",
            "NRrWbjN1X1X7Z1z_u5bFKQ"
        ],
        "explanation": {
            "U3i7AaegudvpmDL23_wEmQ": "Known for its extensive dessert menu and a variety of egg dishes, it fits the user's dessert and food preferences perfectly.",
            "x44o1_Dw4QsQZRtBJgwZaA": "Offers a balanced menu with great food options and notable desserts, making it a strong contender for the user’s taste.",
            "rz8khUD2Amv1lBoIiwpEWw": "This restaurant has a good selection of dishes, though its dessert offerings are not as extensive as the top two.",
            "I1wArJIYbFl2txUL6unC6A": "While it has decent food options, it lacks in the dessert category compared to others in the ranking.",
            "NRrWbjN1X1X7Z1z_u5bFKQ": "Although it is a solid choice, it offers fewer desserts and egg options, placing it last in this ranking."
        }
    },
    "GxvTcyoxfR1rmd_KMWF9aw": {
        "kw": [
            "waiter",
            "service",
            "food",
            "stars",
            "staff"
        ],
        "candidate": [
            "x44o1_Dw4QsQZRtBJgwZaA",
            "bjL1PC2e9dvjBVewmoXYwQ",
            "I1wArJIYbFl2txUL6unC6A",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "hSEGyy0-i1_ZXGIRySbgcg"
        ],
        "explanation": {
            "x44o1_Dw4QsQZRtBJgwZaA": "Known for exceptional waiter attentiveness and high-quality food, making it a top choice.",
            "bjL1PC2e9dvjBVewmoXYwQ": "Offers excellent service and a welcoming atmosphere along with tasty dishes.",
            "I1wArJIYbFl2txUL6unC6A": "Provides good food and decent service, but not as strong in staff engagement.",
            "vVqxGrqt5ALxQjJGnntpKQ": "While the food is enjoyable, the service can be inconsistent.",
            "hSEGyy0-i1_ZXGIRySbgcg": "Generally decent performance, but doesn’t stand out in waiter interaction or food quality."
        }
    },
    "b-shuWlFnuSCeLqOeky8tA": {
        "kw": [
            "caution",
            "singapore",
            "menu",
            "fruit",
            "favorite places"
        ],
        "candidate": [
            "_HMiq7vSET4uhNScBdOJnw",
            "sxQdEEfKRviWRymOoH9UiA",
            "_kuDz_Uf6JbARZEfNpkl8Q",
            "lE9qVePgvolkhw6C3Cdkeg",
            "_e7yPjlgOAF7z8PssDamug"
        ],
        "explanation": {
            "_HMiq7vSET4uhNScBdOJnw": "This restaurant has a well-balanced menu with several fruit-based dishes, catering to both health-conscious eaters and those who enjoy exploring diverse flavors.",
            "sxQdEEfKRviWRymOoH9UiA": "Known for its fusion cuisine, this restaurant offers a variety of dishes featuring fruits, aligning well with the user's preferences while still being safe in flavor combinations.",
            "_kuDz_Uf6JbARZEfNpkl8Q": "While it has a somewhat limited menu, it includes fresh fruit options and generally maintains a cautious approach to its dishes.",
            "lE9qVePgvolkhw6C3Cdkeg": "This restaurant is a favorite for its consistency but lacks the variety of fruity menu items that the user prefers.",
            "_e7yPjlgOAF7z8PssDamug": "Although it offers some safe options, it does not highlight fruits prominently enough to meet the user's specific preference."
        }
    },
    "xFDRt8cv--y1tvEhqX_DHw": {
        "kw": [
            "total",
            "food",
            "times",
            "table",
            "wife"
        ],
        "candidate": [
            "I1wArJIYbFl2txUL6unC6A",
            "EqdAzi9c5xuhxN9brmEaZw",
            "hSEGyy0-i1_ZXGIRySbgcg",
            "LFknVw6uTIaL-MY_RqkN7g",
            "vVqxGrqt5ALxQjJGnntpKQ"
        ],
        "explanation": {
            "I1wArJIYbFl2txUL6unC6A": "This restaurant offers a highly rated culinary experience and a romantic atmosphere, perfect for dining with your wife.",
            "EqdAzi9c5xuhxN9brmEaZw": "Known for its diverse and delicious menu options, this place is another great spot for couples looking to enjoy quality food together.",
            "hSEGyy0-i1_ZXGIRySbgcg": "Although slightly less focused on the dining atmosphere, it still provides good food and can accommodate couples well.",
            "LFknVw6uTIaL-MY_RqkN7g": "This restaurant is solid but doesn't quite match the overall dining experience and ambiance that is preferable for a couple.",
            "vVqxGrqt5ALxQjJGnntpKQ": "While it has its merits, it ranks lowest due to less emphasis on the romantic dining experience and overall atmosphere."
        }
    },
    "BDLd6HfU_C6-6URrLRLrnw": {
        "kw": [
            "people",
            "service",
            "food",
            "great place",
            "one"
        ],
        "candidate": [
            "at7wfECnjgIJi5o7gL8fyQ",
            "bjL1PC2e9dvjBVewmoXYwQ",
            "Rl318hUrGlkPJhMmNNZizQ",
            "U3i7AaegudvpmDL23_wEmQ",
            "Dn83poKTVhWL3ItLdalmYw"
        ],
        "explanation": {
            "at7wfECnjgIJi5o7gL8fyQ": "Offers excellent service and a vibrant atmosphere ideal for socializing.",
            "bjL1PC2e9dvjBVewmoXYwQ": "Known for its fantastic food and attentive staff, making it a great place to enjoy with others.",
            "Rl318hUrGlkPJhMmNNZizQ": "Although good, it doesn't quite match the social vibe of the top two.",
            "U3i7AaegudvpmDL23_wEmQ": "A good place but sometimes lacks the service quality prioritized by the user.",
            "Dn83poKTVhWL3ItLdalmYw": "This restaurant offers decent food but doesn't provide the lively atmosphere the user desires."
        }
    },
    "6OaTrornYAPhU-M7A8wubg": {
        "kw": [
            "people",
            "service",
            "food",
            "singapore",
            "location"
        ],
        "candidate": [
            "1nw-_Bm8sivTBZ7Z-uiVCA",
            "sxQdEEfKRviWRymOoH9UiA",
            "CdAmgWWCabZQoYNNWOKcEw",
            "UPRFpMsB4I64GRjUqjRmiw"
        ],
        "explanation": {
            "1nw-_Bm8sivTBZ7Z-uiVCA": "Known for excellent service and a vibrant atmosphere, making it ideal for social dining experiences.",
            "sxQdEEfKRviWRymOoH9UiA": "High-quality food and service, popular among locals which enhances the social aspect.",
            "CdAmgWWCabZQoYNNWOKcEw": "Offers good food but slightly less emphasis on service and atmosphere compared to the top two.",
            "UPRFpMsB4I64GRjUqjRmiw": "While it has decent food, it falls short in service and the welcoming atmosphere preferred by the user."
        }
    },
    "MsNATWFEcNUtF48INY7Kig": {
        "kw": [
            "pax",
            "service",
            "food",
            "singapore",
            "staff"
        ],
        "candidate": [
            "J9rMt_V1NX49rU3YUjh_7Q",
            "AQEEH7JP1DFrvFuMi6TP2Q",
            "Z9oNUI_dlEKjhEWuG-hxPA",
            "n2CnBRKK82cWZ9a2OjS2xQ",
            "Po0Qb6X_g8b00OggqtATRA"
        ],
        "explanation": {
            "J9rMt_V1NX49rU3YUjh_7Q": "Best reputation for service quality and consistent food excellence in Singapore.",
            "AQEEH7JP1DFrvFuMi6TP2Q": "Known for attentive staff and a pleasant dining atmosphere.",
            "Z9oNUI_dlEKjhEWuG-hxPA": "Offers a unique menu with good service, making it a popular choice.",
            "n2CnBRKK82cWZ9a2OjS2xQ": "Good food but slightly lacking in service compared to those ranked above.",
            "Po0Qb6X_g8b00OggqtATRA": "While it has decent food, service experiences have been inconsistent recently."
        }
    },
    "bF6PqsugCWjBZ-RVIJzrmQ": {
        "kw": [
            "service",
            "singapore",
            "pizza",
            "appetite",
            "dining"
        ],
        "candidate": [
            "NMz0wMYMTnsyC_sulMLwlA",
            "TzKx4KbFOzLX0v7F31cSpw",
            "MqdAYfl1p_c1144i48k6jw",
            "NCwX8t4pHpcAMzSCaC2Hww"
        ],
        "explanation": {
            "NMz0wMYMTnsyC_sulMLwlA": "This restaurant is known for outstanding service and has a diverse pizza menu, making it the top choice for the user.",
            "TzKx4KbFOzLX0v7F31cSpw": "A solid choice for pizza lovers, it also offers a comfortable dining atmosphere and good service, placing it second.",
            "MqdAYfl1p_c1144i48k6jw": "While it serves pizza, the service is fairly average compared to the top two, which impacts its ranking.",
            "NCwX8t4pHpcAMzSCaC2Hww": "This option is further down the list primarily due to less favorable service reviews despite having a reasonable food selection."
        }
    },
    "BbAr5pdyz1kPApiilQA2jQ": {
        "kw": [
            "service",
            "food",
            "singapore",
            "great place",
            "location"
        ],
        "candidate": [
            "_HMiq7vSET4uhNScBdOJnw",
            "YnnYwfMEeSru_cJ_qKeofw",
            "ahlZC7XOKN-XJ7P4sPZrRg",
            "J9rMt_V1NX49rU3YUjh_7Q"
        ],
        "explanation": {
            "_HMiq7vSET4uhNScBdOJnw": "Renowned for its exceptional service and high-quality cuisine, making it a standout option.",
            "YnnYwfMEeSru_cJ_qKeofw": "Offers excellent food in a great location, complemented by friendly service.",
            "ahlZC7XOKN-XJ7P4sPZrRg": "Good food and service, but slightly less appealing location compared to the top choices.",
            "J9rMt_V1NX49rU3YUjh_7Q": "While it has decent offerings, it does not match the overall experience provided by the others."
        }
    },
    "muNBd72RI-WhHLlwIYaWRA": {
        "kw": [
            "service",
            "food",
            "restaurant",
            "price",
            "seasoning"
        ],
        "candidate": [
            "6LgTc7CZlXCd1Pxq3BiVcw",
            "vVqxGrqt5ALxQjJGnntpKQ",
            "i5dxKKLe2kJ8WbPUXilPGg",
            "x44o1_Dw4QsQZRtBJgwZaA",
            "r1W_Co451x1A1GCMkukMNw"
        ],
        "explanation": {
            "6LgTc7CZlXCd1Pxq3BiVcw": "This restaurant is known for its outstanding service and a menu that beautifully highlights seasoning, making it a top choice for the user.",
            "vVqxGrqt5ALxQjJGnntpKQ": "This spot offers a great balance of delicious food and good service at reasonable prices, which appeals to the user's preferences.",
            "i5dxKKLe2kJ8WbPUXilPGg": "Placed here for its decent food quality and service, but may not shine as brightly in terms of seasoning compared to others above it.",
            "x44o1_Dw4QsQZRtBJgwZaA": "While it has good food, the service and overall experience do not match the top-ranked restaurants, reducing its appeal.",
            "r1W_Co451x1A1GCMkukMNw": "This restaurant falls last due to inconsistent service and flavor profiles that do not align well with the user's seasoning preference."
        }
    },
    "8VAqRRuJy2oaZAVL9QZ49Q": {
        "kw": [
            "service",
            "food",
            "lunch",
            "order",
            "credit cards"
        ],
        "candidate": [
            "e7Yr0xwLi73tP2aQ2PjA_w",
            "gMZsbtlUdmhGOFf_yyDE2Q",
            "vVUPpLa7C0PCqhWHPDaLfQ",
            "nCwEzk4Z1lX5PvLEYpbBHw",
            "DDd3TW3lDvQduqmw-UkrUg"
        ],
        "explanation": {
            "e7Yr0xwLi73tP2aQ2PjA_w": "Known for excellent service and a variety of lunch options, making it a top choice for quick orders.",
            "gMZsbtlUdmhGOFf_yyDE2Q": "Offers great food quality with prompt service and accepts credit cards, suitable for lunch takeout.",
            "vVUPpLa7C0PCqhWHPDaLfQ": "Provides decent service and food but may have less convenient order options compared to the top two.",
            "nCwEzk4Z1lX5PvLEYpbBHw": "Good food but slower service and may not cater to lunch orders as efficiently.",
            "DDd3TW3lDvQduqmw-UkrUg": "Although it has good food, it is ranked lower due to less favorable service and order processes for lunch."
        }
    },
    "tcl9C7lTC6BKq9AlnJFplQ": {
        "kw": [
            "service",
            "food",
            "drinks",
            "good service",
            "view"
        ],
        "candidate": [
            "LFknVw6uTIaL-MY_RqkN7g",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "0W5UWAcjwGuCJOv8rXGMqw",
            "6xx2FpMxjwabEHz_t2MiZg",
            "at7wfECnjgIJi5o7gL8fyQ."
        ],
        "explanation": {
            "LFknVw6uTIaL-MY_RqkN7g": "This restaurant excels in both service and food quality, with an impressive drinks menu and beautiful views that enhance the dining experience.",
            "J9rMt_V1NX49rU3YUjh_7Q": "Noted for its exceptional service and delightful food offerings, this spot also provides a nice ambiance, making it a solid choice for the user’s preferences.",
            "0W5UWAcjwGuCJOv8rXGMqw": "While praised for its food, the service has been inconsistent, although it still offers decent drink selections and a pleasant atmosphere.",
            "6xx2FpMxjwabEHz_t2MiZg": "Offers good food and drinks but lacks the standout service and scenic views that the user prefers.",
            "at7wfECnjgIJi5o7gL8fyQ": "Initially ranked higher, but it has been noted for underwhelming service and food quality, thus lowering its position in this recommendation."
        }
    },
    "sa2jTUdR3kasSZea_W9RZA": {
        "kw": [
            "food",
            "singapore",
            "ambience",
            "rice",
            "curry"
        ],
        "candidate": [
            "K0jxSR_b1Bm4vmjCeSx9qA",
            "gzBoOo4E1ornEHYod52uew",
            "U3i7AaegudvpmDL23_wEmQ",
            "ymAw53bQVppVV7T40fNgRw",
            "iNVn7TsdKzgrYfRWmWTQOg"
        ],
        "explanation": {
            "K0jxSR_b1Bm4vmjCeSx9qA": "Known for its authentic Singaporean curry dishes and a vibrant atmosphere that enhances the dining experience.",
            "gzBoOo4E1ornEHYod52uew": "Offers a fantastic variety of rice-based meals and curries, with a warm ambience perfect for enjoying meals.",
            "U3i7AaegudvpmDL23_wEmQ": "A versatile menu featuring local flavors and a cozy setting, though slightly less focused on curry.",
            "ymAw53bQVppVV7T40fNgRw": "While it has good food and ambience, it may not offer a strong emphasis on curry or rice dishes.",
            "iNVn7TsdKzgrYfRWmWTQOg": "Although enjoyable, it ranks lower as it does not specialize in the user's preferred cuisine types."
        }
    },
    "CpGjjYQ8LRBmAn6ARE9qWA": {
        "kw": [
            "food",
            "day",
            "selection",
            "mind",
            "morning"
        ],
        "candidate": [
            "KX5KY8fLlMoJMS1NAj0Pvw",
            "mcFT96dzIsrtGdd9JNmIzw",
            "Xtr2M_mh9_jOkmpNd_CSCA",
            "0e30ReHOmL2GzY_3hEy_Ig"
        ],
        "explanation": {
            "KX5KY8fLlMoJMS1NAj0Pvw": "This restaurant is known for its extensive breakfast menu and variety of options, making it ideal for morning dining.",
            "mcFT96dzIsrtGdd9JNmIzw": "Offers a good selection of food that is suitable for various tastes, but is slightly less specialized for morning meals.",
            "Xtr2M_mh9_jOkmpNd_CSCA": "While it has quality offerings, it lacks the same level of selection for breakfast items as the top two.",
            "0e30ReHOmL2GzY_3hEy_Ig": "This restaurant has the least focus on morning dining and is therefore placed last due to user preferences."
        }
    },
    "-_iULENf28RbqL2k0ja5Xw": {
        "kw": [
            "singapore",
            "rice",
            "friend",
            "none",
            "one"
        ],
        "candidate": [
            "Rwzp59f3Ia-v2V8Ku0zZWQ",
            "NbQH02mMYJ4r1RqvG2FDBA",
            "ADtSvzL_abKwWPM1EL2yJw"
        ],
        "explanation": {
            "Rwzp59f3Ia-v2V8Ku0zZWQ": "Known for its authentic Singaporean rice dishes and a welcoming vibe, making it ideal for dining with a friend.",
            "NbQH02mMYJ4r1RqvG2FDBA": "Offers a variety of rice options with a focus on local flavors, while still providing a friendly environment.",
            "ADtSvzL_abKwWPM1EL2yJw": "Although it serves rice dishes, it may not offer as strong a Singaporean flavor or the same level of friendliness as the others."
        }
    },
    "jV3vIpih0GPmIXOtXqs0VA": {
        "kw": [
            "singapore",
            "rice",
            "price",
            "drinks",
            "flavor"
        ],
        "candidate": [
            "DDd3TW3lDvQduqmw-UkrUg",
            "7LFdimtQU3yrgiKyE53klQ",
            "NbQH02mMYJ4r1RqvG2FDBA",
            "pKNDz1tzC5llbengNUz_7w"
        ],
        "explanation": {
            "DDd3TW3lDvQduqmw-UkrUg": "This restaurant excels in authentic Singaporean rice dishes and offers a variety of drinks, aligning well with the user’s preferences.",
            "7LFdimtQU3yrgiKyE53klQ": "Known for its flavorful rice options, it provides good value and a selection of beverages that appeal to the user's taste.",
            "NbQH02mMYJ4r1RqvG2FDBA": "Offers decent rice dishes at reasonable prices, but lacks the drink variety of the top two.",
            "pKNDz1tzC5llbengNUz_7w": "While it has some flavor, its offerings are less focused on rice and drinks compared to the others, making it the least preferred option."
        }
    },
    "WwTYfD8TysD1isAEhSEOoA": {
        "kw": [
            "singapore",
            "star",
            "great ambiance",
            "small side",
            "fast service"
        ],
        "candidate": [
            "lJ5YkS5fxC8dcSK4FPtyYQ",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "bjL1PC2e9dvjBVewmoXYwQ",
            "MfspClBaUOwUwj7BBf3xSw"
        ],
        "explanation": {
            "lJ5YkS5fxC8dcSK4FPtyYQ": "Known for its exceptional Singaporean offerings and intimate setting, providing a great ambiance.",
            "J9rMt_V1NX49rU3YUjh_7Q": "Offers a cozy environment with quick service, appealing to the user's preference for fast dining.",
            "bjL1PC2e9dvjBVewmoXYwQ": "Provides a decent menu but lacks the ambiance and quick service the user desires.",
            "MfspClBaUOwUwj7BBf3xSw": "While it may have good food, it doesn't quite match the request for ambiance and speed."
        }
    },
    "NvVj9v3RvQRZuYwnkRjU2w": {
        "kw": [
            "end",
            "meal",
            "bowl",
            "portion",
            "menu"
        ],
        "candidate": [
            "i5dxKKLe2kJ8WbPUXilPGg",
            "avrJOt2Kzk7fUpe4D4_DAQ",
            "x0Pk5Uvy0y63FSzcfmxRpQ",
            "J9rMt_V1NX49rU3YUjh_7Q",
            "fY1IkBnRft1KR0O2tqu7pg"
        ],
        "explanation": {
            "i5dxKKLe2kJ8WbPUXilPGg": "Offers hearty bowl meals with a wide variety of choices that cater well to portion preferences.",
            "avrJOt2Kzk7fUpe4D4_DAQ": "Known for its flavorful bowls and generous servings that align with user’s desire for a satisfying meal.",
            "x0Pk5Uvy0y63FSzcfmxRpQ": "Provides decent bowl options but with a less diverse menu than the top two recommendations.",
            "J9rMt_V1NX49rU3YUjh_7Q": "While offering good meals, it falls short in portion size compared to higher-ranked restaurants.",
            "fY1IkBnRft1KR0O2tqu7pg": "Ranked last due to limited bowl offerings and smaller portions that may not satisfy the user's preferences."
        }
    },
    "MBM7W-xDSEJkYpYPUT6-vA": {
        "kw": [
            "meal",
            "lunch",
            "things",
            "breakfast",
            "favorite"
        ],
        "candidate": [
            "Yf4RhB-uTRcZc3l-1icBmw",
            "TzKx4KbFOzLX0v7F31cSpw",
            "JG3Yw6z48y6Eyi0DnN19tQ",
            "4ZOXsBhHx2EzrTwACILK2A"
        ],
        "explanation": {
            "Yf4RhB-uTRcZc3l-1icBmw": "This restaurant specializes in a variety of breakfast and brunch options, making it ideal for the user's preference for breakfast and lunch meals.",
            "TzKx4KbFOzLX0v7F31cSpw": "A popular spot known for its all-day breakfast, ensuring satisfying meal choices any time of the day.",
            "JG3Yw6z48y6Eyi0DnN19tQ": "Offers decent lunch options, but is less focused on breakfast compared to the top two.",
            "4ZOXsBhHx2EzrTwACILK2A": "While it has good lunch offerings, it lacks a strong breakfast menu, making it the least suitable option for the user."
        }
    }
}